espressif/arduino-esp32/boards.txt
esp32s3-octal.menu.LoopCore.1=Core 1
esp32s3-octal.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3-octal.menu.LoopCore.0=Core 0
esp32s3-octal.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32s3-octal.menu.EventsCore.1=Core 1
esp32s3-octal.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32s3-octal.menu.EventsCore.0=Core 0
esp32s3-octal.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32s3-octal.menu.USBMode.hwcdc=Hardware CDC and JTAG
esp32s3-octal.menu.USBMode.hwcdc.build.usb_mode=1
esp32s3-octal.menu.USBMode.default=USB-OTG (TinyUSB)
esp32s3-octal.menu.USBMode.default.build.usb_mode=0

esp32s3-octal.menu.CDCOnBoot.default=Disabled
esp32s3-octal.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32s3-octal.menu.CDCOnBoot.cdc=Enabled
esp32s3-octal.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32s3-octal.menu.MSCOnBoot.default=Disabled
esp32s3-octal.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s3-octal.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
esp32s3-octal.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s3-octal.menu.DFUOnBoot.default=Disabled
esp32s3-octal.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s3-octal.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
esp32s3-octal.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

esp32s3-octal.menu.UploadMode.default=UART0 / Hardware CDC
esp32s3-octal.menu.UploadMode.default.upload.use_1200bps_touch=false
esp32s3-octal.menu.UploadMode.default.upload.wait_for_upload_port=false
esp32s3-octal.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
esp32s3-octal.menu.UploadMode.cdc.upload.use_1200bps_touch=true
esp32s3-octal.menu.UploadMode.cdc.upload.wait_for_upload_port=true

esp32s3-octal.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3-octal.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s3-octal.menu.PartitionScheme.default.build.partitions=default
esp32s3-octal.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s3-octal.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s3-octal.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s3-octal.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s3-octal.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s3-octal.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s3-octal.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s3-octal.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s3-octal.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s3-octal.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s3-octal.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s3-octal.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s3-octal.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s3-octal.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s3-octal.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s3-octal.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s3-octal.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s3-octal.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s3-octal.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s3-octal.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s3-octal.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s3-octal.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s3-octal.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s3-octal.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s3-octal.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s3-octal.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s3-octal.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s3-octal.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s3-octal.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3-octal.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s3-octal.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s3-octal.menu.PartitionScheme.rainmaker=RainMaker 4MB
esp32s3-octal.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s3-octal.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
esp32s3-octal.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
esp32s3-octal.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
esp32s3-octal.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
esp32s3-octal.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
esp32s3-octal.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
esp32s3-octal.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
esp32s3-octal.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
esp32s3-octal.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
esp32s3-octal.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
esp32s3-octal.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
esp32s3-octal.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
esp32s3-octal.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
esp32s3-octal.menu.PartitionScheme.app13M_data7M_32MB=32M Flash (13MB APP/6.75MB SPIFFS)
esp32s3-octal.menu.PartitionScheme.app13M_data7M_32MB.build.partitions=default_32MB
esp32s3-octal.menu.PartitionScheme.app13M_data7M_32MB.upload.maximum_size=13107200

esp32s3-octal.menu.CPUFreq.240=240MHz (WiFi)
esp32s3-octal.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s3-octal.menu.CPUFreq.160=160MHz (WiFi)
esp32s3-octal.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s3-octal.menu.CPUFreq.80=80MHz (WiFi)
esp32s3-octal.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s3-octal.menu.CPUFreq.40=40MHz
esp32s3-octal.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s3-octal.menu.CPUFreq.20=20MHz
esp32s3-octal.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s3-octal.menu.CPUFreq.10=10MHz
esp32s3-octal.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s3-octal.menu.UploadSpeed.921600=921600
esp32s3-octal.menu.UploadSpeed.921600.upload.speed=921600
esp32s3-octal.menu.UploadSpeed.115200=115200
esp32s3-octal.menu.UploadSpeed.115200.upload.speed=115200
esp32s3-octal.menu.UploadSpeed.256000.windows=256000
esp32s3-octal.menu.UploadSpeed.256000.upload.speed=256000
esp32s3-octal.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s3-octal.menu.UploadSpeed.230400=230400
esp32s3-octal.menu.UploadSpeed.230400.upload.speed=230400
esp32s3-octal.menu.UploadSpeed.460800.linux=460800
esp32s3-octal.menu.UploadSpeed.460800.macosx=460800
esp32s3-octal.menu.UploadSpeed.460800.upload.speed=460800
esp32s3-octal.menu.UploadSpeed.512000.windows=512000
esp32s3-octal.menu.UploadSpeed.512000.upload.speed=512000

