espressif/arduino-esp32/boards.txt
esp32wroverkit.menu.FlashSize.4M=4MB (32Mb)
esp32wroverkit.menu.FlashSize.4M.build.flash_size=4MB
esp32wroverkit.menu.FlashSize.8M=8MB (64Mb)
esp32wroverkit.menu.FlashSize.8M.build.flash_size=8MB
esp32wroverkit.menu.FlashSize.2M=2MB (16Mb)
esp32wroverkit.menu.FlashSize.2M.build.flash_size=2MB
esp32wroverkit.menu.FlashSize.16M=16MB (128Mb)
esp32wroverkit.menu.FlashSize.16M.build.flash_size=16MB

esp32wroverkit.menu.PSRAM.enabled=Enabled
esp32wroverkit.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
esp32wroverkit.menu.PSRAM.disabled=Disabled
esp32wroverkit.menu.PSRAM.disabled.build.defines=

esp32wroverkit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32wroverkit.menu.PartitionScheme.default.build.partitions=default
esp32wroverkit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32wroverkit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32wroverkit.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32wroverkit.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32wroverkit.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32wroverkit.menu.PartitionScheme.default_16MB=16M with spiffs (6.25MB APP/3.43MB SPIFFS)
esp32wroverkit.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
esp32wroverkit.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
esp32wroverkit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32wroverkit.menu.PartitionScheme.minimal.build.partitions=minimal
esp32wroverkit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32wroverkit.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32wroverkit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32wroverkit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32wroverkit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32wroverkit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32wroverkit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32wroverkit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32wroverkit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32wroverkit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32wroverkit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32wroverkit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32wroverkit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32wroverkit.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32wroverkit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32wroverkit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32wroverkit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32wroverkit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32wroverkit.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32wroverkit.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32wroverkit.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32wroverkit.menu.PartitionScheme.rainmaker=RainMaker 4MB
esp32wroverkit.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32wroverkit.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
esp32wroverkit.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
esp32wroverkit.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
esp32wroverkit.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
esp32wroverkit.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
esp32wroverkit.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
esp32wroverkit.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

esp32wroverkit.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32wroverkit.menu.CPUFreq.240.build.f_cpu=240000000L
esp32wroverkit.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32wroverkit.menu.CPUFreq.160.build.f_cpu=160000000L
esp32wroverkit.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32wroverkit.menu.CPUFreq.80.build.f_cpu=80000000L
esp32wroverkit.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32wroverkit.menu.CPUFreq.40.build.f_cpu=40000000L
esp32wroverkit.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32wroverkit.menu.CPUFreq.26.build.f_cpu=26000000L
esp32wroverkit.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32wroverkit.menu.CPUFreq.20.build.f_cpu=20000000L
esp32wroverkit.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32wroverkit.menu.CPUFreq.13.build.f_cpu=13000000L
esp32wroverkit.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32wroverkit.menu.CPUFreq.10.build.f_cpu=10000000L

esp32wroverkit.menu.FlashMode.qio=QIO
esp32wroverkit.menu.FlashMode.qio.build.flash_mode=dio
esp32wroverkit.menu.FlashMode.qio.build.boot=qio
esp32wroverkit.menu.FlashMode.dio=DIO
esp32wroverkit.menu.FlashMode.dio.build.flash_mode=dio
esp32wroverkit.menu.FlashMode.dio.build.boot=dio
esp32wroverkit.menu.FlashFreq.80=80MHz
esp32wroverkit.menu.FlashFreq.80.build.flash_freq=80m
esp32wroverkit.menu.FlashFreq.40=40MHz
esp32wroverkit.menu.FlashFreq.40.build.flash_freq=40m

esp32wroverkit.menu.UploadSpeed.921600=921600
esp32wroverkit.menu.UploadSpeed.921600.upload.speed=921600
esp32wroverkit.menu.UploadSpeed.115200=115200
esp32wroverkit.menu.UploadSpeed.115200.upload.speed=115200
esp32wroverkit.menu.UploadSpeed.256000.windows=256000
esp32wroverkit.menu.UploadSpeed.256000.upload.speed=256000
esp32wroverkit.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32wroverkit.menu.UploadSpeed.230400=230400
esp32wroverkit.menu.UploadSpeed.230400.upload.speed=230400
esp32wroverkit.menu.UploadSpeed.460800.linux=460800
esp32wroverkit.menu.UploadSpeed.460800.macosx=460800
esp32wroverkit.menu.UploadSpeed.460800.upload.speed=460800
esp32wroverkit.menu.UploadSpeed.512000.windows=512000
esp32wroverkit.menu.UploadSpeed.512000.upload.speed=512000

esp32wroverkit.menu.DebugLevel.none=None
esp32wroverkit.menu.DebugLevel.none.build.code_debug=0
esp32wroverkit.menu.DebugLevel.error=Error
esp32wroverkit.menu.DebugLevel.error.build.code_debug=1
esp32wroverkit.menu.DebugLevel.warn=Warn
esp32wroverkit.menu.DebugLevel.warn.build.code_debug=2
esp32wroverkit.menu.DebugLevel.info=Info
esp32wroverkit.menu.DebugLevel.info.build.code_debug=3
esp32wroverkit.menu.DebugLevel.debug=Debug
esp32wroverkit.menu.DebugLevel.debug.build.code_debug=4
esp32wroverkit.menu.DebugLevel.verbose=Verbose
esp32wroverkit.menu.DebugLevel.verbose.build.code_debug=5

esp32wroverkit.menu.EraseFlash.none=Disabled
esp32wroverkit.menu.EraseFlash.none.upload.erase_cmd=
esp32wroverkit.menu.EraseFlash.all=Enabled
esp32wroverkit.menu.EraseFlash.all.upload.erase_cmd=-e

