espressif/arduino-esp32/boards.txt
##############################################################


BharatPi-A7672S-4G.name=BharatPi A7672S 4G Module

BharatPi-A7672S-4G.bootloader.tool=esptool_py
BharatPi-A7672S-4G.bootloader.tool.default=esptool_py

BharatPi-A7672S-4G.upload.tool=esptool_py
BharatPi-A7672S-4G.upload.tool.default=esptool_py
BharatPi-A7672S-4G.upload.tool.network=esp_ota

BharatPi-A7672S-4G.upload.maximum_size=1310720
BharatPi-A7672S-4G.upload.maximum_data_size=327680
BharatPi-A7672S-4G.upload.flags=
BharatPi-A7672S-4G.upload.extra_flags=

BharatPi-A7672S-4G.serial.disableDTR=true
BharatPi-A7672S-4G.serial.disableRTS=true

BharatPi-A7672S-4G.build.tarch=xtensa
BharatPi-A7672S-4G.build.bootloader_addr=0x1000
BharatPi-A7672S-4G.build.target=esp32
BharatPi-A7672S-4G.build.mcu=esp32
BharatPi-A7672S-4G.build.core=esp32
BharatPi-A7672S-4G.build.variant=BharatPi-A7672S-4G
BharatPi-A7672S-4G.build.board=BHARATPI_A7672S_4G

BharatPi-A7672S-4G.build.f_cpu=240000000L
BharatPi-A7672S-4G.build.flash_size=4MB
BharatPi-A7672S-4G.build.flash_freq=40m
BharatPi-A7672S-4G.build.flash_mode=dio
BharatPi-A7672S-4G.build.boot=dio
BharatPi-A7672S-4G.build.partitions=default
BharatPi-A7672S-4G.build.defines=
BharatPi-A7672S-4G.build.loop_core=
BharatPi-A7672S-4G.build.event_core=

BharatPi-A7672S-4G.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.default.build.partitions=default
BharatPi-A7672S-4G.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
BharatPi-A7672S-4G.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
BharatPi-A7672S-4G.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
BharatPi-A7672S-4G.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
BharatPi-A7672S-4G.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.minimal.build.partitions=minimal
BharatPi-A7672S-4G.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.no_ota.build.partitions=no_ota
BharatPi-A7672S-4G.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
BharatPi-A7672S-4G.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
BharatPi-A7672S-4G.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
BharatPi-A7672S-4G.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
BharatPi-A7672S-4G.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
BharatPi-A7672S-4G.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
BharatPi-A7672S-4G.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
BharatPi-A7672S-4G.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
BharatPi-A7672S-4G.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
BharatPi-A7672S-4G.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.huge_app.build.partitions=huge_app
BharatPi-A7672S-4G.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
BharatPi-A7672S-4G.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
BharatPi-A7672S-4G.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
BharatPi-A7672S-4G.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
BharatPi-A7672S-4G.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
BharatPi-A7672S-4G.menu.PartitionScheme.fatflash.build.partitions=ffat
BharatPi-A7672S-4G.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
BharatPi-A7672S-4G.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
BharatPi-A7672S-4G.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
BharatPi-A7672S-4G.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
BharatPi-A7672S-4G.menu.PartitionScheme.rainmaker=RainMaker
BharatPi-A7672S-4G.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
BharatPi-A7672S-4G.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
BharatPi-A7672S-4G.menu.PartitionScheme.custom=Custom
BharatPi-A7672S-4G.menu.PartitionScheme.custom.build.partitions=
BharatPi-A7672S-4G.menu.PartitionScheme.custom.upload.maximum_size=16777216

BharatPi-A7672S-4G.menu.CPUFreq.240=240MHz (WiFi/BT)
BharatPi-A7672S-4G.menu.CPUFreq.240.build.f_cpu=240000000L
BharatPi-A7672S-4G.menu.CPUFreq.160=160MHz (WiFi/BT)
BharatPi-A7672S-4G.menu.CPUFreq.160.build.f_cpu=160000000L
BharatPi-A7672S-4G.menu.CPUFreq.80=80MHz (WiFi/BT)
BharatPi-A7672S-4G.menu.CPUFreq.80.build.f_cpu=80000000L
BharatPi-A7672S-4G.menu.CPUFreq.40=40MHz (40MHz XTAL)
BharatPi-A7672S-4G.menu.CPUFreq.40.build.f_cpu=40000000L
BharatPi-A7672S-4G.menu.CPUFreq.26=26MHz (26MHz XTAL)
BharatPi-A7672S-4G.menu.CPUFreq.26.build.f_cpu=26000000L
BharatPi-A7672S-4G.menu.CPUFreq.20=20MHz (40MHz XTAL)
BharatPi-A7672S-4G.menu.CPUFreq.20.build.f_cpu=20000000L
BharatPi-A7672S-4G.menu.CPUFreq.13=13MHz (26MHz XTAL)
BharatPi-A7672S-4G.menu.CPUFreq.13.build.f_cpu=13000000L
BharatPi-A7672S-4G.menu.CPUFreq.10=10MHz (40MHz XTAL)
BharatPi-A7672S-4G.menu.CPUFreq.10.build.f_cpu=10000000L

BharatPi-A7672S-4G.menu.FlashMode.qio=QIO
BharatPi-A7672S-4G.menu.FlashMode.qio.build.flash_mode=dio
BharatPi-A7672S-4G.menu.FlashMode.qio.build.boot=qio
BharatPi-A7672S-4G.menu.FlashMode.dio=DIO
BharatPi-A7672S-4G.menu.FlashMode.dio.build.flash_mode=dio
BharatPi-A7672S-4G.menu.FlashMode.dio.build.boot=dio

BharatPi-A7672S-4G.menu.FlashFreq.80=80MHz
BharatPi-A7672S-4G.menu.FlashFreq.80.build.flash_freq=80m
BharatPi-A7672S-4G.menu.FlashFreq.40=40MHz
BharatPi-A7672S-4G.menu.FlashFreq.40.build.flash_freq=40m

BharatPi-A7672S-4G.menu.FlashSize.4M=4MB (32Mb)
BharatPi-A7672S-4G.menu.FlashSize.4M.build.flash_size=4MB
BharatPi-A7672S-4G.menu.FlashSize.8M=8MB (64Mb)
BharatPi-A7672S-4G.menu.FlashSize.8M.build.flash_size=8MB
BharatPi-A7672S-4G.menu.FlashSize.8M.build.partitions=default_8MB
BharatPi-A7672S-4G.menu.FlashSize.16M=16MB (128Mb)
BharatPi-A7672S-4G.menu.FlashSize.16M.build.flash_size=16MB

