espressif/arduino-esp32/boards.txt
BharatPi-LoRa.menu.UploadSpeed.921600=921600
BharatPi-LoRa.menu.UploadSpeed.921600.upload.speed=921600
BharatPi-LoRa.menu.UploadSpeed.115200=115200
BharatPi-LoRa.menu.UploadSpeed.115200.upload.speed=115200
BharatPi-LoRa.menu.UploadSpeed.256000.windows=256000
BharatPi-LoRa.menu.UploadSpeed.256000.upload.speed=256000
BharatPi-LoRa.menu.UploadSpeed.230400.windows.upload.speed=256000
BharatPi-LoRa.menu.UploadSpeed.230400=230400
BharatPi-LoRa.menu.UploadSpeed.230400.upload.speed=230400
BharatPi-LoRa.menu.UploadSpeed.460800.linux=460800
BharatPi-LoRa.menu.UploadSpeed.460800.macosx=460800
BharatPi-LoRa.menu.UploadSpeed.460800.upload.speed=460800
BharatPi-LoRa.menu.UploadSpeed.512000.windows=512000
BharatPi-LoRa.menu.UploadSpeed.512000.upload.speed=512000

BharatPi-LoRa.menu.LoopCore.1=Core 1
BharatPi-LoRa.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
BharatPi-LoRa.menu.LoopCore.0=Core 0
BharatPi-LoRa.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

BharatPi-LoRa.menu.EventsCore.1=Core 1
BharatPi-LoRa.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
BharatPi-LoRa.menu.EventsCore.0=Core 0
BharatPi-LoRa.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

BharatPi-LoRa.menu.DebugLevel.none=None
BharatPi-LoRa.menu.DebugLevel.none.build.code_debug=0
BharatPi-LoRa.menu.DebugLevel.error=Error
BharatPi-LoRa.menu.DebugLevel.error.build.code_debug=1
BharatPi-LoRa.menu.DebugLevel.warn=Warn
BharatPi-LoRa.menu.DebugLevel.warn.build.code_debug=2
BharatPi-LoRa.menu.DebugLevel.info=Info
BharatPi-LoRa.menu.DebugLevel.info.build.code_debug=3
BharatPi-LoRa.menu.DebugLevel.debug=Debug
BharatPi-LoRa.menu.DebugLevel.debug.build.code_debug=4
BharatPi-LoRa.menu.DebugLevel.verbose=Verbose
BharatPi-LoRa.menu.DebugLevel.verbose.build.code_debug=5

BharatPi-LoRa.menu.EraseFlash.none=Disabled
BharatPi-LoRa.menu.EraseFlash.none.upload.erase_cmd=
BharatPi-LoRa.menu.EraseFlash.all=Enabled
BharatPi-LoRa.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

um_bling.name=UM BLING
um_bling.vid.0=0x303a
um_bling.pid.0=0x817F
um_bling.upload_port.0.vid=0x303a
um_bling.upload_port.0.pid=0x817F

um_bling.bootloader.tool=esptool_py
um_bling.bootloader.tool.default=esptool_py

um_bling.upload.tool=esptool_py
um_bling.upload.tool.default=esptool_py
um_bling.upload.tool.network=esp_ota

um_bling.upload.maximum_size=1310720
um_bling.upload.maximum_data_size=327680
um_bling.upload.flags=
um_bling.upload.extra_flags=
um_bling.upload.use_1200bps_touch=false
um_bling.upload.wait_for_upload_port=false

um_bling.serial.disableDTR=false
um_bling.serial.disableRTS=false

um_bling.build.tarch=xtensa
um_bling.build.bootloader_addr=0x0
um_bling.build.target=esp32s3
um_bling.build.mcu=esp32s3
um_bling.build.core=esp32
um_bling.build.variant=um_bling
um_bling.build.board=BLING

um_bling.build.usb_mode=1
um_bling.build.cdc_on_boot=0
um_bling.build.msc_on_boot=0
um_bling.build.dfu_on_boot=0
um_bling.build.f_cpu=240000000L
um_bling.build.flash_size=8MB
um_bling.build.flash_freq=80m
um_bling.build.flash_mode=dio
um_bling.build.boot=qio
um_bling.build.partitions=default
um_bling.build.defines=
um_bling.build.loop_core=
um_bling.build.event_core=
um_bling.build.flash_type=qio
um_bling.build.psram_type=qspi
um_bling.build.memory_type=qio_qspi

um_bling.menu.LoopCore.1=Core 1
um_bling.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
um_bling.menu.LoopCore.0=Core 0
um_bling.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

um_bling.menu.EventsCore.1=Core 1
um_bling.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
um_bling.menu.EventsCore.0=Core 0
um_bling.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

um_bling.menu.USBMode.hwcdc=Hardware CDC and JTAG
um_bling.menu.USBMode.hwcdc.build.usb_mode=1
um_bling.menu.USBMode.default=USB-OTG (TinyUSB)
um_bling.menu.USBMode.default.build.usb_mode=0

um_bling.menu.CDCOnBoot.cdc=Enabled
um_bling.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_bling.menu.CDCOnBoot.default=Disabled
um_bling.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_bling.menu.MSCOnBoot.default=Disabled
um_bling.menu.MSCOnBoot.default.build.msc_on_boot=0
um_bling.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
um_bling.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_bling.menu.DFUOnBoot.default=Disabled
um_bling.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_bling.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
um_bling.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_bling.menu.UploadMode.default=UART0 / Hardware CDC
um_bling.menu.UploadMode.default.upload.use_1200bps_touch=false
um_bling.menu.UploadMode.default.upload.wait_for_upload_port=false
um_bling.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
um_bling.menu.UploadMode.cdc.upload.use_1200bps_touch=true
um_bling.menu.UploadMode.cdc.upload.wait_for_upload_port=true

um_bling.menu.PSRAM.enabled=Enabled
um_bling.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
um_bling.menu.PSRAM.disabled=Disabled
um_bling.menu.PSRAM.disabled.build.defines=

um_bling.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
um_bling.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
um_bling.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
um_bling.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/3.7MB FFAT)
um_bling.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
um_bling.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
um_bling.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
um_bling.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152

um_bling.menu.CPUFreq.240=240MHz (WiFi)
um_bling.menu.CPUFreq.240.build.f_cpu=240000000L
um_bling.menu.CPUFreq.160=160MHz (WiFi)
um_bling.menu.CPUFreq.160.build.f_cpu=160000000L
um_bling.menu.CPUFreq.80=80MHz (WiFi)
um_bling.menu.CPUFreq.80.build.f_cpu=80000000L
um_bling.menu.CPUFreq.40=40MHz
um_bling.menu.CPUFreq.40.build.f_cpu=40000000L
um_bling.menu.CPUFreq.20=20MHz
um_bling.menu.CPUFreq.20.build.f_cpu=20000000L
um_bling.menu.CPUFreq.10=10MHz
um_bling.menu.CPUFreq.10.build.f_cpu=10000000L

