espressif/arduino-esp32/boards.txt
##############################################################

um_feathers3neo.name=UM FeatherS3 Neo
um_feathers3neo.vid.0=0x303a
um_feathers3neo.pid.0=0x81FB
um_feathers3neo.upload_port.0.vid=0x303a
um_feathers3neo.upload_port.0.pid=0x81FB

um_feathers3neo.bootloader.tool=esptool_py
um_feathers3neo.bootloader.tool.default=esptool_py

um_feathers3neo.upload.tool=esptool_py
um_feathers3neo.upload.tool.default=esptool_py
um_feathers3neo.upload.tool.network=esp_ota

um_feathers3neo.upload.maximum_size=1310720
um_feathers3neo.upload.maximum_data_size=327680
um_feathers3neo.upload.flags=
um_feathers3neo.upload.extra_flags=
um_feathers3neo.upload.use_1200bps_touch=false
um_feathers3neo.upload.wait_for_upload_port=false

um_feathers3neo.serial.disableDTR=false
um_feathers3neo.serial.disableRTS=false

um_feathers3neo.build.tarch=xtensa
um_feathers3neo.build.bootloader_addr=0x0
um_feathers3neo.build.target=esp32s3
um_feathers3neo.build.mcu=esp32s3
um_feathers3neo.build.core=esp32
um_feathers3neo.build.variant=um_feathers3neo
um_feathers3neo.build.board=FEATHERS3NEO

um_feathers3neo.build.usb_mode=1
um_feathers3neo.build.cdc_on_boot=1
um_feathers3neo.build.msc_on_boot=0
um_feathers3neo.build.dfu_on_boot=0
um_feathers3neo.build.f_cpu=240000000L
um_feathers3neo.build.flash_size=8MB
um_feathers3neo.build.flash_freq=80m
um_feathers3neo.build.flash_mode=dio
um_feathers3neo.build.boot=qio
um_feathers3neo.build.partitions=default
um_feathers3neo.build.defines=
um_feathers3neo.build.loop_core=
um_feathers3neo.build.event_core=
um_feathers3neo.build.flash_type=qio
um_feathers3neo.build.psram_type=qspi
um_feathers3neo.build.memory_type=qio_qspi

um_feathers3neo.menu.LoopCore.1=Core 1
um_feathers3neo.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
um_feathers3neo.menu.LoopCore.0=Core 0
um_feathers3neo.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

um_feathers3neo.menu.EventsCore.1=Core 1
um_feathers3neo.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
um_feathers3neo.menu.EventsCore.0=Core 0
um_feathers3neo.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

um_feathers3neo.menu.USBMode.hwcdc=Hardware CDC and JTAG
um_feathers3neo.menu.USBMode.hwcdc.build.usb_mode=1
um_feathers3neo.menu.USBMode.default=USB-OTG (TinyUSB)
um_feathers3neo.menu.USBMode.default.build.usb_mode=0

um_feathers3neo.menu.CDCOnBoot.cdc=Enabled
um_feathers3neo.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_feathers3neo.menu.CDCOnBoot.default=Disabled
um_feathers3neo.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_feathers3neo.menu.MSCOnBoot.default=Disabled
um_feathers3neo.menu.MSCOnBoot.default.build.msc_on_boot=0
um_feathers3neo.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
um_feathers3neo.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_feathers3neo.menu.DFUOnBoot.default=Disabled
um_feathers3neo.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_feathers3neo.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
um_feathers3neo.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_feathers3neo.menu.UploadMode.cdc.upload.wait_for_upload_port=true
um_feathers3neo.menu.UploadMode.default=UART0 / Hardware CDC
um_feathers3neo.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
um_feathers3neo.menu.UploadMode.cdc.upload.use_1200bps_touch=true
um_feathers3neo.menu.UploadMode.default.upload.use_1200bps_touch=false
um_feathers3neo.menu.UploadMode.default.upload.wait_for_upload_port=false

um_feathers3neo.menu.PSRAM.enabled=Enabled
um_feathers3neo.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
um_feathers3neo.menu.PSRAM.disabled=Disabled
um_feathers3neo.menu.PSRAM.disabled.build.defines=

um_feathers3neo.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
um_feathers3neo.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
um_feathers3neo.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
um_feathers3neo.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
um_feathers3neo.menu.PartitionScheme.minimal.build.partitions=minimal
um_feathers3neo.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
um_feathers3neo.menu.PartitionScheme.no_ota.build.partitions=no_ota
um_feathers3neo.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
um_feathers3neo.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
um_feathers3neo.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
um_feathers3neo.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
um_feathers3neo.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
um_feathers3neo.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
um_feathers3neo.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
um_feathers3neo.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
um_feathers3neo.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
um_feathers3neo.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
um_feathers3neo.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
um_feathers3neo.menu.PartitionScheme.huge_app.build.partitions=huge_app
um_feathers3neo.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
um_feathers3neo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
um_feathers3neo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
um_feathers3neo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

um_feathers3neo.menu.CPUFreq.240=240MHz (WiFi)
um_feathers3neo.menu.CPUFreq.240.build.f_cpu=240000000L
um_feathers3neo.menu.CPUFreq.160=160MHz (WiFi)
um_feathers3neo.menu.CPUFreq.160.build.f_cpu=160000000L
um_feathers3neo.menu.CPUFreq.80=80MHz (WiFi)
um_feathers3neo.menu.CPUFreq.80.build.f_cpu=80000000L
um_feathers3neo.menu.CPUFreq.40=40MHz
um_feathers3neo.menu.CPUFreq.40.build.f_cpu=40000000L
um_feathers3neo.menu.CPUFreq.20=20MHz
um_feathers3neo.menu.CPUFreq.20.build.f_cpu=20000000L
um_feathers3neo.menu.CPUFreq.10=10MHz
um_feathers3neo.menu.CPUFreq.10.build.f_cpu=10000000L

um_feathers3neo.menu.FlashMode.qio=QIO
um_feathers3neo.menu.FlashMode.qio.build.flash_mode=dio
um_feathers3neo.menu.FlashMode.qio.build.boot=qio
um_feathers3neo.menu.FlashMode.dio=DIO
um_feathers3neo.menu.FlashMode.dio.build.flash_mode=dio
um_feathers3neo.menu.FlashMode.dio.build.boot=dio

um_feathers3neo.menu.UploadSpeed.921600=921600
um_feathers3neo.menu.UploadSpeed.921600.upload.speed=921600
um_feathers3neo.menu.UploadSpeed.115200=115200
um_feathers3neo.menu.UploadSpeed.115200.upload.speed=115200
um_feathers3neo.menu.UploadSpeed.256000.windows=256000
um_feathers3neo.menu.UploadSpeed.256000.upload.speed=256000
um_feathers3neo.menu.UploadSpeed.230400.windows.upload.speed=256000
um_feathers3neo.menu.UploadSpeed.230400=230400
um_feathers3neo.menu.UploadSpeed.230400.upload.speed=230400
um_feathers3neo.menu.UploadSpeed.460800.linux=460800
um_feathers3neo.menu.UploadSpeed.460800.macosx=460800
um_feathers3neo.menu.UploadSpeed.460800.upload.speed=460800
um_feathers3neo.menu.UploadSpeed.512000.windows=512000
um_feathers3neo.menu.UploadSpeed.512000.upload.speed=512000

