espressif/arduino-esp32/boards.txt
um_nanos3.menu.EraseFlash.none=Disabled
um_nanos3.menu.EraseFlash.none.upload.erase_cmd=
um_nanos3.menu.EraseFlash.all=Enabled
um_nanos3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

um_omgs3.name=UM OMGS3
um_omgs3.vid.0=0x303a
um_omgs3.pid.0=0x8224
um_omgs3.upload_port.0.vid=0x303a
um_omgs3.upload_port.0.pid=0x8224

um_omgs3.bootloader.tool=esptool_py
um_omgs3.bootloader.tool.default=esptool_py

um_omgs3.upload.tool=esptool_py
um_omgs3.upload.tool.default=esptool_py
um_omgs3.upload.tool.network=esp_ota

um_omgs3.upload.maximum_size=1310720
um_omgs3.upload.maximum_data_size=327680
um_omgs3.upload.flags=
um_omgs3.upload.extra_flags=
um_omgs3.upload.use_1200bps_touch=false
um_omgs3.upload.wait_for_upload_port=false

um_omgs3.serial.disableDTR=false
um_omgs3.serial.disableRTS=false

um_omgs3.build.tarch=xtensa
um_omgs3.build.bootloader_addr=0x0
um_omgs3.build.target=esp32s3
um_omgs3.build.mcu=esp32s3
um_omgs3.build.core=esp32
um_omgs3.build.variant=um_omgs3
um_omgs3.build.board=OMGS3

um_omgs3.build.usb_mode=1
um_omgs3.build.cdc_on_boot=1
um_omgs3.build.msc_on_boot=0
um_omgs3.build.dfu_on_boot=0
um_omgs3.build.f_cpu=240000000L
um_omgs3.build.flash_size=8MB
um_omgs3.build.flash_freq=80m
um_omgs3.build.flash_mode=dio
um_omgs3.build.boot=qio
um_omgs3.build.partitions=default
um_omgs3.build.defines=
um_omgs3.build.loop_core=
um_omgs3.build.event_core=
um_omgs3.build.flash_type=qio
um_omgs3.build.psram_type=qspi
um_omgs3.build.memory_type=qio_qspi

um_omgs3.menu.LoopCore.1=Core 1
um_omgs3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
um_omgs3.menu.LoopCore.0=Core 0
um_omgs3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

um_omgs3.menu.EventsCore.1=Core 1
um_omgs3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
um_omgs3.menu.EventsCore.0=Core 0
um_omgs3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

um_omgs3.menu.USBMode.hwcdc=Hardware CDC and JTAG
um_omgs3.menu.USBMode.hwcdc.build.usb_mode=1
um_omgs3.menu.USBMode.default=USB-OTG (TinyUSB)
um_omgs3.menu.USBMode.default.build.usb_mode=0

um_omgs3.menu.CDCOnBoot.cdc=Enabled
um_omgs3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_omgs3.menu.CDCOnBoot.default=Disabled
um_omgs3.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_omgs3.menu.MSCOnBoot.default=Disabled
um_omgs3.menu.MSCOnBoot.default.build.msc_on_boot=0
um_omgs3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
um_omgs3.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_omgs3.menu.DFUOnBoot.default=Disabled
um_omgs3.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_omgs3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
um_omgs3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_omgs3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
um_omgs3.menu.UploadMode.default=UART0 / Hardware CDC
um_omgs3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
um_omgs3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
um_omgs3.menu.UploadMode.default.upload.use_1200bps_touch=false
um_omgs3.menu.UploadMode.default.upload.wait_for_upload_port=false

um_omgs3.menu.PSRAM.enabled=Enabled
um_omgs3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
um_omgs3.menu.PSRAM.disabled=Disabled
um_omgs3.menu.PSRAM.disabled.build.defines=

um_omgs3.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
um_omgs3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
um_omgs3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
um_omgs3.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/3.7MB FFAT)
um_omgs3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
um_omgs3.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
um_omgs3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
um_omgs3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152

um_omgs3.menu.CPUFreq.240=240MHz (WiFi)
um_omgs3.menu.CPUFreq.240.build.f_cpu=240000000L
um_omgs3.menu.CPUFreq.160=160MHz (WiFi)
um_omgs3.menu.CPUFreq.160.build.f_cpu=160000000L
um_omgs3.menu.CPUFreq.80=80MHz (WiFi)
um_omgs3.menu.CPUFreq.80.build.f_cpu=80000000L
um_omgs3.menu.CPUFreq.40=40MHz
um_omgs3.menu.CPUFreq.40.build.f_cpu=40000000L
um_omgs3.menu.CPUFreq.20=20MHz
um_omgs3.menu.CPUFreq.20.build.f_cpu=20000000L
um_omgs3.menu.CPUFreq.10=10MHz
um_omgs3.menu.CPUFreq.10.build.f_cpu=10000000L

um_omgs3.menu.FlashMode.qio=QIO
um_omgs3.menu.FlashMode.qio.build.flash_mode=dio
um_omgs3.menu.FlashMode.qio.build.boot=qio
um_omgs3.menu.FlashMode.dio=DIO
um_omgs3.menu.FlashMode.dio.build.flash_mode=dio
um_omgs3.menu.FlashMode.dio.build.boot=dio

um_omgs3.menu.UploadSpeed.921600=921600
um_omgs3.menu.UploadSpeed.921600.upload.speed=921600
um_omgs3.menu.UploadSpeed.115200=115200
um_omgs3.menu.UploadSpeed.115200.upload.speed=115200
um_omgs3.menu.UploadSpeed.256000.windows=256000
um_omgs3.menu.UploadSpeed.256000.upload.speed=256000
um_omgs3.menu.UploadSpeed.230400.windows.upload.speed=256000
um_omgs3.menu.UploadSpeed.230400=230400
um_omgs3.menu.UploadSpeed.230400.upload.speed=230400
um_omgs3.menu.UploadSpeed.460800.linux=460800
um_omgs3.menu.UploadSpeed.460800.macosx=460800
um_omgs3.menu.UploadSpeed.460800.upload.speed=460800
um_omgs3.menu.UploadSpeed.512000.windows=512000
um_omgs3.menu.UploadSpeed.512000.upload.speed=512000

um_omgs3.menu.DebugLevel.none=None
um_omgs3.menu.DebugLevel.none.build.code_debug=0
um_omgs3.menu.DebugLevel.error=Error
um_omgs3.menu.DebugLevel.error.build.code_debug=1
um_omgs3.menu.DebugLevel.warn=Warn
um_omgs3.menu.DebugLevel.warn.build.code_debug=2
um_omgs3.menu.DebugLevel.info=Info
um_omgs3.menu.DebugLevel.info.build.code_debug=3
um_omgs3.menu.DebugLevel.debug=Debug
um_omgs3.menu.DebugLevel.debug.build.code_debug=4
um_omgs3.menu.DebugLevel.verbose=Verbose
um_omgs3.menu.DebugLevel.verbose.build.code_debug=5

um_omgs3.menu.EraseFlash.none=Disabled
um_omgs3.menu.EraseFlash.none.upload.erase_cmd=
um_omgs3.menu.EraseFlash.all=Enabled
um_omgs3.menu.EraseFlash.all.upload.erase_cmd=-e

