espressif/arduino-esp32/boards.txt
##############################################################

um_squixl.name=UM SQUIXL
um_squixl.vid.0=0x303a
um_squixl.pid.0=0x82DF
um_squixl.upload_port.0.vid=0x303a
um_squixl.upload_port.0.pid=0x82DF

um_squixl.bootloader.tool=esptool_py
um_squixl.bootloader.tool.default=esptool_py

um_squixl.upload.tool=esptool_py
um_squixl.upload.tool.default=esptool_py
um_squixl.upload.tool.network=esp_ota

um_squixl.upload.maximum_size=1310720
um_squixl.upload.maximum_data_size=327680
um_squixl.upload.flags=
um_squixl.upload.extra_flags=
um_squixl.upload.use_1200bps_touch=false
um_squixl.upload.wait_for_upload_port=false

um_squixl.serial.disableDTR=false
um_squixl.serial.disableRTS=false

um_squixl.build.tarch=xtensa
um_squixl.build.bootloader_addr=0x0
um_squixl.build.target=esp32s3
um_squixl.build.mcu=esp32s3
um_squixl.build.core=esp32
um_squixl.build.variant=um_squixl
um_squixl.build.board=SQUIXL

um_squixl.build.usb_mode=1
um_squixl.build.cdc_on_boot=1
um_squixl.build.msc_on_boot=0
um_squixl.build.dfu_on_boot=0
um_squixl.build.f_cpu=240000000L
um_squixl.build.flash_size=16MB
um_squixl.build.flash_freq=80m
um_squixl.build.flash_mode=dio
um_squixl.build.boot=qio
um_squixl.build.partitions=default
um_squixl.build.defines=
um_squixl.build.loop_core=
um_squixl.build.event_core=
um_squixl.build.flash_type=qio
um_squixl.build.psram_type=opi
um_squixl.build.memory_type=qio_opi

um_squixl.menu.LoopCore.1=Core 1
um_squixl.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
um_squixl.menu.LoopCore.0=Core 0
um_squixl.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

um_squixl.menu.EventsCore.1=Core 1
um_squixl.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
um_squixl.menu.EventsCore.0=Core 0
um_squixl.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

um_squixl.menu.USBMode.hwcdc=Hardware CDC and JTAG
um_squixl.menu.USBMode.hwcdc.build.usb_mode=1
um_squixl.menu.USBMode.default=USB-OTG (TinyUSB)
um_squixl.menu.USBMode.default.build.usb_mode=0

um_squixl.menu.CDCOnBoot.cdc=Enabled
um_squixl.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_squixl.menu.CDCOnBoot.default=Disabled
um_squixl.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_squixl.menu.MSCOnBoot.default=Disabled
um_squixl.menu.MSCOnBoot.default.build.msc_on_boot=0
um_squixl.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
um_squixl.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_squixl.menu.DFUOnBoot.default=Disabled
um_squixl.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_squixl.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
um_squixl.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_squixl.menu.UploadMode.cdc.upload.wait_for_upload_port=true
um_squixl.menu.UploadMode.default=UART0 / Hardware CDC
um_squixl.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
um_squixl.menu.UploadMode.cdc.upload.use_1200bps_touch=true
um_squixl.menu.UploadMode.default.upload.use_1200bps_touch=false
um_squixl.menu.UploadMode.default.upload.wait_for_upload_port=false

um_squixl.menu.PSRAM.opi=OPI PSRAM
um_squixl.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
um_squixl.menu.PSRAM.opi.build.psram_type=opi

um_squixl.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
um_squixl.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
um_squixl.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
um_squixl.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/6.93MB SPIFFS)
um_squixl.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
um_squixl.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592
um_squixl.menu.PartitionScheme.app3M_fat9M_16MB=FFAT (3MB APP/9MB FATFS)
um_squixl.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
um_squixl.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
um_squixl.menu.PartitionScheme.fatflash=Large FFAT (2MB APP/12.5MB FATFS)
um_squixl.menu.PartitionScheme.fatflash.build.partitions=ffat
um_squixl.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

um_squixl.menu.CPUFreq.240=240MHz (WiFi)
um_squixl.menu.CPUFreq.240.build.f_cpu=240000000L
um_squixl.menu.CPUFreq.160=160MHz (WiFi)
um_squixl.menu.CPUFreq.160.build.f_cpu=160000000L
um_squixl.menu.CPUFreq.80=80MHz (WiFi)
um_squixl.menu.CPUFreq.80.build.f_cpu=80000000L
um_squixl.menu.CPUFreq.40=40MHz
um_squixl.menu.CPUFreq.40.build.f_cpu=40000000L
um_squixl.menu.CPUFreq.20=20MHz
um_squixl.menu.CPUFreq.20.build.f_cpu=20000000L
um_squixl.menu.CPUFreq.10=10MHz
um_squixl.menu.CPUFreq.10.build.f_cpu=10000000L

um_squixl.menu.FlashMode.qio=QIO
um_squixl.menu.FlashMode.qio.build.flash_mode=dio
um_squixl.menu.FlashMode.qio.build.boot=qio
um_squixl.menu.FlashMode.dio=DIO
um_squixl.menu.FlashMode.dio.build.flash_mode=dio
um_squixl.menu.FlashMode.dio.build.boot=dio

um_squixl.menu.UploadSpeed.921600=921600
um_squixl.menu.UploadSpeed.921600.upload.speed=921600
um_squixl.menu.UploadSpeed.115200=115200
um_squixl.menu.UploadSpeed.115200.upload.speed=115200
um_squixl.menu.UploadSpeed.256000.windows=256000
um_squixl.menu.UploadSpeed.256000.upload.speed=256000
um_squixl.menu.UploadSpeed.230400.windows.upload.speed=256000
um_squixl.menu.UploadSpeed.230400=230400
um_squixl.menu.UploadSpeed.230400.upload.speed=230400
um_squixl.menu.UploadSpeed.460800.linux=460800
um_squixl.menu.UploadSpeed.460800.macosx=460800
um_squixl.menu.UploadSpeed.460800.upload.speed=460800
um_squixl.menu.UploadSpeed.512000.windows=512000
um_squixl.menu.UploadSpeed.512000.upload.speed=512000

um_squixl.menu.DebugLevel.none=None
um_squixl.menu.DebugLevel.none.build.code_debug=0
um_squixl.menu.DebugLevel.error=Error
um_squixl.menu.DebugLevel.error.build.code_debug=1
um_squixl.menu.DebugLevel.warn=Warn
um_squixl.menu.DebugLevel.warn.build.code_debug=2
um_squixl.menu.DebugLevel.info=Info
um_squixl.menu.DebugLevel.info.build.code_debug=3
um_squixl.menu.DebugLevel.debug=Debug
um_squixl.menu.DebugLevel.debug.build.code_debug=4
um_squixl.menu.DebugLevel.verbose=Verbose
um_squixl.menu.DebugLevel.verbose.build.code_debug=5

um_squixl.menu.EraseFlash.none=Disabled
um_squixl.menu.EraseFlash.none.upload.erase_cmd=
um_squixl.menu.EraseFlash.all=Enabled
um_squixl.menu.EraseFlash.all.upload.erase_cmd=-e

