espressif/arduino-esp32/boards.txt
##############################################################

um_tinypico.name=UM TinyPICO

um_tinypico.bootloader.tool=esptool_py
um_tinypico.bootloader.tool.default=esptool_py

um_tinypico.upload.tool=esptool_py
um_tinypico.upload.tool.default=esptool_py
um_tinypico.upload.tool.network=esp_ota

um_tinypico.upload.maximum_size=1310720
um_tinypico.upload.maximum_data_size=327680
um_tinypico.upload.flags=
um_tinypico.upload.extra_flags=

um_tinypico.serial.disableDTR=true
um_tinypico.serial.disableRTS=true

um_tinypico.build.tarch=xtensa
um_tinypico.build.bootloader_addr=0x1000
um_tinypico.build.target=esp32
um_tinypico.build.mcu=esp32
um_tinypico.build.core=esp32
um_tinypico.build.variant=um_tinypico
um_tinypico.build.board=TINYPICO

um_tinypico.build.f_cpu=240000000L
um_tinypico.build.flash_size=4MB
um_tinypico.build.flash_freq=80m
um_tinypico.build.flash_mode=dio
um_tinypico.build.boot=dio
um_tinypico.build.partitions=default
um_tinypico.build.defines=

um_tinypico.menu.PartitionScheme.default=Default
um_tinypico.menu.PartitionScheme.default.build.partitions=default
um_tinypico.menu.PartitionScheme.no_ota=No OTA (Large APP)
um_tinypico.menu.PartitionScheme.no_ota.build.partitions=no_ota
um_tinypico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
um_tinypico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
um_tinypico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
um_tinypico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

um_tinypico.menu.UploadSpeed.921600=921600
um_tinypico.menu.UploadSpeed.921600.upload.speed=921600
um_tinypico.menu.UploadSpeed.115200=115200
um_tinypico.menu.UploadSpeed.115200.upload.speed=115200
um_tinypico.menu.UploadSpeed.256000.windows=256000
um_tinypico.menu.UploadSpeed.256000.upload.speed=256000
um_tinypico.menu.UploadSpeed.230400.windows.upload.speed=256000
um_tinypico.menu.UploadSpeed.230400=230400
um_tinypico.menu.UploadSpeed.230400.upload.speed=230400
um_tinypico.menu.UploadSpeed.460800.linux=460800
um_tinypico.menu.UploadSpeed.460800.macosx=460800
um_tinypico.menu.UploadSpeed.460800.upload.speed=460800
um_tinypico.menu.UploadSpeed.512000.windows=512000
um_tinypico.menu.UploadSpeed.512000.upload.speed=512000

um_tinypico.menu.FlashMode.qio=QIO
um_tinypico.menu.FlashMode.qio.build.flash_mode=dio
um_tinypico.menu.FlashMode.qio.build.boot=qio
um_tinypico.menu.FlashMode.dio=DIO
um_tinypico.menu.FlashMode.dio.build.flash_mode=dio
um_tinypico.menu.FlashMode.dio.build.boot=dio

um_tinypico.menu.FlashFreq.80=80MHz
um_tinypico.menu.FlashFreq.80.build.flash_freq=80m
um_tinypico.menu.FlashFreq.40=40MHz
um_tinypico.menu.FlashFreq.40.build.flash_freq=40m

um_tinypico.menu.PSRAM.enabled=Enabled
um_tinypico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
um_tinypico.menu.PSRAM.enabled.build.extra_libs=
um_tinypico.menu.PSRAM.disabled=Disabled
um_tinypico.menu.PSRAM.disabled.build.defines=
um_tinypico.menu.PSRAM.disabled.build.extra_libs=

um_tinypico.menu.DebugLevel.none=None
um_tinypico.menu.DebugLevel.none.build.code_debug=0
um_tinypico.menu.DebugLevel.error=Error
um_tinypico.menu.DebugLevel.error.build.code_debug=1
um_tinypico.menu.DebugLevel.warn=Warn
um_tinypico.menu.DebugLevel.warn.build.code_debug=2
um_tinypico.menu.DebugLevel.info=Info
um_tinypico.menu.DebugLevel.info.build.code_debug=3
um_tinypico.menu.DebugLevel.debug=Debug
um_tinypico.menu.DebugLevel.debug.build.code_debug=4
um_tinypico.menu.DebugLevel.verbose=Verbose
um_tinypico.menu.DebugLevel.verbose.build.code_debug=5

um_tinypico.menu.EraseFlash.none=Disabled
um_tinypico.menu.EraseFlash.none.upload.erase_cmd=
um_tinypico.menu.EraseFlash.all=Enabled
um_tinypico.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

um_tinyc6.name=UM TinyC6

um_tinyc6.bootloader.tool=esptool_py
um_tinyc6.bootloader.tool.default=esptool_py

um_tinyc6.upload.tool=esptool_py
um_tinyc6.upload.tool.default=esptool_py
um_tinyc6.upload.tool.network=esp_ota

um_tinyc6.upload.maximum_size=1310720
um_tinyc6.upload.maximum_data_size=327680
um_tinyc6.upload.flags=
um_tinyc6.upload.extra_flags=
um_tinyc6.upload.use_1200bps_touch=false
um_tinyc6.upload.wait_for_upload_port=false

um_tinyc6.serial.disableDTR=false
um_tinyc6.serial.disableRTS=false

um_tinyc6.build.tarch=riscv32
um_tinyc6.build.target=esp
um_tinyc6.build.mcu=esp32c6
um_tinyc6.build.core=esp32
um_tinyc6.build.variant=um_tinyc6
um_tinyc6.build.board=TINYC6
um_tinyc6.build.bootloader_addr=0x0

um_tinyc6.build.cdc_on_boot=1
um_tinyc6.build.f_cpu=160000000L
um_tinyc6.build.flash_size=4MB
um_tinyc6.build.flash_freq=80m
um_tinyc6.build.flash_mode=qio
um_tinyc6.build.boot=qio
um_tinyc6.build.partitions=default
um_tinyc6.build.defines=

## IDE 2.0 Seems to not update the value
um_tinyc6.menu.JTAGAdapter.default=Disabled
um_tinyc6.menu.JTAGAdapter.default.build.copy_jtag_files=0
um_tinyc6.menu.JTAGAdapter.builtin=Integrated USB JTAG
um_tinyc6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
um_tinyc6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
um_tinyc6.menu.JTAGAdapter.external=FTDI Adapter
um_tinyc6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
um_tinyc6.menu.JTAGAdapter.external.build.copy_jtag_files=1
um_tinyc6.menu.JTAGAdapter.bridge=ESP USB Bridge
um_tinyc6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
um_tinyc6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

um_tinyc6.menu.CDCOnBoot.cdc=Enabled
um_tinyc6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_tinyc6.menu.CDCOnBoot.default=Disabled
um_tinyc6.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_tinyc6.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
um_tinyc6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
um_tinyc6.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
um_tinyc6.menu.PartitionScheme.rainmaker=RainMaker 4MB
um_tinyc6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
um_tinyc6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
um_tinyc6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
um_tinyc6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
um_tinyc6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
um_tinyc6.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
um_tinyc6.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
um_tinyc6.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
um_tinyc6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
um_tinyc6.menu.PartitionScheme.zigbee.build.partitions=zigbee
um_tinyc6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
um_tinyc6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
um_tinyc6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
um_tinyc6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
um_tinyc6.menu.PartitionScheme.custom=Custom
um_tinyc6.menu.PartitionScheme.custom.build.partitions=
um_tinyc6.menu.PartitionScheme.custom.upload.maximum_size=16777216

um_tinyc6.menu.CPUFreq.160=160MHz (WiFi)
um_tinyc6.menu.CPUFreq.160.build.f_cpu=160000000L
um_tinyc6.menu.CPUFreq.80=80MHz (WiFi)
um_tinyc6.menu.CPUFreq.80.build.f_cpu=80000000L
um_tinyc6.menu.CPUFreq.40=40MHz
um_tinyc6.menu.CPUFreq.40.build.f_cpu=40000000L
um_tinyc6.menu.CPUFreq.20=20MHz
um_tinyc6.menu.CPUFreq.20.build.f_cpu=20000000L
um_tinyc6.menu.CPUFreq.10=10MHz
um_tinyc6.menu.CPUFreq.10.build.f_cpu=10000000L

um_tinyc6.menu.FlashMode.qio=QIO
um_tinyc6.menu.FlashMode.qio.build.flash_mode=dio
um_tinyc6.menu.FlashMode.qio.build.boot=qio
um_tinyc6.menu.FlashMode.dio=DIO
um_tinyc6.menu.FlashMode.dio.build.flash_mode=dio
um_tinyc6.menu.FlashMode.dio.build.boot=dio

