espressif/arduino-esp32/boards.txt
lilygo_t3s3.menu.EventsCore.1=Core 1
lilygo_t3s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lilygo_t3s3.menu.EventsCore.0=Core 0
lilygo_t3s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lilygo_t3s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
lilygo_t3s3.menu.USBMode.hwcdc.build.usb_mode=1
lilygo_t3s3.menu.USBMode.default=USB-OTG (TinyUSB)
lilygo_t3s3.menu.USBMode.default.build.usb_mode=0

lilygo_t3s3.menu.CDCOnBoot.default=Disabled
lilygo_t3s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
lilygo_t3s3.menu.CDCOnBoot.cdc=Enabled
lilygo_t3s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

lilygo_t3s3.menu.MSCOnBoot.default=Disabled
lilygo_t3s3.menu.MSCOnBoot.default.build.msc_on_boot=0
lilygo_t3s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lilygo_t3s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

lilygo_t3s3.menu.DFUOnBoot.default=Disabled
lilygo_t3s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
lilygo_t3s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lilygo_t3s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lilygo_t3s3.menu.UploadMode.default=UART0 / Hardware CDC
lilygo_t3s3.menu.UploadMode.default.upload.use_1200bps_touch=false
lilygo_t3s3.menu.UploadMode.default.upload.wait_for_upload_port=false
lilygo_t3s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lilygo_t3s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lilygo_t3s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lilygo_t3s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
lilygo_t3s3.menu.PartitionScheme.default.build.partitions=default
lilygo_t3s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
lilygo_t3s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
lilygo_t3s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
lilygo_t3s3.menu.PartitionScheme.minimal.build.partitions=minimal
lilygo_t3s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
lilygo_t3s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
lilygo_t3s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lilygo_t3s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
lilygo_t3s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
lilygo_t3s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
lilygo_t3s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
lilygo_t3s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
lilygo_t3s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
lilygo_t3s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
lilygo_t3s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
lilygo_t3s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
lilygo_t3s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
lilygo_t3s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
lilygo_t3s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
lilygo_t3s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
lilygo_t3s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lilygo_t3s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

lilygo_t3s3.menu.CPUFreq.240=240MHz (WiFi/BT)
lilygo_t3s3.menu.CPUFreq.240.build.f_cpu=240000000L
lilygo_t3s3.menu.CPUFreq.160=160MHz (WiFi/BT)
lilygo_t3s3.menu.CPUFreq.160.build.f_cpu=160000000L
lilygo_t3s3.menu.CPUFreq.80=80MHz (WiFi/BT)
lilygo_t3s3.menu.CPUFreq.80.build.f_cpu=80000000L

lilygo_t3s3.menu.FlashMode.qio=QIO
lilygo_t3s3.menu.FlashMode.qio.build.flash_mode=dio
lilygo_t3s3.menu.FlashMode.qio.build.boot=qio
lilygo_t3s3.menu.FlashMode.dio=DIO
lilygo_t3s3.menu.FlashMode.dio.build.flash_mode=dio
lilygo_t3s3.menu.FlashMode.dio.build.boot=dio

lilygo_t3s3.menu.FlashFreq.80=80MHz
lilygo_t3s3.menu.FlashFreq.80.build.flash_freq=80m
lilygo_t3s3.menu.FlashFreq.40=40MHz
lilygo_t3s3.menu.FlashFreq.40.build.flash_freq=40m

lilygo_t3s3.menu.UploadSpeed.921600=921600
lilygo_t3s3.menu.UploadSpeed.921600.upload.speed=921600
lilygo_t3s3.menu.UploadSpeed.115200=115200
lilygo_t3s3.menu.UploadSpeed.115200.upload.speed=115200
lilygo_t3s3.menu.UploadSpeed.256000.windows=256000
lilygo_t3s3.menu.UploadSpeed.256000.upload.speed=256000
lilygo_t3s3.menu.UploadSpeed.230400.windows.upload.speed=256000
lilygo_t3s3.menu.UploadSpeed.230400=230400
lilygo_t3s3.menu.UploadSpeed.230400.upload.speed=230400
lilygo_t3s3.menu.UploadSpeed.460800.linux=460800
lilygo_t3s3.menu.UploadSpeed.460800.macosx=460800
lilygo_t3s3.menu.UploadSpeed.460800.upload.speed=460800
lilygo_t3s3.menu.UploadSpeed.512000.windows=512000
lilygo_t3s3.menu.UploadSpeed.512000.upload.speed=512000

lilygo_t3s3.menu.DebugLevel.none=None
lilygo_t3s3.menu.DebugLevel.none.build.code_debug=0
lilygo_t3s3.menu.DebugLevel.error=Error
lilygo_t3s3.menu.DebugLevel.error.build.code_debug=1
lilygo_t3s3.menu.DebugLevel.warn=Warn
lilygo_t3s3.menu.DebugLevel.warn.build.code_debug=2
lilygo_t3s3.menu.DebugLevel.info=Info
lilygo_t3s3.menu.DebugLevel.info.build.code_debug=3
lilygo_t3s3.menu.DebugLevel.debug=Debug
lilygo_t3s3.menu.DebugLevel.debug.build.code_debug=4
lilygo_t3s3.menu.DebugLevel.verbose=Verbose
lilygo_t3s3.menu.DebugLevel.verbose.build.code_debug=5

lilygo_t3s3.menu.EraseFlash.none=Disabled
lilygo_t3s3.menu.EraseFlash.none.upload.erase_cmd=
lilygo_t3s3.menu.EraseFlash.all=Enabled
lilygo_t3s3.menu.EraseFlash.all.upload.erase_cmd=-e

lilygo_t3s3.menu.Revision.Radio_SX1262=Radio-SX1262
lilygo_t3s3.menu.Revision.Radio_SX1262.build.board=LILYGO_T3S3_SX1262
lilygo_t3s3.menu.Revision.Radio_SX1262.build.variant=lilygo_t3_s3_sx1262

lilygo_t3s3.menu.Revision.Radio_SX1276=Radio-SX1276
lilygo_t3s3.menu.Revision.Radio_SX1276.build.board=LILYGO_T3S3_SX1276
lilygo_t3s3.menu.Revision.Radio_SX1276.build.variant=lilygo_t3_s3_sx127x

lilygo_t3s3.menu.Revision.Radio_SX1278=Radio-SX1278
lilygo_t3s3.menu.Revision.Radio_SX1278.build.board=LILYGO_T3S3_SX1278
lilygo_t3s3.menu.Revision.Radio_SX1278.build.variant=lilygo_t3_s3_sx127x

lilygo_t3s3.menu.Revision.Radio_SX1280=Radio-SX1280
lilygo_t3s3.menu.Revision.Radio_SX1280.build.board=LILYGO_T3S3_SX1280
lilygo_t3s3.menu.Revision.Radio_SX1280.build.variant=lilygo_t3_s3_sx1280

lilygo_t3s3.menu.Revision.Radio_SX1280PA=Radio-SX1280PA
lilygo_t3s3.menu.Revision.Radio_SX1280PA.build.board=LILYGO_T3S3_SX1280PA
lilygo_t3s3.menu.Revision.Radio_SX1280PA.build.variant=lilygo_t3_s3_sx1280pa

