espressif/arduino-esp32/boards.txt
twatchs3.menu.EraseFlash.none=Disabled
twatchs3.menu.EraseFlash.none.upload.erase_cmd=
twatchs3.menu.EraseFlash.all=Enabled
twatchs3.menu.EraseFlash.all.upload.erase_cmd=-e

twatchs3.menu.Revision.Radio_SX1262=Radio-SX1262
twatchs3.menu.Revision.Radio_SX1262.build.board=LILYGO_LORA_SX1262
twatchs3.menu.Revision.Radio_SX1280=Radio-SX1280
twatchs3.menu.Revision.Radio_SX1280.build.board=LILYGO_LORA_SX1280
twatchs3.menu.Revision.Radio_CC1101=Radio-CC1101
twatchs3.menu.Revision.Radio_CC1101.build.board=LILYGO_LORA_CC1101
twatchs3.menu.Revision.Radio_LR1121=Radio-LR1121
twatchs3.menu.Revision.Radio_LR1121.build.board=LILYGO_LORA_LR1121
twatchs3.menu.Revision.Radio_SI4432=Radio-SI4432
twatchs3.menu.Revision.Radio_SI4432.build.board=LILYGO_LORA_SI4432

##############################################################


twatch_ultra.name=LilyGo T-Watch-Ultra

twatch_ultra.bootloader.tool=esptool_py
twatch_ultra.bootloader.tool.default=esptool_py

twatch_ultra.upload.tool=esptool_py
twatch_ultra.upload.tool.default=esptool_py
twatch_ultra.upload.tool.network=esp_ota

twatch_ultra.upload.maximum_size=1310720
twatch_ultra.upload.maximum_data_size=327680
twatch_ultra.upload.flags=
twatch_ultra.upload.extra_flags=
twatch_ultra.upload.use_1200bps_touch=false
twatch_ultra.upload.wait_for_upload_port=false

twatch_ultra.serial.disableDTR=false
twatch_ultra.serial.disableRTS=false

twatch_ultra.build.tarch=xtensa
twatch_ultra.build.bootloader_addr=0x0
twatch_ultra.build.target=esp32s3
twatch_ultra.build.mcu=esp32s3
twatch_ultra.build.core=esp32
twatch_ultra.build.variant=lilygo_twatch_ultra
twatch_ultra.build.board=T_WATCH_S3_ULTRA

twatch_ultra.build.usb_mode=1
twatch_ultra.build.cdc_on_boot=1
twatch_ultra.build.msc_on_boot=0
twatch_ultra.build.dfu_on_boot=0
twatch_ultra.build.f_cpu=240000000L
twatch_ultra.build.flash_size=16MB
twatch_ultra.build.flash_freq=80m
twatch_ultra.build.flash_mode=dio
twatch_ultra.build.boot=qio
twatch_ultra.build.boot_freq=80m
twatch_ultra.build.partitions=app3M_fat9M_16MB
twatch_ultra.build.defines=-DBOARD_HAS_PSRAM -DARDUINO_T_WATCH_S3_ULTRA
twatch_ultra.build.loop_core=
twatch_ultra.build.event_core=
twatch_ultra.build.psram_type=qspi
twatch_ultra.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
twatch_ultra.menu.JTAGAdapter.default=Disabled
twatch_ultra.menu.JTAGAdapter.default.build.copy_jtag_files=0
twatch_ultra.menu.JTAGAdapter.builtin=Integrated USB JTAG
twatch_ultra.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
twatch_ultra.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

twatch_ultra.menu.LoopCore.1=Core 1
twatch_ultra.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
twatch_ultra.menu.LoopCore.0=Core 0
twatch_ultra.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

twatch_ultra.menu.EventsCore.1=Core 1
twatch_ultra.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
twatch_ultra.menu.EventsCore.0=Core 0
twatch_ultra.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

twatch_ultra.menu.USBMode.hwcdc=Hardware CDC and JTAG
twatch_ultra.menu.USBMode.hwcdc.build.usb_mode=1
twatch_ultra.menu.USBMode.default=USB-OTG (TinyUSB)
twatch_ultra.menu.USBMode.default.build.usb_mode=0

twatch_ultra.menu.CDCOnBoot.default=Enabled
twatch_ultra.menu.CDCOnBoot.default.build.cdc_on_boot=1
twatch_ultra.menu.CDCOnBoot.cdc=Disabled
twatch_ultra.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

twatch_ultra.menu.MSCOnBoot.default=Disabled
twatch_ultra.menu.MSCOnBoot.default.build.msc_on_boot=0
twatch_ultra.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
twatch_ultra.menu.MSCOnBoot.msc.build.msc_on_boot=1

twatch_ultra.menu.DFUOnBoot.default=Disabled
twatch_ultra.menu.DFUOnBoot.default.build.dfu_on_boot=0
twatch_ultra.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
twatch_ultra.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

twatch_ultra.menu.UploadMode.default=UART0 / Hardware CDC
twatch_ultra.menu.UploadMode.default.upload.use_1200bps_touch=false
twatch_ultra.menu.UploadMode.default.upload.wait_for_upload_port=false
twatch_ultra.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
twatch_ultra.menu.UploadMode.cdc.upload.use_1200bps_touch=true
twatch_ultra.menu.UploadMode.cdc.upload.wait_for_upload_port=true

twatch_ultra.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
twatch_ultra.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
twatch_ultra.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
twatch_ultra.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
twatch_ultra.menu.PartitionScheme.fatflash.build.partitions=ffat
twatch_ultra.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
twatch_ultra.menu.PartitionScheme.rainmaker=RainMaker
twatch_ultra.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
twatch_ultra.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
twatch_ultra.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
twatch_ultra.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
twatch_ultra.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
twatch_ultra.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
twatch_ultra.menu.PartitionScheme.custom=Custom
twatch_ultra.menu.PartitionScheme.custom.build.partitions=
twatch_ultra.menu.PartitionScheme.custom.upload.maximum_size=16777216

twatch_ultra.menu.CPUFreq.240=240MHz (WiFi)
twatch_ultra.menu.CPUFreq.240.build.f_cpu=240000000L
twatch_ultra.menu.CPUFreq.160=160MHz (WiFi)
twatch_ultra.menu.CPUFreq.160.build.f_cpu=160000000L
twatch_ultra.menu.CPUFreq.80=80MHz (WiFi)
twatch_ultra.menu.CPUFreq.80.build.f_cpu=80000000L
twatch_ultra.menu.CPUFreq.40=40MHz
twatch_ultra.menu.CPUFreq.40.build.f_cpu=40000000L
twatch_ultra.menu.CPUFreq.20=20MHz
twatch_ultra.menu.CPUFreq.20.build.f_cpu=20000000L
twatch_ultra.menu.CPUFreq.10=10MHz
twatch_ultra.menu.CPUFreq.10.build.f_cpu=10000000L

twatch_ultra.menu.UploadSpeed.921600=921600
twatch_ultra.menu.UploadSpeed.921600.upload.speed=921600
twatch_ultra.menu.UploadSpeed.115200=115200
twatch_ultra.menu.UploadSpeed.115200.upload.speed=115200
twatch_ultra.menu.UploadSpeed.256000.windows=256000
twatch_ultra.menu.UploadSpeed.256000.upload.speed=256000
twatch_ultra.menu.UploadSpeed.230400.windows.upload.speed=256000
twatch_ultra.menu.UploadSpeed.230400=230400
twatch_ultra.menu.UploadSpeed.230400.upload.speed=230400
twatch_ultra.menu.UploadSpeed.460800.linux=460800
twatch_ultra.menu.UploadSpeed.460800.macosx=460800
twatch_ultra.menu.UploadSpeed.460800.upload.speed=460800
twatch_ultra.menu.UploadSpeed.512000.windows=512000
twatch_ultra.menu.UploadSpeed.512000.upload.speed=512000

