espressif/arduino-esp32/boards.txt
twatch_ultra.menu.DebugLevel.none=None
twatch_ultra.menu.DebugLevel.none.build.code_debug=0
twatch_ultra.menu.DebugLevel.error=Error
twatch_ultra.menu.DebugLevel.error.build.code_debug=1
twatch_ultra.menu.DebugLevel.warn=Warn
twatch_ultra.menu.DebugLevel.warn.build.code_debug=2
twatch_ultra.menu.DebugLevel.info=Info
twatch_ultra.menu.DebugLevel.info.build.code_debug=3
twatch_ultra.menu.DebugLevel.debug=Debug
twatch_ultra.menu.DebugLevel.debug.build.code_debug=4
twatch_ultra.menu.DebugLevel.verbose=Verbose
twatch_ultra.menu.DebugLevel.verbose.build.code_debug=5

twatch_ultra.menu.EraseFlash.none=Disabled
twatch_ultra.menu.EraseFlash.none.upload.erase_cmd=
twatch_ultra.menu.EraseFlash.all=Enabled
twatch_ultra.menu.EraseFlash.all.upload.erase_cmd=-e

twatch_ultra.menu.Revision.Radio_SX1262=Radio-SX1262
twatch_ultra.menu.Revision.Radio_SX1262.build.board=LILYGO_LORA_SX1262
twatch_ultra.menu.Revision.Radio_SX1280=Radio-SX1280
twatch_ultra.menu.Revision.Radio_SX1280.build.board=LILYGO_LORA_SX1280
twatch_ultra.menu.Revision.Radio_CC1101=Radio-CC1101
twatch_ultra.menu.Revision.Radio_CC1101.build.board=LILYGO_LORA_CC1101
twatch_ultra.menu.Revision.Radio_LR1121=Radio-LR1121
twatch_ultra.menu.Revision.Radio_LR1121.build.board=LILYGO_LORA_LR1121
twatch_ultra.menu.Revision.Radio_SI4432=Radio-SI4432
twatch_ultra.menu.Revision.Radio_SI4432.build.board=LILYGO_LORA_SI4432

##############################################################

tlora_pager.name=LilyGo-T-LoRa-Pager

tlora_pager.bootloader.tool=esptool_py
tlora_pager.bootloader.tool.default=esptool_py

tlora_pager.upload.tool=esptool_py
tlora_pager.upload.tool.default=esptool_py
tlora_pager.upload.tool.network=esp_ota

tlora_pager.upload.maximum_size=1310720
tlora_pager.upload.maximum_data_size=327680
tlora_pager.upload.flags=
tlora_pager.upload.extra_flags=
tlora_pager.upload.use_1200bps_touch=false
tlora_pager.upload.wait_for_upload_port=false

tlora_pager.serial.disableDTR=false
tlora_pager.serial.disableRTS=false

tlora_pager.build.tarch=xtensa
tlora_pager.build.bootloader_addr=0x0
tlora_pager.build.target=esp32s3
tlora_pager.build.mcu=esp32s3
tlora_pager.build.core=esp32
tlora_pager.build.variant=lilygo_tlora_pager
tlora_pager.build.board=T_LORA_PAGER

tlora_pager.build.usb_mode=1
tlora_pager.build.cdc_on_boot=1
tlora_pager.build.msc_on_boot=0
tlora_pager.build.dfu_on_boot=0
tlora_pager.build.f_cpu=240000000L
tlora_pager.build.flash_size=16MB
tlora_pager.build.flash_freq=80m
tlora_pager.build.flash_mode=dio
tlora_pager.build.boot=qio
tlora_pager.build.boot_freq=80m
tlora_pager.build.partitions=app3M_fat9M_16MB
tlora_pager.build.defines=-DBOARD_HAS_PSRAM -DARDUINO_T_LORA_PAGER
tlora_pager.build.loop_core=
tlora_pager.build.event_core=
tlora_pager.build.psram_type=qspi
tlora_pager.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
tlora_pager.menu.JTAGAdapter.default=Disabled
tlora_pager.menu.JTAGAdapter.default.build.copy_jtag_files=0
tlora_pager.menu.JTAGAdapter.builtin=Integrated USB JTAG
tlora_pager.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
tlora_pager.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

tlora_pager.menu.LoopCore.1=Core 1
tlora_pager.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
tlora_pager.menu.LoopCore.0=Core 0
tlora_pager.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

tlora_pager.menu.EventsCore.1=Core 1
tlora_pager.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
tlora_pager.menu.EventsCore.0=Core 0
tlora_pager.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

tlora_pager.menu.USBMode.hwcdc=Hardware CDC and JTAG
tlora_pager.menu.USBMode.hwcdc.build.usb_mode=1
tlora_pager.menu.USBMode.default=USB-OTG (TinyUSB)
tlora_pager.menu.USBMode.default.build.usb_mode=0

tlora_pager.menu.CDCOnBoot.default=Enabled
tlora_pager.menu.CDCOnBoot.default.build.cdc_on_boot=1
tlora_pager.menu.CDCOnBoot.cdc=Disabled
tlora_pager.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

tlora_pager.menu.MSCOnBoot.default=Disabled
tlora_pager.menu.MSCOnBoot.default.build.msc_on_boot=0
tlora_pager.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
tlora_pager.menu.MSCOnBoot.msc.build.msc_on_boot=1

tlora_pager.menu.DFUOnBoot.default=Disabled
tlora_pager.menu.DFUOnBoot.default.build.dfu_on_boot=0
tlora_pager.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
tlora_pager.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

tlora_pager.menu.UploadMode.default=UART0 / Hardware CDC
tlora_pager.menu.UploadMode.default.upload.use_1200bps_touch=false
tlora_pager.menu.UploadMode.default.upload.wait_for_upload_port=false
tlora_pager.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
tlora_pager.menu.UploadMode.cdc.upload.use_1200bps_touch=true
tlora_pager.menu.UploadMode.cdc.upload.wait_for_upload_port=true

tlora_pager.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
tlora_pager.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
tlora_pager.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
tlora_pager.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
tlora_pager.menu.PartitionScheme.fatflash.build.partitions=ffat
tlora_pager.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
tlora_pager.menu.PartitionScheme.rainmaker=RainMaker
tlora_pager.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
tlora_pager.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
tlora_pager.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
tlora_pager.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
tlora_pager.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
tlora_pager.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
tlora_pager.menu.PartitionScheme.custom=Custom
tlora_pager.menu.PartitionScheme.custom.build.partitions=
tlora_pager.menu.PartitionScheme.custom.upload.maximum_size=16777216

tlora_pager.menu.CPUFreq.240=240MHz (WiFi)
tlora_pager.menu.CPUFreq.240.build.f_cpu=240000000L
tlora_pager.menu.CPUFreq.160=160MHz (WiFi)
tlora_pager.menu.CPUFreq.160.build.f_cpu=160000000L
tlora_pager.menu.CPUFreq.80=80MHz (WiFi)
tlora_pager.menu.CPUFreq.80.build.f_cpu=80000000L
tlora_pager.menu.CPUFreq.40=40MHz
tlora_pager.menu.CPUFreq.40.build.f_cpu=40000000L
tlora_pager.menu.CPUFreq.20=20MHz
tlora_pager.menu.CPUFreq.20.build.f_cpu=20000000L
tlora_pager.menu.CPUFreq.10=10MHz
tlora_pager.menu.CPUFreq.10.build.f_cpu=10000000L

tlora_pager.menu.UploadSpeed.921600=921600
tlora_pager.menu.UploadSpeed.921600.upload.speed=921600
tlora_pager.menu.UploadSpeed.115200=115200
tlora_pager.menu.UploadSpeed.115200.upload.speed=115200
tlora_pager.menu.UploadSpeed.256000.windows=256000
tlora_pager.menu.UploadSpeed.256000.upload.speed=256000
tlora_pager.menu.UploadSpeed.230400.windows.upload.speed=256000
tlora_pager.menu.UploadSpeed.230400=230400
tlora_pager.menu.UploadSpeed.230400.upload.speed=230400
tlora_pager.menu.UploadSpeed.460800.linux=460800
tlora_pager.menu.UploadSpeed.460800.macosx=460800
tlora_pager.menu.UploadSpeed.460800.upload.speed=460800
tlora_pager.menu.UploadSpeed.512000.windows=512000
tlora_pager.menu.UploadSpeed.512000.upload.speed=512000

tlora_pager.menu.DebugLevel.none=None
tlora_pager.menu.DebugLevel.none.build.code_debug=0
tlora_pager.menu.DebugLevel.error=Error
tlora_pager.menu.DebugLevel.error.build.code_debug=1
tlora_pager.menu.DebugLevel.warn=Warn
tlora_pager.menu.DebugLevel.warn.build.code_debug=2
tlora_pager.menu.DebugLevel.info=Info
tlora_pager.menu.DebugLevel.info.build.code_debug=3
tlora_pager.menu.DebugLevel.debug=Debug
tlora_pager.menu.DebugLevel.debug.build.code_debug=4
tlora_pager.menu.DebugLevel.verbose=Verbose
tlora_pager.menu.DebugLevel.verbose.build.code_debug=5

tlora_pager.menu.EraseFlash.none=Disabled
tlora_pager.menu.EraseFlash.none.upload.erase_cmd=
tlora_pager.menu.EraseFlash.all=Enabled
tlora_pager.menu.EraseFlash.all.upload.erase_cmd=-e


tlora_pager.menu.Revision.Radio_SX1262=Radio-SX1262
tlora_pager.menu.Revision.Radio_SX1262.build.board=LILYGO_LORA_SX1262
tlora_pager.menu.Revision.Radio_SX1280=Radio-SX1280
tlora_pager.menu.Revision.Radio_SX1280.build.board=LILYGO_LORA_SX1280
tlora_pager.menu.Revision.Radio_CC1101=Radio-CC1101
tlora_pager.menu.Revision.Radio_CC1101.build.board=LILYGO_LORA_CC1101
tlora_pager.menu.Revision.Radio_LR1121=Radio-LR1121
tlora_pager.menu.Revision.Radio_LR1121.build.board=LILYGO_LORA_LR1121
tlora_pager.menu.Revision.Radio_SI4432=Radio-SI4432
tlora_pager.menu.Revision.Radio_SI4432.build.board=LILYGO_LORA_SI4432

