espressif/arduino-esp32/boards.txt
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.default=Disabled
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.default.build.zigbee_mode=
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.default.build.zigbee_libs=
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.ed=Zigbee ED (end device)
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
sparkfun_esp32c6_qwiic_pocket.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################

# SparkFun Pro Micro ESP32C3

sparkfun_pro_micro_esp32c3.name=SparkFun Pro Micro - ESP32C3
sparkfun_pro_micro_esp32c3.vid.0=0x1B4F
sparkfun_pro_micro_esp32c3.pid.0=0x0035

sparkfun_pro_micro_esp32c3.bootloader.tool=esptool_py
sparkfun_pro_micro_esp32c3.bootloader.tool.default=esptool_py

sparkfun_pro_micro_esp32c3.upload.tool=esptool_py
sparkfun_pro_micro_esp32c3.upload.tool.default=esptool_py
sparkfun_pro_micro_esp32c3.upload.tool.network=esp_ota

sparkfun_pro_micro_esp32c3.upload.maximum_size=1310720
sparkfun_pro_micro_esp32c3.upload.maximum_data_size=327680
sparkfun_pro_micro_esp32c3.upload.flags=
sparkfun_pro_micro_esp32c3.upload.extra_flags=
sparkfun_pro_micro_esp32c3.upload.use_1200bps_touch=false
sparkfun_pro_micro_esp32c3.upload.wait_for_upload_port=false

sparkfun_pro_micro_esp32c3.serial.disableDTR=false
sparkfun_pro_micro_esp32c3.serial.disableRTS=false

sparkfun_pro_micro_esp32c3.build.tarch=riscv32
sparkfun_pro_micro_esp32c3.build.bootloader_addr=0x0
sparkfun_pro_micro_esp32c3.build.target=esp
sparkfun_pro_micro_esp32c3.build.mcu=esp32c3
sparkfun_pro_micro_esp32c3.build.core=esp32
sparkfun_pro_micro_esp32c3.build.variant=sparkfun_pro_micro_esp32c3
sparkfun_pro_micro_esp32c3.build.board=SPARKFUN_PRO_MICRO_ESP32C3

sparkfun_pro_micro_esp32c3.build.cdc_on_boot=1
sparkfun_pro_micro_esp32c3.build.f_cpu=160000000L
sparkfun_pro_micro_esp32c3.build.flash_size=4MB
sparkfun_pro_micro_esp32c3.build.flash_freq=80m
sparkfun_pro_micro_esp32c3.build.flash_mode=dio
sparkfun_pro_micro_esp32c3.build.boot=qio
sparkfun_pro_micro_esp32c3.build.partitions=default
sparkfun_pro_micro_esp32c3.build.defines=

sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.default=Disabled
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.default.build.copy_jtag_files=0
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.builtin=Integrated USB JTAG
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.external=FTDI Adapter
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.external.build.copy_jtag_files=1
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.bridge=ESP USB Bridge
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
sparkfun_pro_micro_esp32c3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

sparkfun_pro_micro_esp32c3.menu.CDCOnBoot.cdc=Enabled
sparkfun_pro_micro_esp32c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
sparkfun_pro_micro_esp32c3.menu.CDCOnBoot.default=Enabled
sparkfun_pro_micro_esp32c3.menu.CDCOnBoot.default.build.cdc_on_boot=0

sparkfun_pro_micro_esp32c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.default.build.partitions=default
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.minimal.build.partitions=minimal
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
sparkfun_pro_micro_esp32c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

sparkfun_pro_micro_esp32c3.menu.CPUFreq.160=160MHz (WiFi)
sparkfun_pro_micro_esp32c3.menu.CPUFreq.160.build.f_cpu=160000000L
sparkfun_pro_micro_esp32c3.menu.CPUFreq.80=80MHz (WiFi)
sparkfun_pro_micro_esp32c3.menu.CPUFreq.80.build.f_cpu=80000000L
sparkfun_pro_micro_esp32c3.menu.CPUFreq.40=40MHz
sparkfun_pro_micro_esp32c3.menu.CPUFreq.40.build.f_cpu=40000000L
sparkfun_pro_micro_esp32c3.menu.CPUFreq.20=20MHz
sparkfun_pro_micro_esp32c3.menu.CPUFreq.20.build.f_cpu=20000000L
sparkfun_pro_micro_esp32c3.menu.CPUFreq.10=10MHz
sparkfun_pro_micro_esp32c3.menu.CPUFreq.10.build.f_cpu=10000000L

