espressif/arduino-esp32/boards.txt
sparkfun_pro_micro_esp32c3.menu.FlashMode.qio=QIO
sparkfun_pro_micro_esp32c3.menu.FlashMode.qio.build.flash_mode=dio
sparkfun_pro_micro_esp32c3.menu.FlashMode.qio.build.boot=qio
sparkfun_pro_micro_esp32c3.menu.FlashMode.dio=DIO
sparkfun_pro_micro_esp32c3.menu.FlashMode.dio.build.flash_mode=dio
sparkfun_pro_micro_esp32c3.menu.FlashMode.dio.build.boot=dio
sparkfun_pro_micro_esp32c3.menu.FlashMode.qout=QOUT
sparkfun_pro_micro_esp32c3.menu.FlashMode.qout.build.flash_mode=dout
sparkfun_pro_micro_esp32c3.menu.FlashMode.qout.build.boot=qout
sparkfun_pro_micro_esp32c3.menu.FlashMode.dout=DOUT
sparkfun_pro_micro_esp32c3.menu.FlashMode.dout.build.flash_mode=dout
sparkfun_pro_micro_esp32c3.menu.FlashMode.dout.build.boot=dout

sparkfun_pro_micro_esp32c3.menu.FlashFreq.80=80MHz
sparkfun_pro_micro_esp32c3.menu.FlashFreq.80.build.flash_freq=80m
sparkfun_pro_micro_esp32c3.menu.FlashFreq.40=40MHz
sparkfun_pro_micro_esp32c3.menu.FlashFreq.40.build.flash_freq=40m

sparkfun_pro_micro_esp32c3.menu.FlashSize.4M=4MB (32Mb)
sparkfun_pro_micro_esp32c3.menu.FlashSize.4M.build.flash_size=4MB

sparkfun_pro_micro_esp32c3.menu.UploadSpeed.921600=921600
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.921600.upload.speed=921600
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.115200=115200
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.115200.upload.speed=115200
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.256000.windows=256000
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.256000.upload.speed=256000
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.230400=230400
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.230400.upload.speed=230400
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.460800.linux=460800
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.460800.macosx=460800
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.460800.upload.speed=460800
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.512000.windows=512000
sparkfun_pro_micro_esp32c3.menu.UploadSpeed.512000.upload.speed=512000

sparkfun_pro_micro_esp32c3.menu.DebugLevel.none=None
sparkfun_pro_micro_esp32c3.menu.DebugLevel.none.build.code_debug=0
sparkfun_pro_micro_esp32c3.menu.DebugLevel.error=Error
sparkfun_pro_micro_esp32c3.menu.DebugLevel.error.build.code_debug=1
sparkfun_pro_micro_esp32c3.menu.DebugLevel.warn=Warn
sparkfun_pro_micro_esp32c3.menu.DebugLevel.warn.build.code_debug=2
sparkfun_pro_micro_esp32c3.menu.DebugLevel.info=Info
sparkfun_pro_micro_esp32c3.menu.DebugLevel.info.build.code_debug=3
sparkfun_pro_micro_esp32c3.menu.DebugLevel.debug=Debug
sparkfun_pro_micro_esp32c3.menu.DebugLevel.debug.build.code_debug=4
sparkfun_pro_micro_esp32c3.menu.DebugLevel.verbose=Verbose
sparkfun_pro_micro_esp32c3.menu.DebugLevel.verbose.build.code_debug=5

sparkfun_pro_micro_esp32c3.menu.EraseFlash.none=Disabled
sparkfun_pro_micro_esp32c3.menu.EraseFlash.none.upload.erase_cmd=
sparkfun_pro_micro_esp32c3.menu.EraseFlash.all=Enabled
sparkfun_pro_micro_esp32c3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

nina_w10.name=u-blox NINA-W10 series (ESP32)

nina_w10.bootloader.tool=esptool_py
nina_w10.bootloader.tool.default=esptool_py

nina_w10.upload.tool=esptool_py
nina_w10.upload.tool.default=esptool_py
nina_w10.upload.tool.network=esp_ota

nina_w10.upload.maximum_size=1310720
nina_w10.upload.maximum_data_size=327680
nina_w10.upload.flags=
nina_w10.upload.extra_flags=

nina_w10.serial.disableDTR=true
nina_w10.serial.disableRTS=true

nina_w10.build.tarch=xtensa
nina_w10.build.bootloader_addr=0x1000
nina_w10.build.target=esp32
nina_w10.build.mcu=esp32
nina_w10.build.core=esp32
nina_w10.build.variant=nina_w10
nina_w10.build.board=UBLOX_NINA_W10
nina_w10.build.f_cpu=240000000L
nina_w10.build.boot=dio
nina_w10.build.partitions=minimal
nina_w10.build.flash_mode=dio
nina_w10.build.flash_size=2MB
nina_w10.build.flash_freq=40m
nina_w10.build.defines=
nina_w10.build.extra_libs=
nina_w10.build.loop_core=
nina_w10.build.event_core=

nina_w10.menu.UploadSpeed.921600=921600
nina_w10.menu.UploadSpeed.921600.upload.speed=921600
nina_w10.menu.UploadSpeed.115200=115200
nina_w10.menu.UploadSpeed.115200.upload.speed=115200
nina_w10.menu.UploadSpeed.256000.windows=256000
nina_w10.menu.UploadSpeed.256000.upload.speed=256000
nina_w10.menu.UploadSpeed.230400.windows.upload.speed=256000
nina_w10.menu.UploadSpeed.230400=230400
nina_w10.menu.UploadSpeed.230400.upload.speed=230400
nina_w10.menu.UploadSpeed.460800.linux=460800
nina_w10.menu.UploadSpeed.460800.macosx=460800
nina_w10.menu.UploadSpeed.460800.upload.speed=460800
nina_w10.menu.UploadSpeed.512000.windows=512000
nina_w10.menu.UploadSpeed.512000.upload.speed=512000

nina_w10.menu.FlashSize.2M=2MB (16Mb, NINA-W101/W102)
nina_w10.menu.FlashSize.2M.build.flash_size=2MB
nina_w10.menu.FlashSize.4M=4MB (32Mb, NINA-W106-00B)
nina_w10.menu.FlashSize.4M.build.flash_size=4MB
nina_w10.menu.FlashSize.8M=8MB (64Mb, NINA-W106-10B)
nina_w10.menu.FlashSize.8M.build.flash_size=8MB

nina_w10.menu.FlashFreq.80=80MHz
nina_w10.menu.FlashFreq.80.build.flash_freq=80m
nina_w10.menu.FlashFreq.40=40MHz
nina_w10.menu.FlashFreq.40.build.flash_freq=40m

nina_w10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
nina_w10.menu.PartitionScheme.minimal.build.partitions=minimal
nina_w10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
nina_w10.menu.PartitionScheme.default.build.partitions=default
nina_w10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
nina_w10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
nina_w10.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
nina_w10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
nina_w10.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
nina_w10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
nina_w10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
nina_w10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
nina_w10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
nina_w10.menu.PartitionScheme.no_ota.build.partitions=no_ota
nina_w10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
nina_w10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
nina_w10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
nina_w10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
nina_w10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
nina_w10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
nina_w10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
nina_w10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
nina_w10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
nina_w10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
nina_w10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
nina_w10.menu.PartitionScheme.huge_app.build.partitions=huge_app
nina_w10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
nina_w10.menu.PartitionScheme.rainmaker=RainMaker 4MB
nina_w10.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
nina_w10.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
nina_w10.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
nina_w10.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
nina_w10.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
nina_w10.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
nina_w10.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
nina_w10.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

