espressif/arduino-esp32/boards.txt
lolin_s3.menu.EventsCore.1=Core 1
lolin_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lolin_s3.menu.EventsCore.0=Core 0
lolin_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lolin_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
lolin_s3.menu.USBMode.hwcdc.build.usb_mode=1
lolin_s3.menu.USBMode.default=USB-OTG (TinyUSB)
lolin_s3.menu.USBMode.default.build.usb_mode=0

lolin_s3.menu.CDCOnBoot.default=Disabled
lolin_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
lolin_s3.menu.CDCOnBoot.cdc=Enabled
lolin_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

lolin_s3.menu.MSCOnBoot.default=Disabled
lolin_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
lolin_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lolin_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

lolin_s3.menu.DFUOnBoot.default=Disabled
lolin_s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
lolin_s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lolin_s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lolin_s3.menu.UploadMode.default=UART0 / Hardware CDC
lolin_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
lolin_s3.menu.UploadMode.default.upload.wait_for_upload_port=false
lolin_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lolin_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lolin_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lolin_s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
lolin_s3.menu.PartitionScheme.fatflash.build.partitions=ffat
lolin_s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
lolin_s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lolin_s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lolin_s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lolin_s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
lolin_s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lolin_s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
lolin_s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
lolin_s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
lolin_s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
lolin_s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
lolin_s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
lolin_s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

lolin_s3.menu.CPUFreq.240=240MHz (WiFi)
lolin_s3.menu.CPUFreq.240.build.f_cpu=240000000L
lolin_s3.menu.CPUFreq.160=160MHz (WiFi)
lolin_s3.menu.CPUFreq.160.build.f_cpu=160000000L
lolin_s3.menu.CPUFreq.80=80MHz (WiFi)
lolin_s3.menu.CPUFreq.80.build.f_cpu=80000000L
lolin_s3.menu.CPUFreq.40=40MHz
lolin_s3.menu.CPUFreq.40.build.f_cpu=40000000L
lolin_s3.menu.CPUFreq.20=20MHz
lolin_s3.menu.CPUFreq.20.build.f_cpu=20000000L
lolin_s3.menu.CPUFreq.10=10MHz
lolin_s3.menu.CPUFreq.10.build.f_cpu=10000000L

lolin_s3.menu.UploadSpeed.921600=921600
lolin_s3.menu.UploadSpeed.921600.upload.speed=921600
lolin_s3.menu.UploadSpeed.115200=115200
lolin_s3.menu.UploadSpeed.115200.upload.speed=115200
lolin_s3.menu.UploadSpeed.256000.windows=256000
lolin_s3.menu.UploadSpeed.256000.upload.speed=256000
lolin_s3.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin_s3.menu.UploadSpeed.230400=230400
lolin_s3.menu.UploadSpeed.230400.upload.speed=230400
lolin_s3.menu.UploadSpeed.460800.linux=460800
lolin_s3.menu.UploadSpeed.460800.macosx=460800
lolin_s3.menu.UploadSpeed.460800.upload.speed=460800
lolin_s3.menu.UploadSpeed.512000.windows=512000
lolin_s3.menu.UploadSpeed.512000.upload.speed=512000

lolin_s3.menu.DebugLevel.none=None
lolin_s3.menu.DebugLevel.none.build.code_debug=0
lolin_s3.menu.DebugLevel.error=Error
lolin_s3.menu.DebugLevel.error.build.code_debug=1
lolin_s3.menu.DebugLevel.warn=Warn
lolin_s3.menu.DebugLevel.warn.build.code_debug=2
lolin_s3.menu.DebugLevel.info=Info
lolin_s3.menu.DebugLevel.info.build.code_debug=3
lolin_s3.menu.DebugLevel.debug=Debug
lolin_s3.menu.DebugLevel.debug.build.code_debug=4
lolin_s3.menu.DebugLevel.verbose=Verbose
lolin_s3.menu.DebugLevel.verbose.build.code_debug=5

lolin_s3.menu.EraseFlash.none=Disabled
lolin_s3.menu.EraseFlash.none.upload.erase_cmd=
lolin_s3.menu.EraseFlash.all=Enabled
lolin_s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lolin_s3_mini.name=LOLIN S3 Mini
lolin_s3_mini.vid.0=0x303a
lolin_s3_mini.pid.0=0x8167

lolin_s3_mini.bootloader.tool=esptool_py
lolin_s3_mini.bootloader.tool.default=esptool_py

lolin_s3_mini.upload.tool=esptool_py
lolin_s3_mini.upload.tool.default=esptool_py
lolin_s3_mini.upload.tool.network=esp_ota

lolin_s3_mini.upload.maximum_size=1310720
lolin_s3_mini.upload.maximum_data_size=327680
lolin_s3_mini.upload.flags=
lolin_s3_mini.upload.extra_flags=
lolin_s3_mini.upload.use_1200bps_touch=false
lolin_s3_mini.upload.wait_for_upload_port=false

lolin_s3_mini.serial.disableDTR=false
lolin_s3_mini.serial.disableRTS=false

lolin_s3_mini.build.tarch=xtensa
lolin_s3_mini.build.bootloader_addr=0x0
lolin_s3_mini.build.target=esp32s3
lolin_s3_mini.build.mcu=esp32s3
lolin_s3_mini.build.core=esp32
lolin_s3_mini.build.variant=lolin_s3_mini
lolin_s3_mini.build.board=LOLIN_S3_MINI

lolin_s3_mini.build.usb_mode=1
lolin_s3_mini.build.cdc_on_boot=0
lolin_s3_mini.build.msc_on_boot=0
lolin_s3_mini.build.dfu_on_boot=0
lolin_s3_mini.build.f_cpu=240000000L
lolin_s3_mini.build.flash_size=4MB
lolin_s3_mini.build.flash_freq=80m
lolin_s3_mini.build.flash_mode=dio
lolin_s3_mini.build.boot=qio
lolin_s3_mini.build.boot_freq=80m
lolin_s3_mini.build.partitions=default
lolin_s3_mini.build.defines=-DBOARD_HAS_PSRAM
lolin_s3_mini.build.loop_core=
lolin_s3_mini.build.event_core=
lolin_s3_mini.build.psram_type=qspi
lolin_s3_mini.build.memory_type={build.boot}_{build.psram_type}

lolin_s3_mini.menu.FlashMode.qio=QIO 80MHz
lolin_s3_mini.menu.FlashMode.qio.build.flash_mode=dio
lolin_s3_mini.menu.FlashMode.qio.build.boot=qio
lolin_s3_mini.menu.FlashMode.qio.build.boot_freq=80m
lolin_s3_mini.menu.FlashMode.qio.build.flash_freq=80m
lolin_s3_mini.menu.FlashMode.qio120=QIO 120MHz
lolin_s3_mini.menu.FlashMode.qio120.build.flash_mode=dio
lolin_s3_mini.menu.FlashMode.qio120.build.boot=qio
lolin_s3_mini.menu.FlashMode.qio120.build.boot_freq=120m
lolin_s3_mini.menu.FlashMode.qio120.build.flash_freq=80m

