espressif/arduino-esp32/boards.txt
##############################################################

viralink32g11.name=ViraLink Gate32-1.1

viralink32g11.bootloader.tool=esptool_py
viralink32g11.bootloader.tool.default=esptool_py

viralink32g11.upload.tool=esptool_py
viralink32g11.upload.tool.default=esptool_py
viralink32g11.upload.tool.network=esp_ota

viralink32g11.upload.maximum_size=1310720
viralink32g11.upload.maximum_data_size=327680
viralink32g11.upload.flags=
viralink32g11.upload.extra_flags=

viralink32g11.serial.disableDTR=true
viralink32g11.serial.disableRTS=true

viralink32g11.build.tarch=xtensa
viralink32g11.build.bootloader_addr=0x1000
viralink32g11.build.target=esp32
viralink32g11.build.mcu=esp32
viralink32g11.build.core=esp32
viralink32g11.build.variant=ViraLink-G1.1
viralink32g11.build.board=VIRALINK_GATE32_11

viralink32g11.build.f_cpu=240000000L
viralink32g11.build.flash_mode=dio
viralink32g11.build.flash_size=4MB
viralink32g11.build.boot=dio
viralink32g11.build.partitions=default
viralink32g11.build.defines=

viralink32g11.menu.FlashFreq.80=80MHz
viralink32g11.menu.FlashFreq.80.build.flash_freq=80m
viralink32g11.menu.FlashFreq.40=40MHz
viralink32g11.menu.FlashFreq.40.build.flash_freq=40m

viralink32g11.menu.PartitionScheme.default=Default
viralink32g11.menu.PartitionScheme.default.build.partitions=default
viralink32g11.menu.PartitionScheme.no_ota=No OTA (Large APP)
viralink32g11.menu.PartitionScheme.no_ota.build.partitions=no_ota
viralink32g11.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
viralink32g11.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
viralink32g11.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
viralink32g11.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

viralink32g11.menu.CPUFreq.240=240MHz (WiFi/BT)
viralink32g11.menu.CPUFreq.240.build.f_cpu=240000000L
viralink32g11.menu.CPUFreq.160=160MHz (WiFi/BT)
viralink32g11.menu.CPUFreq.160.build.f_cpu=160000000L
viralink32g11.menu.CPUFreq.80=80MHz (WiFi/BT)
viralink32g11.menu.CPUFreq.80.build.f_cpu=80000000L
viralink32g11.menu.CPUFreq.40=40MHz (40MHz XTAL)
viralink32g11.menu.CPUFreq.40.build.f_cpu=40000000L
viralink32g11.menu.CPUFreq.26=26MHz (26MHz XTAL)
viralink32g11.menu.CPUFreq.26.build.f_cpu=26000000L
viralink32g11.menu.CPUFreq.20=20MHz (40MHz XTAL)
viralink32g11.menu.CPUFreq.20.build.f_cpu=20000000L
viralink32g11.menu.CPUFreq.13=13MHz (26MHz XTAL)
viralink32g11.menu.CPUFreq.13.build.f_cpu=13000000L
viralink32g11.menu.CPUFreq.10=10MHz (40MHz XTAL)
viralink32g11.menu.CPUFreq.10.build.f_cpu=10000000L

viralink32g11.menu.UploadSpeed.921600=921600
viralink32g11.menu.UploadSpeed.921600.upload.speed=921600
viralink32g11.menu.UploadSpeed.115200=115200
viralink32g11.menu.UploadSpeed.115200.upload.speed=115200
viralink32g11.menu.UploadSpeed.256000.windows=256000
viralink32g11.menu.UploadSpeed.256000.upload.speed=256000
viralink32g11.menu.UploadSpeed.230400.windows.upload.speed=256000
viralink32g11.menu.UploadSpeed.230400=230400
viralink32g11.menu.UploadSpeed.230400.upload.speed=230400
viralink32g11.menu.UploadSpeed.460800.linux=460800
viralink32g11.menu.UploadSpeed.460800.macosx=460800
viralink32g11.menu.UploadSpeed.460800.upload.speed=460800
viralink32g11.menu.UploadSpeed.512000.windows=512000
viralink32g11.menu.UploadSpeed.512000.upload.speed=512000

viralink32g11.menu.DebugLevel.none=None
viralink32g11.menu.DebugLevel.none.build.code_debug=0
viralink32g11.menu.DebugLevel.error=Error
viralink32g11.menu.DebugLevel.error.build.code_debug=1
viralink32g11.menu.DebugLevel.warn=Warn
viralink32g11.menu.DebugLevel.warn.build.code_debug=2
viralink32g11.menu.DebugLevel.info=Info
viralink32g11.menu.DebugLevel.info.build.code_debug=3
viralink32g11.menu.DebugLevel.debug=Debug
viralink32g11.menu.DebugLevel.debug.build.code_debug=4
viralink32g11.menu.DebugLevel.verbose=Verbose
viralink32g11.menu.DebugLevel.verbose.build.code_debug=5

viralink32g11.menu.EraseFlash.none=Disabled
viralink32g11.menu.EraseFlash.none.upload.erase_cmd=
viralink32g11.menu.EraseFlash.all=Enabled
viralink32g11.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lolin32-lite.name=WEMOS LOLIN32 Lite

lolin32-lite.bootloader.tool=esptool_py
lolin32-lite.bootloader.tool.default=esptool_py

lolin32-lite.upload.tool=esptool_py
lolin32-lite.upload.tool.default=esptool_py
lolin32-lite.upload.tool.network=esp_ota

lolin32-lite.upload.maximum_size=1310720
lolin32-lite.upload.maximum_data_size=327680
lolin32-lite.upload.wait_for_upload_port=true
lolin32-lite.upload.flags=
lolin32-lite.upload.extra_flags=

lolin32-lite.serial.disableDTR=true
lolin32-lite.serial.disableRTS=true

lolin32-lite.build.tarch=xtensa
lolin32-lite.build.bootloader_addr=0x1000
lolin32-lite.build.target=esp32
lolin32-lite.build.mcu=esp32
lolin32-lite.build.core=esp32
lolin32-lite.build.variant=lolin32-lite
lolin32-lite.build.board=LOLIN32_LITE

lolin32-lite.build.f_cpu=240000000L
lolin32-lite.build.flash_mode=dio
lolin32-lite.build.flash_size=4MB
lolin32-lite.build.boot=dio
lolin32-lite.build.partitions=default
lolin32-lite.build.defines=

lolin32-lite.menu.FlashFreq.80=80MHz
lolin32-lite.menu.FlashFreq.80.build.flash_freq=80m
lolin32-lite.menu.FlashFreq.40=40MHz
lolin32-lite.menu.FlashFreq.40.build.flash_freq=40m

lolin32-lite.menu.PartitionScheme.default=Default
lolin32-lite.menu.PartitionScheme.default.build.partitions=default
lolin32-lite.menu.PartitionScheme.no_ota=No OTA (Large APP)
lolin32-lite.menu.PartitionScheme.no_ota.build.partitions=no_ota
lolin32-lite.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lolin32-lite.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
lolin32-lite.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lolin32-lite.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

lolin32-lite.menu.CPUFreq.240=240MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.240.build.f_cpu=240000000L
lolin32-lite.menu.CPUFreq.160=160MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.160.build.f_cpu=160000000L
lolin32-lite.menu.CPUFreq.80=80MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.80.build.f_cpu=80000000L
lolin32-lite.menu.CPUFreq.40=40MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.40.build.f_cpu=40000000L
lolin32-lite.menu.CPUFreq.26=26MHz (26MHz XTAL)
lolin32-lite.menu.CPUFreq.26.build.f_cpu=26000000L
lolin32-lite.menu.CPUFreq.20=20MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.20.build.f_cpu=20000000L
lolin32-lite.menu.CPUFreq.13=13MHz (26MHz XTAL)
lolin32-lite.menu.CPUFreq.13.build.f_cpu=13000000L
lolin32-lite.menu.CPUFreq.10=10MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.10.build.f_cpu=10000000L

