espressif/arduino-esp32/boards.txt
lolin32-lite.menu.UploadSpeed.921600=921600
lolin32-lite.menu.UploadSpeed.921600.upload.speed=921600
lolin32-lite.menu.UploadSpeed.115200=115200
lolin32-lite.menu.UploadSpeed.115200.upload.speed=115200
lolin32-lite.menu.UploadSpeed.256000.windows=256000
lolin32-lite.menu.UploadSpeed.256000.upload.speed=256000
lolin32-lite.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin32-lite.menu.UploadSpeed.230400=230400
lolin32-lite.menu.UploadSpeed.230400.upload.speed=230400
lolin32-lite.menu.UploadSpeed.460800.linux=460800
lolin32-lite.menu.UploadSpeed.460800.macosx=460800
lolin32-lite.menu.UploadSpeed.460800.upload.speed=460800
lolin32-lite.menu.UploadSpeed.512000.windows=512000
lolin32-lite.menu.UploadSpeed.512000.upload.speed=512000

lolin32-lite.menu.DebugLevel.none=None
lolin32-lite.menu.DebugLevel.none.build.code_debug=0
lolin32-lite.menu.DebugLevel.error=Error
lolin32-lite.menu.DebugLevel.error.build.code_debug=1
lolin32-lite.menu.DebugLevel.warn=Warn
lolin32-lite.menu.DebugLevel.warn.build.code_debug=2
lolin32-lite.menu.DebugLevel.info=Info
lolin32-lite.menu.DebugLevel.info.build.code_debug=3
lolin32-lite.menu.DebugLevel.debug=Debug
lolin32-lite.menu.DebugLevel.debug.build.code_debug=4
lolin32-lite.menu.DebugLevel.verbose=Verbose
lolin32-lite.menu.DebugLevel.verbose.build.code_debug=5

lolin32-lite.menu.EraseFlash.none=Disabled
lolin32-lite.menu.EraseFlash.none.upload.erase_cmd=
lolin32-lite.menu.EraseFlash.all=Enabled
lolin32-lite.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

pocket_32.name=Dongsen Tech Pocket 32

pocket_32.bootloader.tool=esptool_py
pocket_32.bootloader.tool.default=esptool_py

pocket_32.upload.tool=esptool_py
pocket_32.upload.tool.default=esptool_py
pocket_32.upload.tool.network=esp_ota

pocket_32.upload.maximum_size=1310720
pocket_32.upload.maximum_data_size=327680
pocket_32.upload.flags=
pocket_32.upload.extra_flags=

pocket_32.serial.disableDTR=true
pocket_32.serial.disableRTS=true

pocket_32.build.tarch=xtensa
pocket_32.build.bootloader_addr=0x1000
pocket_32.build.target=esp32
pocket_32.build.mcu=esp32
pocket_32.build.core=esp32
pocket_32.build.variant=pocket_32
pocket_32.build.board=Pocket32

pocket_32.build.f_cpu=240000000L
pocket_32.build.flash_mode=dio
pocket_32.build.flash_size=4MB
pocket_32.build.boot=dio
pocket_32.build.partitions=default
pocket_32.build.defines=

pocket_32.menu.FlashFreq.80=80MHz
pocket_32.menu.FlashFreq.80.build.flash_freq=80m
pocket_32.menu.FlashFreq.40=40MHz
pocket_32.menu.FlashFreq.40.build.flash_freq=40m

pocket_32.menu.UploadSpeed.921600=921600
pocket_32.menu.UploadSpeed.921600.upload.speed=921600
pocket_32.menu.UploadSpeed.115200=115200
pocket_32.menu.UploadSpeed.115200.upload.speed=115200
pocket_32.menu.UploadSpeed.256000.windows=256000
pocket_32.menu.UploadSpeed.256000.upload.speed=256000
pocket_32.menu.UploadSpeed.230400.windows.upload.speed=256000
pocket_32.menu.UploadSpeed.230400=230400
pocket_32.menu.UploadSpeed.230400.upload.speed=230400
pocket_32.menu.UploadSpeed.460800.linux=460800
pocket_32.menu.UploadSpeed.460800.macosx=460800
pocket_32.menu.UploadSpeed.460800.upload.speed=460800
pocket_32.menu.UploadSpeed.512000.windows=512000
pocket_32.menu.UploadSpeed.512000.upload.speed=512000

pocket_32.menu.DebugLevel.none=None
pocket_32.menu.DebugLevel.none.build.code_debug=0
pocket_32.menu.DebugLevel.error=Error
pocket_32.menu.DebugLevel.error.build.code_debug=1
pocket_32.menu.DebugLevel.warn=Warn
pocket_32.menu.DebugLevel.warn.build.code_debug=2
pocket_32.menu.DebugLevel.info=Info
pocket_32.menu.DebugLevel.info.build.code_debug=3
pocket_32.menu.DebugLevel.debug=Debug
pocket_32.menu.DebugLevel.debug.build.code_debug=4
pocket_32.menu.DebugLevel.verbose=Verbose
pocket_32.menu.DebugLevel.verbose.build.code_debug=5

pocket_32.menu.EraseFlash.none=Disabled
pocket_32.menu.EraseFlash.none.upload.erase_cmd=
pocket_32.menu.EraseFlash.all=Enabled
pocket_32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

WeMosBat.name=WeMos WiFi&Bluetooth Battery

WeMosBat.bootloader.tool=esptool_py
WeMosBat.bootloader.tool.default=esptool_py

WeMosBat.upload.tool=esptool_py
WeMosBat.upload.tool.default=esptool_py
WeMosBat.upload.tool.network=esp_ota

WeMosBat.upload.maximum_size=1310720
WeMosBat.upload.maximum_data_size=327680
WeMosBat.upload.flags=
WeMosBat.upload.extra_flags=

WeMosBat.serial.disableDTR=true
WeMosBat.serial.disableRTS=true

WeMosBat.build.tarch=xtensa
WeMosBat.build.bootloader_addr=0x1000
WeMosBat.build.target=esp32
WeMosBat.build.mcu=esp32
WeMosBat.build.core=esp32
WeMosBat.build.variant=pocket_32
WeMosBat.build.board=Pocket32

WeMosBat.build.f_cpu=240000000L
WeMosBat.build.flash_mode=dio
WeMosBat.build.flash_size=4MB
WeMosBat.build.boot=dio
WeMosBat.build.partitions=default
WeMosBat.build.defines=

WeMosBat.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
WeMosBat.menu.PartitionScheme.default.build.partitions=default
WeMosBat.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
WeMosBat.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
WeMosBat.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
WeMosBat.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
WeMosBat.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
WeMosBat.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
WeMosBat.menu.PartitionScheme.minimal.build.partitions=minimal
WeMosBat.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
WeMosBat.menu.PartitionScheme.no_ota.build.partitions=no_ota
WeMosBat.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
WeMosBat.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
WeMosBat.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
WeMosBat.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
WeMosBat.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
WeMosBat.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
WeMosBat.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
WeMosBat.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
WeMosBat.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
WeMosBat.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
WeMosBat.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
WeMosBat.menu.PartitionScheme.huge_app.build.partitions=huge_app
WeMosBat.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
WeMosBat.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
WeMosBat.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
WeMosBat.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
WeMosBat.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
WeMosBat.menu.PartitionScheme.fatflash.build.partitions=ffat
WeMosBat.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
WeMosBat.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
WeMosBat.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
WeMosBat.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
WeMosBat.menu.PartitionScheme.rainmaker=RainMaker 4MB
WeMosBat.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
WeMosBat.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
WeMosBat.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
WeMosBat.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
WeMosBat.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656

WeMosBat.menu.FlashFreq.80=80MHz
WeMosBat.menu.FlashFreq.80.build.flash_freq=80m
WeMosBat.menu.FlashFreq.40=40MHz
WeMosBat.menu.FlashFreq.40.build.flash_freq=40m

WeMosBat.menu.UploadSpeed.921600=921600
WeMosBat.menu.UploadSpeed.921600.upload.speed=921600
WeMosBat.menu.UploadSpeed.115200=115200
WeMosBat.menu.UploadSpeed.115200.upload.speed=115200
WeMosBat.menu.UploadSpeed.256000.windows=256000
WeMosBat.menu.UploadSpeed.256000.upload.speed=256000
WeMosBat.menu.UploadSpeed.230400.windows.upload.speed=256000
WeMosBat.menu.UploadSpeed.230400=230400
WeMosBat.menu.UploadSpeed.230400.upload.speed=230400
WeMosBat.menu.UploadSpeed.460800.linux=460800
WeMosBat.menu.UploadSpeed.460800.macosx=460800
WeMosBat.menu.UploadSpeed.460800.upload.speed=460800
WeMosBat.menu.UploadSpeed.512000.windows=512000
WeMosBat.menu.UploadSpeed.512000.upload.speed=512000

WeMosBat.menu.DebugLevel.none=None
WeMosBat.menu.DebugLevel.none.build.code_debug=0
WeMosBat.menu.DebugLevel.error=Error
WeMosBat.menu.DebugLevel.error.build.code_debug=1
WeMosBat.menu.DebugLevel.warn=Warn
WeMosBat.menu.DebugLevel.warn.build.code_debug=2
WeMosBat.menu.DebugLevel.info=Info
WeMosBat.menu.DebugLevel.info.build.code_debug=3
WeMosBat.menu.DebugLevel.debug=Debug
WeMosBat.menu.DebugLevel.debug.build.code_debug=4
WeMosBat.menu.DebugLevel.verbose=Verbose
WeMosBat.menu.DebugLevel.verbose.build.code_debug=5

WeMosBat.menu.EraseFlash.none=Disabled
WeMosBat.menu.EraseFlash.none.upload.erase_cmd=
WeMosBat.menu.EraseFlash.all=Enabled
WeMosBat.menu.EraseFlash.all.upload.erase_cmd=-e

