espressif/arduino-esp32/boards.txt
node32s.menu.EraseFlash.none=Disabled
node32s.menu.EraseFlash.none.upload.erase_cmd=
node32s.menu.EraseFlash.all=Enabled
node32s.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

hornbill32dev.name=Hornbill ESP32 Dev

hornbill32dev.bootloader.tool=esptool_py
hornbill32dev.bootloader.tool.default=esptool_py

hornbill32dev.upload.tool=esptool_py
hornbill32dev.upload.tool.default=esptool_py
hornbill32dev.upload.tool.network=esp_ota

hornbill32dev.upload.maximum_size=1310720
hornbill32dev.upload.maximum_data_size=327680
hornbill32dev.upload.flags=
hornbill32dev.upload.extra_flags=

hornbill32dev.serial.disableDTR=true
hornbill32dev.serial.disableRTS=true

hornbill32dev.build.tarch=xtensa
hornbill32dev.build.bootloader_addr=0x1000
hornbill32dev.build.target=esp32
hornbill32dev.build.mcu=esp32
hornbill32dev.build.core=esp32
hornbill32dev.build.variant=hornbill32dev
hornbill32dev.build.board=HORNBILL_ESP32_DEV

hornbill32dev.build.f_cpu=240000000L
hornbill32dev.build.flash_mode=dio
hornbill32dev.build.flash_size=4MB
hornbill32dev.build.boot=dio
hornbill32dev.build.partitions=default
hornbill32dev.build.defines=

hornbill32dev.menu.FlashFreq.80=80MHz
hornbill32dev.menu.FlashFreq.80.build.flash_freq=80m
hornbill32dev.menu.FlashFreq.40=40MHz
hornbill32dev.menu.FlashFreq.40.build.flash_freq=40m

hornbill32dev.menu.UploadSpeed.921600=921600
hornbill32dev.menu.UploadSpeed.921600.upload.speed=921600
hornbill32dev.menu.UploadSpeed.115200=115200
hornbill32dev.menu.UploadSpeed.115200.upload.speed=115200
hornbill32dev.menu.UploadSpeed.256000.windows=256000
hornbill32dev.menu.UploadSpeed.256000.upload.speed=256000
hornbill32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
hornbill32dev.menu.UploadSpeed.230400=230400
hornbill32dev.menu.UploadSpeed.230400.upload.speed=230400
hornbill32dev.menu.UploadSpeed.460800.linux=460800
hornbill32dev.menu.UploadSpeed.460800.macosx=460800
hornbill32dev.menu.UploadSpeed.460800.upload.speed=460800
hornbill32dev.menu.UploadSpeed.512000.windows=512000
hornbill32dev.menu.UploadSpeed.512000.upload.speed=512000

hornbill32dev.menu.DebugLevel.none=None
hornbill32dev.menu.DebugLevel.none.build.code_debug=0
hornbill32dev.menu.DebugLevel.error=Error
hornbill32dev.menu.DebugLevel.error.build.code_debug=1
hornbill32dev.menu.DebugLevel.warn=Warn
hornbill32dev.menu.DebugLevel.warn.build.code_debug=2
hornbill32dev.menu.DebugLevel.info=Info
hornbill32dev.menu.DebugLevel.info.build.code_debug=3
hornbill32dev.menu.DebugLevel.debug=Debug
hornbill32dev.menu.DebugLevel.debug.build.code_debug=4
hornbill32dev.menu.DebugLevel.verbose=Verbose
hornbill32dev.menu.DebugLevel.verbose.build.code_debug=5

hornbill32dev.menu.EraseFlash.none=Disabled
hornbill32dev.menu.EraseFlash.none.upload.erase_cmd=
hornbill32dev.menu.EraseFlash.all=Enabled
hornbill32dev.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

hornbill32minima.name=Hornbill ESP32 Minima

hornbill32minima.bootloader.tool=esptool_py
hornbill32minima.bootloader.tool.default=esptool_py

hornbill32minima.upload.tool=esptool_py
hornbill32minima.upload.tool.default=esptool_py
hornbill32minima.upload.tool.network=esp_ota

hornbill32minima.upload.maximum_size=1310720
hornbill32minima.upload.maximum_data_size=327680
hornbill32minima.upload.flags=
hornbill32minima.upload.extra_flags=

hornbill32minima.serial.disableDTR=true
hornbill32minima.serial.disableRTS=true

hornbill32minima.build.tarch=xtensa
hornbill32minima.build.bootloader_addr=0x1000
hornbill32minima.build.target=esp32
hornbill32minima.build.mcu=esp32
hornbill32minima.build.core=esp32
hornbill32minima.build.variant=hornbill32minima
hornbill32minima.build.board=HORNBILL_ESP32_MINIMA
hornbill32minima.build.f_cpu=240000000L
hornbill32minima.build.flash_mode=dio
hornbill32minima.build.flash_size=4MB
hornbill32minima.build.boot=dio
hornbill32minima.build.partitions=default
hornbill32minima.build.defines=

hornbill32minima.menu.FlashFreq.80=80MHz
hornbill32minima.menu.FlashFreq.80.build.flash_freq=80m
hornbill32minima.menu.FlashFreq.40=40MHz
hornbill32minima.menu.FlashFreq.40.build.flash_freq=40m

hornbill32minima.menu.UploadSpeed.921600=921600
hornbill32minima.menu.UploadSpeed.921600.upload.speed=921600
hornbill32minima.menu.UploadSpeed.115200=115200
hornbill32minima.menu.UploadSpeed.115200.upload.speed=115200
hornbill32minima.menu.UploadSpeed.256000.windows=256000
hornbill32minima.menu.UploadSpeed.256000.upload.speed=256000
hornbill32minima.menu.UploadSpeed.230400.windows.upload.speed=256000
hornbill32minima.menu.UploadSpeed.230400=230400
hornbill32minima.menu.UploadSpeed.230400.upload.speed=230400
hornbill32minima.menu.UploadSpeed.460800.linux=460800
hornbill32minima.menu.UploadSpeed.460800.macosx=460800
hornbill32minima.menu.UploadSpeed.460800.upload.speed=460800
hornbill32minima.menu.UploadSpeed.512000.windows=512000
hornbill32minima.menu.UploadSpeed.512000.upload.speed=512000

hornbill32minima.menu.DebugLevel.none=None
hornbill32minima.menu.DebugLevel.none.build.code_debug=0
hornbill32minima.menu.DebugLevel.error=Error
hornbill32minima.menu.DebugLevel.error.build.code_debug=1
hornbill32minima.menu.DebugLevel.warn=Warn
hornbill32minima.menu.DebugLevel.warn.build.code_debug=2
hornbill32minima.menu.DebugLevel.info=Info
hornbill32minima.menu.DebugLevel.info.build.code_debug=3
hornbill32minima.menu.DebugLevel.debug=Debug
hornbill32minima.menu.DebugLevel.debug.build.code_debug=4
hornbill32minima.menu.DebugLevel.verbose=Verbose
hornbill32minima.menu.DebugLevel.verbose.build.code_debug=5

hornbill32minima.menu.EraseFlash.none=Disabled
hornbill32minima.menu.EraseFlash.none.upload.erase_cmd=
hornbill32minima.menu.EraseFlash.all=Enabled
hornbill32minima.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
dfrobot_beetle_esp32c3.name=DFRobot Beetle ESP32-C3

dfrobot_beetle_esp32c3.bootloader.tool=esptool_py
dfrobot_beetle_esp32c3.bootloader.tool.default=esptool_py

dfrobot_beetle_esp32c3.upload.tool=esptool_py
dfrobot_beetle_esp32c3.upload.tool.default=esptool_py
dfrobot_beetle_esp32c3.upload.tool.network=esp_ota

