espressif/arduino-esp32/boards.txt
dfrobot_beetle_esp32c6.menu.UploadSpeed.921600=921600
dfrobot_beetle_esp32c6.menu.UploadSpeed.921600.upload.speed=921600
dfrobot_beetle_esp32c6.menu.UploadSpeed.115200=115200
dfrobot_beetle_esp32c6.menu.UploadSpeed.115200.upload.speed=115200
dfrobot_beetle_esp32c6.menu.UploadSpeed.256000.windows=256000
dfrobot_beetle_esp32c6.menu.UploadSpeed.256000.upload.speed=256000
dfrobot_beetle_esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
dfrobot_beetle_esp32c6.menu.UploadSpeed.230400=230400
dfrobot_beetle_esp32c6.menu.UploadSpeed.230400.upload.speed=230400
dfrobot_beetle_esp32c6.menu.UploadSpeed.460800.linux=460800
dfrobot_beetle_esp32c6.menu.UploadSpeed.460800.macosx=460800
dfrobot_beetle_esp32c6.menu.UploadSpeed.460800.upload.speed=460800
dfrobot_beetle_esp32c6.menu.UploadSpeed.512000.windows=512000
dfrobot_beetle_esp32c6.menu.UploadSpeed.512000.upload.speed=512000

dfrobot_beetle_esp32c6.menu.DebugLevel.none=None
dfrobot_beetle_esp32c6.menu.DebugLevel.none.build.code_debug=0
dfrobot_beetle_esp32c6.menu.DebugLevel.error=Error
dfrobot_beetle_esp32c6.menu.DebugLevel.error.build.code_debug=1
dfrobot_beetle_esp32c6.menu.DebugLevel.warn=Warn
dfrobot_beetle_esp32c6.menu.DebugLevel.warn.build.code_debug=2
dfrobot_beetle_esp32c6.menu.DebugLevel.info=Info
dfrobot_beetle_esp32c6.menu.DebugLevel.info.build.code_debug=3
dfrobot_beetle_esp32c6.menu.DebugLevel.debug=Debug
dfrobot_beetle_esp32c6.menu.DebugLevel.debug.build.code_debug=4
dfrobot_beetle_esp32c6.menu.DebugLevel.verbose=Verbose
dfrobot_beetle_esp32c6.menu.DebugLevel.verbose.build.code_debug=5

dfrobot_beetle_esp32c6.menu.EraseFlash.none=Disabled
dfrobot_beetle_esp32c6.menu.EraseFlash.none.upload.erase_cmd=
dfrobot_beetle_esp32c6.menu.EraseFlash.all=Enabled
dfrobot_beetle_esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

dfrobot_beetle_esp32c6.menu.ZigbeeMode.default=Disabled
dfrobot_beetle_esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
dfrobot_beetle_esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
dfrobot_beetle_esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
dfrobot_beetle_esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
dfrobot_beetle_esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
dfrobot_beetle_esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
dfrobot_beetle_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
dfrobot_beetle_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################

dfrobot_firebeetle2_esp32e.name=FireBeetle 2 ESP32-E

dfrobot_firebeetle2_esp32e.upload.tool=esptool_py
dfrobot_firebeetle2_esp32e.upload.tool.default=esptool_py
dfrobot_firebeetle2_esp32e.upload.maximum_size=1310720
dfrobot_firebeetle2_esp32e.upload.maximum_data_size=327680
dfrobot_firebeetle2_esp32e.upload.flags=
dfrobot_firebeetle2_esp32e.upload.extra_flags=

dfrobot_firebeetle2_esp32e.serial.disableDTR=true
dfrobot_firebeetle2_esp32e.serial.disableRTS=true

dfrobot_firebeetle2_esp32e.build.tarch=xtensa
dfrobot_firebeetle2_esp32e.build.bootloader_addr=0x1000
dfrobot_firebeetle2_esp32e.build.target=esp32
dfrobot_firebeetle2_esp32e.build.mcu=esp32
dfrobot_firebeetle2_esp32e.build.core=esp32
dfrobot_firebeetle2_esp32e.build.variant=dfrobot_firebeetle2_esp32e
dfrobot_firebeetle2_esp32e.build.board=DFROBOT_FIREBEETLE_2_ESP32E

dfrobot_firebeetle2_esp32e.build.f_cpu=240000000L
dfrobot_firebeetle2_esp32e.build.flash_size=4MB
dfrobot_firebeetle2_esp32e.build.flash_freq=40m
dfrobot_firebeetle2_esp32e.build.flash_mode=dio
dfrobot_firebeetle2_esp32e.build.boot=dio
dfrobot_firebeetle2_esp32e.build.partitions=default
dfrobot_firebeetle2_esp32e.build.defines=
dfrobot_firebeetle2_esp32e.build.loop_core=
dfrobot_firebeetle2_esp32e.build.event_core=

dfrobot_firebeetle2_esp32e.menu.PSRAM.disabled=Disabled
dfrobot_firebeetle2_esp32e.menu.PSRAM.disabled.build.defines=
dfrobot_firebeetle2_esp32e.menu.PSRAM.disabled.build.extra_libs=
dfrobot_firebeetle2_esp32e.menu.PSRAM.enabled=Enabled
dfrobot_firebeetle2_esp32e.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
dfrobot_firebeetle2_esp32e.menu.PSRAM.enabled.build.extra_libs=

dfrobot_firebeetle2_esp32e.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.default.build.partitions=default
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.minimal.build.partitions=minimal
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.no_ota.build.partitions=no_ota
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.huge_app.build.partitions=huge_app
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.fatflash.build.partitions=ffat
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker=RainMaker 4MB
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
dfrobot_firebeetle2_esp32e.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

dfrobot_firebeetle2_esp32e.menu.CPUFreq.240=240MHz (WiFi/BT)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.240.build.f_cpu=240000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.160=160MHz (WiFi/BT)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.160.build.f_cpu=160000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.80=80MHz (WiFi/BT)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.80.build.f_cpu=80000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.40=40MHz (40MHz XTAL)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.40.build.f_cpu=40000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.26=26MHz (26MHz XTAL)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.26.build.f_cpu=26000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.20=20MHz (40MHz XTAL)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.20.build.f_cpu=20000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.13=13MHz (26MHz XTAL)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.13.build.f_cpu=13000000L
dfrobot_firebeetle2_esp32e.menu.CPUFreq.10=10MHz (40MHz XTAL)
dfrobot_firebeetle2_esp32e.menu.CPUFreq.10.build.f_cpu=10000000L

dfrobot_firebeetle2_esp32e.menu.FlashMode.qio=QIO
dfrobot_firebeetle2_esp32e.menu.FlashMode.qio.build.flash_mode=dio
dfrobot_firebeetle2_esp32e.menu.FlashMode.qio.build.boot=qio
dfrobot_firebeetle2_esp32e.menu.FlashMode.dio=DIO
dfrobot_firebeetle2_esp32e.menu.FlashMode.dio.build.flash_mode=dio
dfrobot_firebeetle2_esp32e.menu.FlashMode.dio.build.boot=dio

