espressif/arduino-esp32/boards.txt
##############################################################
dfrobot_lorawan_esp32s3.name=DFRobot LoRaWAN ESP32-S3
#dfrobot_lorawan_esp32s3.vid.0=0x303a
#dfrobot_lorawan_esp32s3.pid.0=0x1001

dfrobot_lorawan_esp32s3.bootloader.tool=esptool_py
dfrobot_lorawan_esp32s3.bootloader.tool.default=esptool_py

dfrobot_lorawan_esp32s3.upload.tool=esptool_py
dfrobot_lorawan_esp32s3.upload.tool.default=esptool_py
dfrobot_lorawan_esp32s3.upload.tool.network=esp_ota

dfrobot_lorawan_esp32s3.upload.speed=921600
dfrobot_lorawan_esp32s3.upload.erase_cmd=
dfrobot_lorawan_esp32s3.upload.maximum_size=1310720
dfrobot_lorawan_esp32s3.upload.maximum_data_size=327680
dfrobot_lorawan_esp32s3.upload.flags=
dfrobot_lorawan_esp32s3.upload.extra_flags=
dfrobot_lorawan_esp32s3.upload.use_1200bps_touch=false
dfrobot_lorawan_esp32s3.upload.wait_for_upload_port=false

dfrobot_lorawan_esp32s3.serial.disableDTR=false
dfrobot_lorawan_esp32s3.serial.disableRTS=false

dfrobot_lorawan_esp32s3.build.tarch=xtensa
dfrobot_lorawan_esp32s3.build.bootloader_addr=0x0
dfrobot_lorawan_esp32s3.build.target=esp32s3
dfrobot_lorawan_esp32s3.build.mcu=esp32s3
dfrobot_lorawan_esp32s3.build.core=esp32
dfrobot_lorawan_esp32s3.build.variant=dfrobot_lorawan_esp32s3
dfrobot_lorawan_esp32s3.build.board=DFROBOT_LORAWAN_ESP32S3
dfrobot_lorawan_esp32s3.build.usb_mode=1
dfrobot_lorawan_esp32s3.build.cdc_on_boot=1
dfrobot_lorawan_esp32s3.build.msc_on_boot=0
dfrobot_lorawan_esp32s3.build.dfu_on_boot=0
dfrobot_lorawan_esp32s3.build.f_cpu=240000000L
dfrobot_lorawan_esp32s3.build.flash_size=4MB
dfrobot_lorawan_esp32s3.build.flash_freq=80m
dfrobot_lorawan_esp32s3.build.flash_mode=dio
dfrobot_lorawan_esp32s3.build.boot=qio
dfrobot_lorawan_esp32s3.build.boot_freq=80m
dfrobot_lorawan_esp32s3.build.partitions=default
dfrobot_lorawan_esp32s3.build.defines=-D{build.band}
dfrobot_lorawan_esp32s3.build.loop_core=
dfrobot_lorawan_esp32s3.build.event_core=
dfrobot_lorawan_esp32s3.build.psram_type=qspi
dfrobot_lorawan_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}
dfrobot_lorawan_esp32s3.build.region=

dfrobot_lorawan_esp32s3.menu.FlashMode.qio=QIO 80MHz
dfrobot_lorawan_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
dfrobot_lorawan_esp32s3.menu.FlashMode.qio.build.boot=qio
dfrobot_lorawan_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
dfrobot_lorawan_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
dfrobot_lorawan_esp32s3.menu.FlashMode.qio.build.flash_type=qio
dfrobot_lorawan_esp32s3.menu.FlashMode.qio120=QIO 120MHz
dfrobot_lorawan_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
dfrobot_lorawan_esp32s3.menu.FlashMode.qio120.build.boot=qio
dfrobot_lorawan_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
dfrobot_lorawan_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
dfrobot_lorawan_esp32s3.menu.FlashMode.qio120.build.flash_type=qio
dfrobot_lorawan_esp32s3.menu.FlashMode.dio=DIO 80MHz
dfrobot_lorawan_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
dfrobot_lorawan_esp32s3.menu.FlashMode.dio.build.boot=dio
dfrobot_lorawan_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
dfrobot_lorawan_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
dfrobot_lorawan_esp32s3.menu.FlashMode.dio.build.flash_type=qio

dfrobot_lorawan_esp32s3.menu.FlashSize.4M=4MB (32Mb)
dfrobot_lorawan_esp32s3.menu.FlashSize.4M.build.flash_size=4MB

dfrobot_lorawan_esp32s3.menu.LoopCore.1=Core 1
dfrobot_lorawan_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
dfrobot_lorawan_esp32s3.menu.LoopCore.0=Core 0
dfrobot_lorawan_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

dfrobot_lorawan_esp32s3.menu.EventsCore.1=Core 1
dfrobot_lorawan_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
dfrobot_lorawan_esp32s3.menu.EventsCore.0=Core 0
dfrobot_lorawan_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0
dfrobot_lorawan_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
dfrobot_lorawan_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1
dfrobot_lorawan_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
dfrobot_lorawan_esp32s3.menu.USBMode.default.build.usb_mode=0

dfrobot_lorawan_esp32s3.menu.CDCOnBoot.default=Disabled
dfrobot_lorawan_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
dfrobot_lorawan_esp32s3.menu.CDCOnBoot.cdc=Enabled
dfrobot_lorawan_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

dfrobot_lorawan_esp32s3.menu.MSCOnBoot.default=Disabled
dfrobot_lorawan_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
dfrobot_lorawan_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
dfrobot_lorawan_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

dfrobot_lorawan_esp32s3.menu.DFUOnBoot.default=Disabled
dfrobot_lorawan_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
dfrobot_lorawan_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
dfrobot_lorawan_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

dfrobot_lorawan_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
dfrobot_lorawan_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
dfrobot_lorawan_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
dfrobot_lorawan_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
dfrobot_lorawan_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
dfrobot_lorawan_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

dfrobot_lorawan_esp32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.default.build.partitions=default
dfrobot_lorawan_esp32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dfrobot_lorawan_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
dfrobot_lorawan_esp32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
dfrobot_lorawan_esp32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dfrobot_lorawan_esp32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dfrobot_lorawan_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
dfrobot_lorawan_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dfrobot_lorawan_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dfrobot_lorawan_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dfrobot_lorawan_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dfrobot_lorawan_esp32s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
dfrobot_lorawan_esp32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dfrobot_lorawan_esp32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
dfrobot_lorawan_esp32s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
dfrobot_lorawan_esp32s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
dfrobot_lorawan_esp32s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656


dfrobot_lorawan_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
dfrobot_lorawan_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
dfrobot_lorawan_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
dfrobot_lorawan_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
dfrobot_lorawan_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
dfrobot_lorawan_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
dfrobot_lorawan_esp32s3.menu.CPUFreq.40=40MHz
dfrobot_lorawan_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
dfrobot_lorawan_esp32s3.menu.CPUFreq.20=20MHz
dfrobot_lorawan_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
dfrobot_lorawan_esp32s3.menu.CPUFreq.10=10MHz
dfrobot_lorawan_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

dfrobot_lorawan_esp32s3.menu.UploadSpeed.921600=921600
dfrobot_lorawan_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
dfrobot_lorawan_esp32s3.menu.UploadSpeed.115200=115200
dfrobot_lorawan_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
dfrobot_lorawan_esp32s3.menu.UploadSpeed.256000.windows=256000
dfrobot_lorawan_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
dfrobot_lorawan_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
dfrobot_lorawan_esp32s3.menu.UploadSpeed.230400=230400
dfrobot_lorawan_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
dfrobot_lorawan_esp32s3.menu.UploadSpeed.460800.linux=460800
dfrobot_lorawan_esp32s3.menu.UploadSpeed.460800.macosx=460800
dfrobot_lorawan_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
dfrobot_lorawan_esp32s3.menu.UploadSpeed.512000.windows=512000
dfrobot_lorawan_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

dfrobot_lorawan_esp32s3.menu.DebugLevel.none=None
dfrobot_lorawan_esp32s3.menu.DebugLevel.none.build.code_debug=0
dfrobot_lorawan_esp32s3.menu.DebugLevel.error=Error
dfrobot_lorawan_esp32s3.menu.DebugLevel.error.build.code_debug=1
dfrobot_lorawan_esp32s3.menu.DebugLevel.warn=Warn
dfrobot_lorawan_esp32s3.menu.DebugLevel.warn.build.code_debug=2
dfrobot_lorawan_esp32s3.menu.DebugLevel.info=Info
dfrobot_lorawan_esp32s3.menu.DebugLevel.info.build.code_debug=3
dfrobot_lorawan_esp32s3.menu.DebugLevel.debug=Debug
dfrobot_lorawan_esp32s3.menu.DebugLevel.debug.build.code_debug=4
dfrobot_lorawan_esp32s3.menu.DebugLevel.verbose=Verbose
dfrobot_lorawan_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

dfrobot_lorawan_esp32s3.menu.EraseFlash.none=Disabled
dfrobot_lorawan_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
dfrobot_lorawan_esp32s3.menu.EraseFlash.all=Enabled
dfrobot_lorawan_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

