espressif/arduino-esp32/boards.txt
##############################################################

onehorse32dev.name=Onehorse ESP32 Dev Module

onehorse32dev.bootloader.tool=esptool_py
onehorse32dev.bootloader.tool.default=esptool_py

onehorse32dev.upload.tool=esptool_py
onehorse32dev.upload.tool.default=esptool_py
onehorse32dev.upload.tool.network=esp_ota

onehorse32dev.upload.maximum_size=1310720
onehorse32dev.upload.maximum_data_size=327680
onehorse32dev.upload.flags=
onehorse32dev.upload.extra_flags=

onehorse32dev.serial.disableDTR=true
onehorse32dev.serial.disableRTS=true

onehorse32dev.build.tarch=xtensa
onehorse32dev.build.bootloader_addr=0x1000
onehorse32dev.build.target=esp32
onehorse32dev.build.mcu=esp32
onehorse32dev.build.core=esp32
onehorse32dev.build.variant=onehorse32dev
onehorse32dev.build.board=ONEHORSE_ESP32_DEV

onehorse32dev.build.f_cpu=240000000L
onehorse32dev.build.flash_mode=dout
onehorse32dev.build.flash_size=4MB
onehorse32dev.build.boot=dio
onehorse32dev.build.partitions=default
onehorse32dev.build.defines=

onehorse32dev.menu.FlashFreq.80=80MHz
onehorse32dev.menu.FlashFreq.80.build.flash_freq=80m
onehorse32dev.menu.FlashFreq.40=40MHz
onehorse32dev.menu.FlashFreq.40.build.flash_freq=40m

onehorse32dev.menu.UploadSpeed.921600=921600
onehorse32dev.menu.UploadSpeed.921600.upload.speed=921600
onehorse32dev.menu.UploadSpeed.115200=115200
onehorse32dev.menu.UploadSpeed.115200.upload.speed=115200
onehorse32dev.menu.UploadSpeed.256000.windows=256000
onehorse32dev.menu.UploadSpeed.256000.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400=230400
onehorse32dev.menu.UploadSpeed.230400.upload.speed=230400
onehorse32dev.menu.UploadSpeed.460800.linux=460800
onehorse32dev.menu.UploadSpeed.460800.macosx=460800
onehorse32dev.menu.UploadSpeed.460800.upload.speed=460800
onehorse32dev.menu.UploadSpeed.512000.windows=512000
onehorse32dev.menu.UploadSpeed.512000.upload.speed=512000

onehorse32dev.menu.DebugLevel.none=None
onehorse32dev.menu.DebugLevel.none.build.code_debug=0
onehorse32dev.menu.DebugLevel.error=Error
onehorse32dev.menu.DebugLevel.error.build.code_debug=1
onehorse32dev.menu.DebugLevel.warn=Warn
onehorse32dev.menu.DebugLevel.warn.build.code_debug=2
onehorse32dev.menu.DebugLevel.info=Info
onehorse32dev.menu.DebugLevel.info.build.code_debug=3
onehorse32dev.menu.DebugLevel.debug=Debug
onehorse32dev.menu.DebugLevel.debug.build.code_debug=4
onehorse32dev.menu.DebugLevel.verbose=Verbose
onehorse32dev.menu.DebugLevel.verbose.build.code_debug=5

onehorse32dev.menu.EraseFlash.none=Disabled
onehorse32dev.menu.EraseFlash.none.upload.erase_cmd=
onehorse32dev.menu.EraseFlash.all=Enabled
onehorse32dev.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Metro ESP32-S2

adafruit_metro_esp32s2.name=Adafruit Metro ESP32-S2
adafruit_metro_esp32s2.vid.0=0x239A
adafruit_metro_esp32s2.pid.0=0x80DF
adafruit_metro_esp32s2.vid.1=0x239A
adafruit_metro_esp32s2.pid.1=0x00DF
adafruit_metro_esp32s2.vid.2=0x239A
adafruit_metro_esp32s2.pid.2=0x80E0
adafruit_metro_esp32s2.upload_port.0.vid=0x239A
adafruit_metro_esp32s2.upload_port.0.pid=0x80DF
adafruit_metro_esp32s2.upload_port.1.vid=0x239A
adafruit_metro_esp32s2.upload_port.1.pid=0x00DF
adafruit_metro_esp32s2.upload_port.2.vid=0x239A
adafruit_metro_esp32s2.upload_port.2.pid=0x80E0

adafruit_metro_esp32s2.bootloader.tool=esptool_py
adafruit_metro_esp32s2.bootloader.tool.default=esptool_py

adafruit_metro_esp32s2.upload.tool=esptool_py
adafruit_metro_esp32s2.upload.tool.default=esptool_py
adafruit_metro_esp32s2.upload.tool.network=esp_ota

adafruit_metro_esp32s2.upload.maximum_size=1310720
adafruit_metro_esp32s2.upload.maximum_data_size=327680
adafruit_metro_esp32s2.upload.flags=
adafruit_metro_esp32s2.upload.extra_flags=
adafruit_metro_esp32s2.upload.use_1200bps_touch=true
adafruit_metro_esp32s2.upload.wait_for_upload_port=true

adafruit_metro_esp32s2.serial.disableDTR=false
adafruit_metro_esp32s2.serial.disableRTS=false

adafruit_metro_esp32s2.build.tarch=xtensa
adafruit_metro_esp32s2.build.bootloader_addr=0x1000
adafruit_metro_esp32s2.build.target=esp32s2
adafruit_metro_esp32s2.build.mcu=esp32s2
adafruit_metro_esp32s2.build.core=esp32
adafruit_metro_esp32s2.build.variant=adafruit_metro_esp32s2
adafruit_metro_esp32s2.build.board=METRO_ESP32S2

adafruit_metro_esp32s2.build.cdc_on_boot=1
adafruit_metro_esp32s2.build.msc_on_boot=0
adafruit_metro_esp32s2.build.dfu_on_boot=0
adafruit_metro_esp32s2.build.f_cpu=240000000L
adafruit_metro_esp32s2.build.flash_size=4MB
adafruit_metro_esp32s2.build.flash_freq=80m
adafruit_metro_esp32s2.build.flash_mode=dio
adafruit_metro_esp32s2.build.boot=qio
adafruit_metro_esp32s2.build.partitions=default
adafruit_metro_esp32s2.build.defines=

adafruit_metro_esp32s2.menu.CDCOnBoot.cdc=Enabled
adafruit_metro_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_metro_esp32s2.menu.CDCOnBoot.default=Disabled
adafruit_metro_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_metro_esp32s2.menu.MSCOnBoot.default=Disabled
adafruit_metro_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_metro_esp32s2.menu.MSCOnBoot.msc=Enabled
adafruit_metro_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_metro_esp32s2.menu.DFUOnBoot.default=Disabled
adafruit_metro_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_metro_esp32s2.menu.DFUOnBoot.dfu=Enabled
adafruit_metro_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_metro_esp32s2.menu.UploadMode.cdc=Internal USB
adafruit_metro_esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_metro_esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_metro_esp32s2.menu.UploadMode.default=UART0
adafruit_metro_esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_metro_esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_metro_esp32s2.menu.PSRAM.enabled=Enabled
adafruit_metro_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_metro_esp32s2.menu.PSRAM.disabled=Disabled
adafruit_metro_esp32s2.menu.PSRAM.disabled.build.defines=

