espressif/arduino-esp32/boards.txt
##############################################################
# Adafruit Metro ESP32-S3

adafruit_metro_esp32s3.name=Adafruit Metro ESP32-S3
adafruit_metro_esp32s3.vid.0=0x239A
adafruit_metro_esp32s3.pid.0=0x8145
adafruit_metro_esp32s3.vid.1=0x239A
adafruit_metro_esp32s3.pid.1=0x0145
adafruit_metro_esp32s3.vid.2=0x239A
adafruit_metro_esp32s3.pid.2=0x8146
adafruit_metro_esp32s3.upload_port.0.vid=0x239A
adafruit_metro_esp32s3.upload_port.0.pid=0x8145
adafruit_metro_esp32s3.upload_port.1.vid=0x239A
adafruit_metro_esp32s3.upload_port.1.pid=0x0145
adafruit_metro_esp32s3.upload_port.2.vid=0x239A
adafruit_metro_esp32s3.upload_port.2.pid=0x8146

adafruit_metro_esp32s3.bootloader.tool=esptool_py
adafruit_metro_esp32s3.bootloader.tool.default=esptool_py

adafruit_metro_esp32s3.upload.tool=esptool_py
adafruit_metro_esp32s3.upload.tool.default=esptool_py
adafruit_metro_esp32s3.upload.tool.network=esp_ota

adafruit_metro_esp32s3.upload.maximum_size=1310720
adafruit_metro_esp32s3.upload.maximum_data_size=327680
adafruit_metro_esp32s3.upload.flags=
adafruit_metro_esp32s3.upload.extra_flags=
adafruit_metro_esp32s3.upload.use_1200bps_touch=true
adafruit_metro_esp32s3.upload.wait_for_upload_port=true

adafruit_metro_esp32s3.serial.disableDTR=false
adafruit_metro_esp32s3.serial.disableRTS=false

adafruit_metro_esp32s3.build.tarch=xtensa
adafruit_metro_esp32s3.build.bootloader_addr=0x0
adafruit_metro_esp32s3.build.target=esp32s3
adafruit_metro_esp32s3.build.mcu=esp32s3
adafruit_metro_esp32s3.build.core=esp32
adafruit_metro_esp32s3.build.variant=adafruit_metro_esp32s3
adafruit_metro_esp32s3.build.board=METRO_ESP32S3

adafruit_metro_esp32s3.build.usb_mode=0
adafruit_metro_esp32s3.build.cdc_on_boot=1
adafruit_metro_esp32s3.build.msc_on_boot=0
adafruit_metro_esp32s3.build.dfu_on_boot=0
adafruit_metro_esp32s3.build.f_cpu=240000000L
adafruit_metro_esp32s3.build.flash_size=16MB
adafruit_metro_esp32s3.build.flash_freq=80m
adafruit_metro_esp32s3.build.flash_mode=dio
adafruit_metro_esp32s3.build.boot=qio
adafruit_metro_esp32s3.build.partitions=default
adafruit_metro_esp32s3.build.defines=
adafruit_metro_esp32s3.build.loop_core=
adafruit_metro_esp32s3.build.event_core=
adafruit_metro_esp32s3.build.flash_type=qio
adafruit_metro_esp32s3.build.psram_type=opi
adafruit_metro_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_metro_esp32s3.menu.LoopCore.1=Core 1
adafruit_metro_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_metro_esp32s3.menu.LoopCore.0=Core 0
adafruit_metro_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_metro_esp32s3.menu.EventsCore.1=Core 1
adafruit_metro_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_metro_esp32s3.menu.EventsCore.0=Core 0
adafruit_metro_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_metro_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_metro_esp32s3.menu.USBMode.default.build.usb_mode=0
adafruit_metro_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_metro_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_metro_esp32s3.menu.CDCOnBoot.cdc=Enabled
adafruit_metro_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_metro_esp32s3.menu.CDCOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_metro_esp32s3.menu.MSCOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_metro_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_metro_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_metro_esp32s3.menu.DFUOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_metro_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_metro_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_metro_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_metro_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_metro_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_metro_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_metro_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_metro_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_metro_esp32s3.menu.PSRAM.opi=OPI PSRAM
adafruit_metro_esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_metro_esp32s3.menu.PSRAM.opi.build.psram_type=opi
adafruit_metro_esp32s3.menu.PSRAM.disabled=Disabled
adafruit_metro_esp32s3.menu.PSRAM.disabled.build.defines=
adafruit_metro_esp32s3.menu.PSRAM.disabled.build.psram_type=opi

adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2=TinyUF2 16MB (2MB APP/11.6MB FATFS)
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.build.partitions=tinyuf2-partitions-16MB
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota=TinyUF2 16MB No OTA(4MB APP/11.6MB FATFS)
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.build.custom_bootloader=bootloader-tinyuf2
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.build.partitions=tinyuf2-partitions-16MB-noota
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.upload.maximum_size=4194304
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_metro_esp32s3.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
adafruit_metro_esp32s3.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
adafruit_metro_esp32s3.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
adafruit_metro_esp32s3.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/6.93MB SPIFFS)
adafruit_metro_esp32s3.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
adafruit_metro_esp32s3.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592
adafruit_metro_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
adafruit_metro_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
adafruit_metro_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
adafruit_metro_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
adafruit_metro_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
adafruit_metro_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

adafruit_metro_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
adafruit_metro_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_metro_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
adafruit_metro_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_metro_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
adafruit_metro_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_metro_esp32s3.menu.CPUFreq.40=40MHz
adafruit_metro_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_metro_esp32s3.menu.CPUFreq.20=20MHz
adafruit_metro_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_metro_esp32s3.menu.CPUFreq.10=10MHz
adafruit_metro_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

