espressif/arduino-esp32/boards.txt
adafruit_metro_esp32s3.menu.FlashMode.qio=QIO 80MHz
adafruit_metro_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
adafruit_metro_esp32s3.menu.FlashMode.qio.build.boot=qio
adafruit_metro_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.qio120=QIO 120MHz
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.boot=qio
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.dio=DIO 80MHz
adafruit_metro_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
adafruit_metro_esp32s3.menu.FlashMode.dio.build.boot=dio
adafruit_metro_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.opi=OPI 80MHz
adafruit_metro_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
adafruit_metro_esp32s3.menu.FlashMode.opi.build.boot=opi
adafruit_metro_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.opi.build.flash_freq=80m

adafruit_metro_esp32s3.menu.FlashSize.16M=16MB (128Mb)
adafruit_metro_esp32s3.menu.FlashSize.16M.build.flash_size=16MB

adafruit_metro_esp32s3.menu.UploadSpeed.921600=921600
adafruit_metro_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
adafruit_metro_esp32s3.menu.UploadSpeed.115200=115200
adafruit_metro_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
adafruit_metro_esp32s3.menu.UploadSpeed.256000.windows=256000
adafruit_metro_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
adafruit_metro_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_metro_esp32s3.menu.UploadSpeed.230400=230400
adafruit_metro_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
adafruit_metro_esp32s3.menu.UploadSpeed.460800.linux=460800
adafruit_metro_esp32s3.menu.UploadSpeed.460800.macosx=460800
adafruit_metro_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
adafruit_metro_esp32s3.menu.UploadSpeed.512000.windows=512000
adafruit_metro_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

adafruit_metro_esp32s3.menu.DebugLevel.none=None
adafruit_metro_esp32s3.menu.DebugLevel.none.build.code_debug=0
adafruit_metro_esp32s3.menu.DebugLevel.error=Error
adafruit_metro_esp32s3.menu.DebugLevel.error.build.code_debug=1
adafruit_metro_esp32s3.menu.DebugLevel.warn=Warn
adafruit_metro_esp32s3.menu.DebugLevel.warn.build.code_debug=2
adafruit_metro_esp32s3.menu.DebugLevel.info=Info
adafruit_metro_esp32s3.menu.DebugLevel.info.build.code_debug=3
adafruit_metro_esp32s3.menu.DebugLevel.debug=Debug
adafruit_metro_esp32s3.menu.DebugLevel.debug.build.code_debug=4
adafruit_metro_esp32s3.menu.DebugLevel.verbose=Verbose
adafruit_metro_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

adafruit_metro_esp32s3.menu.EraseFlash.none=Disabled
adafruit_metro_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
adafruit_metro_esp32s3.menu.EraseFlash.all=Enabled
adafruit_metro_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_metro_esp32s3.menu.ZigbeeMode.default=Disabled
adafruit_metro_esp32s3.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_metro_esp32s3.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_metro_esp32s3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_metro_esp32s3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_metro_esp32s3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
# Adafruit MagTag 2.9"

adafruit_magtag29_esp32s2.name=Adafruit MagTag 2.9"
adafruit_magtag29_esp32s2.vid.0=0x239A
adafruit_magtag29_esp32s2.pid.0=0x80E5
adafruit_magtag29_esp32s2.vid.1=0x239A
adafruit_magtag29_esp32s2.pid.1=0x00E5
adafruit_magtag29_esp32s2.vid.2=0x239A
adafruit_magtag29_esp32s2.pid.2=0x80E6
adafruit_magtag29_esp32s2.upload_port.0.vid=0x239A
adafruit_magtag29_esp32s2.upload_port.0.pid=0x80E5
adafruit_magtag29_esp32s2.upload_port.1.vid=0x239A
adafruit_magtag29_esp32s2.upload_port.1.pid=0x00E5
adafruit_magtag29_esp32s2.upload_port.2.vid=0x239A
adafruit_magtag29_esp32s2.upload_port.2.pid=0x80E6

adafruit_magtag29_esp32s2.bootloader.tool=esptool_py
adafruit_magtag29_esp32s2.bootloader.tool.default=esptool_py

adafruit_magtag29_esp32s2.upload.tool=esptool_py
adafruit_magtag29_esp32s2.upload.tool.default=esptool_py
adafruit_magtag29_esp32s2.upload.tool.network=esp_ota

adafruit_magtag29_esp32s2.upload.maximum_size=1310720
adafruit_magtag29_esp32s2.upload.maximum_data_size=327680
adafruit_magtag29_esp32s2.upload.flags=
adafruit_magtag29_esp32s2.upload.extra_flags=
adafruit_magtag29_esp32s2.upload.use_1200bps_touch=true
adafruit_magtag29_esp32s2.upload.wait_for_upload_port=true

adafruit_magtag29_esp32s2.serial.disableDTR=false
adafruit_magtag29_esp32s2.serial.disableRTS=false

adafruit_magtag29_esp32s2.build.tarch=xtensa
adafruit_magtag29_esp32s2.build.bootloader_addr=0x1000
adafruit_magtag29_esp32s2.build.target=esp32s2
adafruit_magtag29_esp32s2.build.mcu=esp32s2
adafruit_magtag29_esp32s2.build.core=esp32
adafruit_magtag29_esp32s2.build.variant=adafruit_magtag29_esp32s2
adafruit_magtag29_esp32s2.build.board=MAGTAG29_ESP32S2

adafruit_magtag29_esp32s2.build.cdc_on_boot=1
adafruit_magtag29_esp32s2.build.msc_on_boot=0
adafruit_magtag29_esp32s2.build.dfu_on_boot=0
adafruit_magtag29_esp32s2.build.f_cpu=240000000L
adafruit_magtag29_esp32s2.build.flash_size=4MB
adafruit_magtag29_esp32s2.build.flash_freq=80m
adafruit_magtag29_esp32s2.build.flash_mode=dio
adafruit_magtag29_esp32s2.build.boot=qio
adafruit_magtag29_esp32s2.build.partitions=default
adafruit_magtag29_esp32s2.build.defines=

adafruit_magtag29_esp32s2.menu.CDCOnBoot.cdc=Enabled
adafruit_magtag29_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_magtag29_esp32s2.menu.CDCOnBoot.default=Disabled
adafruit_magtag29_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0

