espressif/arduino-esp32/boards.txt
adafruit_magtag29_esp32s2.menu.MSCOnBoot.default=Disabled
adafruit_magtag29_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_magtag29_esp32s2.menu.MSCOnBoot.msc=Enabled
adafruit_magtag29_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_magtag29_esp32s2.menu.DFUOnBoot.default=Disabled
adafruit_magtag29_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_magtag29_esp32s2.menu.DFUOnBoot.dfu=Enabled
adafruit_magtag29_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_magtag29_esp32s2.menu.UploadMode.cdc=Internal USB
adafruit_magtag29_esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_magtag29_esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_magtag29_esp32s2.menu.UploadMode.default=UART0
adafruit_magtag29_esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_magtag29_esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_magtag29_esp32s2.menu.PSRAM.enabled=Enabled
adafruit_magtag29_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_magtag29_esp32s2.menu.PSRAM.disabled=Disabled
adafruit_magtag29_esp32s2.menu.PSRAM.disabled.build.defines=

adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2.build.partitions=tinyuf2-partitions-4MB
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2_noota=TinyUF2 4MB No OTA (2.7MB APP/960KB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2_noota.build.custom_bootloader=bootloader-tinyuf2
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2_noota.build.partitions=tinyuf2-partitions-4MB-noota
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2_noota.upload.maximum_size=2883584
adafruit_magtag29_esp32s2.menu.PartitionScheme.tinyuf2_noota.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_magtag29_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.default.build.partitions=default
adafruit_magtag29_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_magtag29_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_magtag29_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_magtag29_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_magtag29_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_magtag29_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_magtag29_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_magtag29_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_magtag29_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_magtag29_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_magtag29_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_magtag29_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_magtag29_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.40=40MHz
adafruit_magtag29_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.20=20MHz
adafruit_magtag29_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_magtag29_esp32s2.menu.CPUFreq.10=10MHz
adafruit_magtag29_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_magtag29_esp32s2.menu.FlashMode.qio=QIO
adafruit_magtag29_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_magtag29_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_magtag29_esp32s2.menu.FlashMode.dio=DIO
adafruit_magtag29_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_magtag29_esp32s2.menu.FlashMode.dio.build.boot=dio

adafruit_magtag29_esp32s2.menu.FlashFreq.80=80MHz
adafruit_magtag29_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_magtag29_esp32s2.menu.FlashFreq.40=40MHz
adafruit_magtag29_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_magtag29_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_magtag29_esp32s2.menu.FlashSize.4M.build.flash_size=4MB

adafruit_magtag29_esp32s2.menu.UploadSpeed.921600=921600
adafruit_magtag29_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_magtag29_esp32s2.menu.UploadSpeed.115200=115200
adafruit_magtag29_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_magtag29_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_magtag29_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_magtag29_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_magtag29_esp32s2.menu.UploadSpeed.230400=230400
adafruit_magtag29_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_magtag29_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_magtag29_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_magtag29_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_magtag29_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_magtag29_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_magtag29_esp32s2.menu.DebugLevel.none=None
adafruit_magtag29_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_magtag29_esp32s2.menu.DebugLevel.error=Error
adafruit_magtag29_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_magtag29_esp32s2.menu.DebugLevel.warn=Warn
adafruit_magtag29_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_magtag29_esp32s2.menu.DebugLevel.info=Info
adafruit_magtag29_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_magtag29_esp32s2.menu.DebugLevel.debug=Debug
adafruit_magtag29_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_magtag29_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_magtag29_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

