espressif/arduino-esp32/boards.txt
adafruit_feather_esp32s2_tft.menu.FlashSize.4M=4MB (32Mb)
adafruit_feather_esp32s2_tft.menu.FlashSize.4M.build.flash_size=4MB

adafruit_feather_esp32s2_tft.menu.UploadSpeed.921600=921600
adafruit_feather_esp32s2_tft.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32s2_tft.menu.UploadSpeed.115200=115200
adafruit_feather_esp32s2_tft.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32s2_tft.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32s2_tft.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32s2_tft.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32s2_tft.menu.UploadSpeed.230400=230400
adafruit_feather_esp32s2_tft.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32s2_tft.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32s2_tft.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32s2_tft.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32s2_tft.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32s2_tft.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32s2_tft.menu.DebugLevel.none=None
adafruit_feather_esp32s2_tft.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s2_tft.menu.DebugLevel.error=Error
adafruit_feather_esp32s2_tft.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s2_tft.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s2_tft.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s2_tft.menu.DebugLevel.info=Info
adafruit_feather_esp32s2_tft.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s2_tft.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s2_tft.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s2_tft.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s2_tft.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s2_tft.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s2_tft.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s2_tft.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s2_tft.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_feather_esp32s2_tft.menu.ZigbeeMode.default=Disabled
adafruit_feather_esp32s2_tft.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_feather_esp32s2_tft.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_feather_esp32s2_tft.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_feather_esp32s2_tft.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_feather_esp32s2_tft.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
# Adafruit Feather ESP32-S2 Reverse TFT

adafruit_feather_esp32s2_reversetft.name=Adafruit Feather ESP32-S2 Reverse TFT
adafruit_feather_esp32s2_reversetft.vid.0=0x239A
adafruit_feather_esp32s2_reversetft.pid.0=0x80ED
adafruit_feather_esp32s2_reversetft.vid.1=0x239A
adafruit_feather_esp32s2_reversetft.pid.1=0x00ED
adafruit_feather_esp32s2_reversetft.vid.2=0x239A
adafruit_feather_esp32s2_reversetft.pid.2=0x80EE
adafruit_feather_esp32s2_reversetft.upload_port.0.vid=0x239A
adafruit_feather_esp32s2_reversetft.upload_port.0.pid=0x80ED
adafruit_feather_esp32s2_reversetft.upload_port.1.vid=0x239A
adafruit_feather_esp32s2_reversetft.upload_port.1.pid=0x00ED
adafruit_feather_esp32s2_reversetft.upload_port.2.vid=0x239A
adafruit_feather_esp32s2_reversetft.upload_port.2.pid=0x80EE

adafruit_feather_esp32s2_reversetft.bootloader.tool=esptool_py
adafruit_feather_esp32s2_reversetft.bootloader.tool.default=esptool_py

adafruit_feather_esp32s2_reversetft.upload.tool=esptool_py
adafruit_feather_esp32s2_reversetft.upload.tool.default=esptool_py
adafruit_feather_esp32s2_reversetft.upload.tool.network=esp_ota

adafruit_feather_esp32s2_reversetft.upload.maximum_size=1310720
adafruit_feather_esp32s2_reversetft.upload.maximum_data_size=327680
adafruit_feather_esp32s2_reversetft.upload.flags=
adafruit_feather_esp32s2_reversetft.upload.extra_flags=
adafruit_feather_esp32s2_reversetft.upload.use_1200bps_touch=true
adafruit_feather_esp32s2_reversetft.upload.wait_for_upload_port=true

adafruit_feather_esp32s2_reversetft.serial.disableDTR=false
adafruit_feather_esp32s2_reversetft.serial.disableRTS=false

adafruit_feather_esp32s2_reversetft.build.tarch=xtensa
adafruit_feather_esp32s2_reversetft.build.bootloader_addr=0x1000
adafruit_feather_esp32s2_reversetft.build.target=esp32s2
adafruit_feather_esp32s2_reversetft.build.mcu=esp32s2
adafruit_feather_esp32s2_reversetft.build.core=esp32
adafruit_feather_esp32s2_reversetft.build.variant=adafruit_feather_esp32s2_reversetft
adafruit_feather_esp32s2_reversetft.build.board=ADAFRUIT_FEATHER_ESP32S2_REVTFT

adafruit_feather_esp32s2_reversetft.build.cdc_on_boot=1
adafruit_feather_esp32s2_reversetft.build.msc_on_boot=0
adafruit_feather_esp32s2_reversetft.build.dfu_on_boot=0
adafruit_feather_esp32s2_reversetft.build.f_cpu=240000000L
adafruit_feather_esp32s2_reversetft.build.flash_size=4MB
adafruit_feather_esp32s2_reversetft.build.flash_freq=80m
adafruit_feather_esp32s2_reversetft.build.flash_mode=dio
adafruit_feather_esp32s2_reversetft.build.boot=qio
adafruit_feather_esp32s2_reversetft.build.partitions=default
adafruit_feather_esp32s2_reversetft.build.defines=

adafruit_feather_esp32s2_reversetft.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s2_reversetft.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s2_reversetft.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s2_reversetft.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s2_reversetft.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s2_reversetft.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s2_reversetft.menu.MSCOnBoot.msc=Enabled
adafruit_feather_esp32s2_reversetft.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s2_reversetft.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s2_reversetft.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s2_reversetft.menu.DFUOnBoot.dfu=Enabled
adafruit_feather_esp32s2_reversetft.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s2_reversetft.menu.UploadMode.cdc=Internal USB
adafruit_feather_esp32s2_reversetft.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_feather_esp32s2_reversetft.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_feather_esp32s2_reversetft.menu.UploadMode.default=UART0
adafruit_feather_esp32s2_reversetft.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_feather_esp32s2_reversetft.menu.UploadMode.default.upload.wait_for_upload_port=false

