espressif/arduino-esp32/boards.txt
adafruit_feather_esp32c6.menu.DebugLevel.none=None
adafruit_feather_esp32c6.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32c6.menu.DebugLevel.error=Error
adafruit_feather_esp32c6.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32c6.menu.DebugLevel.warn=Warn
adafruit_feather_esp32c6.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32c6.menu.DebugLevel.info=Info
adafruit_feather_esp32c6.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32c6.menu.DebugLevel.debug=Debug
adafruit_feather_esp32c6.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32c6.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32c6.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32c6.menu.EraseFlash.none=Disabled
adafruit_feather_esp32c6.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32c6.menu.EraseFlash.all=Enabled
adafruit_feather_esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_feather_esp32c6.menu.ZigbeeMode.default=Disabled
adafruit_feather_esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_feather_esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_feather_esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
adafruit_feather_esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
adafruit_feather_esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
adafruit_feather_esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_feather_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_feather_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################
# Adafruit QT Py ESP32

adafruit_qtpy_esp32_pico.name=Adafruit QT Py ESP32

adafruit_qtpy_esp32_pico.bootloader.tool=esptool_py
adafruit_qtpy_esp32_pico.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32_pico.upload.tool=esptool_py
adafruit_qtpy_esp32_pico.upload.tool.default=esptool_py
adafruit_qtpy_esp32_pico.upload.tool.network=esp_ota

adafruit_qtpy_esp32_pico.upload.maximum_size=1310720
adafruit_qtpy_esp32_pico.upload.maximum_data_size=327680
adafruit_qtpy_esp32_pico.upload.flags=
adafruit_qtpy_esp32_pico.upload.extra_flags=

adafruit_qtpy_esp32_pico.serial.disableDTR=true
adafruit_qtpy_esp32_pico.serial.disableRTS=true

adafruit_qtpy_esp32_pico.build.tarch=xtensa
adafruit_qtpy_esp32_pico.build.bootloader_addr=0x1000
adafruit_qtpy_esp32_pico.build.target=esp32
adafruit_qtpy_esp32_pico.build.mcu=esp32
adafruit_qtpy_esp32_pico.build.core=esp32
adafruit_qtpy_esp32_pico.build.variant=adafruit_qtpy_esp32
adafruit_qtpy_esp32_pico.build.board=ADAFRUIT_QTPY_ESP32_PICO

adafruit_qtpy_esp32_pico.build.f_cpu=240000000L
adafruit_qtpy_esp32_pico.build.flash_size=8MB
adafruit_qtpy_esp32_pico.build.flash_freq=80m
adafruit_qtpy_esp32_pico.build.flash_mode=dio
adafruit_qtpy_esp32_pico.build.boot=dio
adafruit_qtpy_esp32_pico.build.partitions=default
adafruit_qtpy_esp32_pico.build.defines=
adafruit_qtpy_esp32_pico.build.loop_core=
adafruit_qtpy_esp32_pico.build.event_core=

adafruit_qtpy_esp32_pico.menu.LoopCore.1=Core 1
adafruit_qtpy_esp32_pico.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_qtpy_esp32_pico.menu.LoopCore.0=Core 0
adafruit_qtpy_esp32_pico.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_qtpy_esp32_pico.menu.EventsCore.1=Core 1
adafruit_qtpy_esp32_pico.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_qtpy_esp32_pico.menu.EventsCore.0=Core 0
adafruit_qtpy_esp32_pico.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_qtpy_esp32_pico.menu.PSRAM.enabled=Enabled
adafruit_qtpy_esp32_pico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled=Disabled
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled.build.defines=

adafruit_qtpy_esp32_pico.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32_pico.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_qtpy_esp32_pico.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
adafruit_qtpy_esp32_pico.menu.PartitionScheme.large_spiffs_8MB=Large SPIFFS (1.2MB APP / 5.3MB SPIFFS)
adafruit_qtpy_esp32_pico.menu.PartitionScheme.large_spiffs_8MB.build.partitions=large_spiffs_8MB
adafruit_qtpy_esp32_pico.menu.PartitionScheme.large_spiffs_8MB.upload.maximum_size=1310720

adafruit_qtpy_esp32_pico.menu.CPUFreq.240=240MHz (WiFi/BT)
adafruit_qtpy_esp32_pico.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.160=160MHz (WiFi/BT)
adafruit_qtpy_esp32_pico.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.80=80MHz (WiFi/BT)
adafruit_qtpy_esp32_pico.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32_pico.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32_pico.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32_pico.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32_pico.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32_pico.menu.FlashFreq.80=80MHz
adafruit_qtpy_esp32_pico.menu.FlashFreq.80.build.flash_freq=80m
adafruit_qtpy_esp32_pico.menu.FlashFreq.40=40MHz
adafruit_qtpy_esp32_pico.menu.FlashFreq.40.build.flash_freq=40m

adafruit_qtpy_esp32_pico.menu.FlashSize.8M=8MB (64Mb)
adafruit_qtpy_esp32_pico.menu.FlashSize.8M.build.flash_size=8MB

adafruit_qtpy_esp32_pico.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32_pico.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32_pico.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32_pico.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32_pico.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.512000.upload.speed=512000

