espressif/arduino-esp32/boards.txt
adafruit_qtpy_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_qtpy_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_qtpy_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_qtpy_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32s2.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32s2.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32s2.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32s2.menu.FlashMode.qio=QIO
adafruit_qtpy_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_qtpy_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_qtpy_esp32s2.menu.FlashMode.dio=DIO
adafruit_qtpy_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_qtpy_esp32s2.menu.FlashMode.dio.build.boot=dio

adafruit_qtpy_esp32s2.menu.FlashFreq.80=80MHz
adafruit_qtpy_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_qtpy_esp32s2.menu.FlashFreq.40=40MHz
adafruit_qtpy_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_qtpy_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_qtpy_esp32s2.menu.FlashSize.4M.build.flash_size=4MB

adafruit_qtpy_esp32s2.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32s2.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32s2.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32s2.menu.DebugLevel.none=None
adafruit_qtpy_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32s2.menu.DebugLevel.error=Error
adafruit_qtpy_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32s2.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32s2.menu.DebugLevel.info=Info
adafruit_qtpy_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32s2.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

adafruit_qtpy_esp32s2.menu.EraseFlash.none=Disabled
adafruit_qtpy_esp32s2.menu.EraseFlash.none.upload.erase_cmd=
adafruit_qtpy_esp32s2.menu.EraseFlash.all=Enabled
adafruit_qtpy_esp32s2.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_qtpy_esp32s2.menu.ZigbeeMode.default=Disabled
adafruit_qtpy_esp32s2.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_qtpy_esp32s2.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_qtpy_esp32s2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_qtpy_esp32s2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_qtpy_esp32s2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
# Adafruit QT Py ESP32-S3 No PSRAM

adafruit_qtpy_esp32s3_nopsram.name=Adafruit QT Py ESP32-S3 No PSRAM
adafruit_qtpy_esp32s3_nopsram.vid.0=0x239A
adafruit_qtpy_esp32s3_nopsram.pid.0=0x8119
adafruit_qtpy_esp32s3_nopsram.vid.1=0x239A
adafruit_qtpy_esp32s3_nopsram.pid.1=0x0119
adafruit_qtpy_esp32s3_nopsram.vid.2=0x239A
adafruit_qtpy_esp32s3_nopsram.pid.2=0x811A
adafruit_qtpy_esp32s3_nopsram.upload_port.0.vid=0x239A
adafruit_qtpy_esp32s3_nopsram.upload_port.0.pid=0x8119
adafruit_qtpy_esp32s3_nopsram.upload_port.1.vid=0x239A
adafruit_qtpy_esp32s3_nopsram.upload_port.1.pid=0x0119
adafruit_qtpy_esp32s3_nopsram.upload_port.2.vid=0x239A
adafruit_qtpy_esp32s3_nopsram.upload_port.2.pid=0x811A

adafruit_qtpy_esp32s3_nopsram.bootloader.tool=esptool_py
adafruit_qtpy_esp32s3_nopsram.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32s3_nopsram.upload.tool=esptool_py
adafruit_qtpy_esp32s3_nopsram.upload.tool.default=esptool_py
adafruit_qtpy_esp32s3_nopsram.upload.tool.network=esp_ota

adafruit_qtpy_esp32s3_nopsram.upload.maximum_size=1310720
adafruit_qtpy_esp32s3_nopsram.upload.maximum_data_size=327680
adafruit_qtpy_esp32s3_nopsram.upload.flags=
adafruit_qtpy_esp32s3_nopsram.upload.extra_flags=
adafruit_qtpy_esp32s3_nopsram.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_nopsram.upload.wait_for_upload_port=true

adafruit_qtpy_esp32s3_nopsram.serial.disableDTR=false
adafruit_qtpy_esp32s3_nopsram.serial.disableRTS=false

adafruit_qtpy_esp32s3_nopsram.build.tarch=xtensa
adafruit_qtpy_esp32s3_nopsram.build.bootloader_addr=0x0
adafruit_qtpy_esp32s3_nopsram.build.target=esp32s3
adafruit_qtpy_esp32s3_nopsram.build.mcu=esp32s3
adafruit_qtpy_esp32s3_nopsram.build.core=esp32
adafruit_qtpy_esp32s3_nopsram.build.variant=adafruit_qtpy_esp32s3_nopsram
adafruit_qtpy_esp32s3_nopsram.build.board=ADAFRUIT_QTPY_ESP32S3_NOPSRAM

adafruit_qtpy_esp32s3_nopsram.build.usb_mode=0
adafruit_qtpy_esp32s3_nopsram.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_nopsram.build.msc_on_boot=0
adafruit_qtpy_esp32s3_nopsram.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_nopsram.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_nopsram.build.flash_size=8MB
adafruit_qtpy_esp32s3_nopsram.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.build.boot=qio
adafruit_qtpy_esp32s3_nopsram.build.partitions=default
adafruit_qtpy_esp32s3_nopsram.build.defines=
adafruit_qtpy_esp32s3_nopsram.build.loop_core=
adafruit_qtpy_esp32s3_nopsram.build.event_core=
adafruit_qtpy_esp32s3_nopsram.build.flash_type=qio
adafruit_qtpy_esp32s3_nopsram.build.psram_type=qspi
adafruit_qtpy_esp32s3_nopsram.build.memory_type={build.flash_type}_{build.psram_type}

