espressif/arduino-esp32/boards.txt
adafruit_itsybitsy_esp32.menu.FlashFreq.80=80MHz
adafruit_itsybitsy_esp32.menu.FlashFreq.80.build.flash_freq=80m
adafruit_itsybitsy_esp32.menu.FlashFreq.40=40MHz
adafruit_itsybitsy_esp32.menu.FlashFreq.40.build.flash_freq=40m

adafruit_itsybitsy_esp32.menu.FlashSize.8M=8MB (64Mb)
adafruit_itsybitsy_esp32.menu.FlashSize.8M.build.flash_size=8MB

adafruit_itsybitsy_esp32.menu.UploadSpeed.921600=921600
adafruit_itsybitsy_esp32.menu.UploadSpeed.921600.upload.speed=921600
adafruit_itsybitsy_esp32.menu.UploadSpeed.115200=115200
adafruit_itsybitsy_esp32.menu.UploadSpeed.115200.upload.speed=115200
adafruit_itsybitsy_esp32.menu.UploadSpeed.256000.windows=256000
adafruit_itsybitsy_esp32.menu.UploadSpeed.256000.upload.speed=256000
adafruit_itsybitsy_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_itsybitsy_esp32.menu.UploadSpeed.230400=230400
adafruit_itsybitsy_esp32.menu.UploadSpeed.230400.upload.speed=230400
adafruit_itsybitsy_esp32.menu.UploadSpeed.460800.linux=460800
adafruit_itsybitsy_esp32.menu.UploadSpeed.460800.macosx=460800
adafruit_itsybitsy_esp32.menu.UploadSpeed.460800.upload.speed=460800
adafruit_itsybitsy_esp32.menu.UploadSpeed.512000.windows=512000
adafruit_itsybitsy_esp32.menu.UploadSpeed.512000.upload.speed=512000

adafruit_itsybitsy_esp32.menu.DebugLevel.none=None
adafruit_itsybitsy_esp32.menu.DebugLevel.none.build.code_debug=0
adafruit_itsybitsy_esp32.menu.DebugLevel.error=Error
adafruit_itsybitsy_esp32.menu.DebugLevel.error.build.code_debug=1
adafruit_itsybitsy_esp32.menu.DebugLevel.warn=Warn
adafruit_itsybitsy_esp32.menu.DebugLevel.warn.build.code_debug=2
adafruit_itsybitsy_esp32.menu.DebugLevel.info=Info
adafruit_itsybitsy_esp32.menu.DebugLevel.info.build.code_debug=3
adafruit_itsybitsy_esp32.menu.DebugLevel.debug=Debug
adafruit_itsybitsy_esp32.menu.DebugLevel.debug.build.code_debug=4
adafruit_itsybitsy_esp32.menu.DebugLevel.verbose=Verbose
adafruit_itsybitsy_esp32.menu.DebugLevel.verbose.build.code_debug=5

adafruit_itsybitsy_esp32.menu.EraseFlash.none=Disabled
adafruit_itsybitsy_esp32.menu.EraseFlash.none.upload.erase_cmd=
adafruit_itsybitsy_esp32.menu.EraseFlash.all=Enabled
adafruit_itsybitsy_esp32.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_itsybitsy_esp32.menu.ZigbeeMode.default=Disabled
adafruit_itsybitsy_esp32.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_itsybitsy_esp32.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_itsybitsy_esp32.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_itsybitsy_esp32.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_itsybitsy_esp32.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
# Adafruit MatrixPortal ESP32-S3

adafruit_matrixportal_esp32s3.name=Adafruit MatrixPortal ESP32-S3
adafruit_matrixportal_esp32s3.vid.0=0x239A
adafruit_matrixportal_esp32s3.pid.0=0x8125
adafruit_matrixportal_esp32s3.vid.1=0x239A
adafruit_matrixportal_esp32s3.pid.1=0x0125
adafruit_matrixportal_esp32s3.vid.2=0x239A
adafruit_matrixportal_esp32s3.pid.2=0x8126
adafruit_matrixportal_esp32s3.upload_port.0.vid=0x239A
adafruit_matrixportal_esp32s3.upload_port.0.pid=0x8125
adafruit_matrixportal_esp32s3.upload_port.1.vid=0x239A
adafruit_matrixportal_esp32s3.upload_port.1.pid=0x0125
adafruit_matrixportal_esp32s3.upload_port.2.vid=0x239A
adafruit_matrixportal_esp32s3.upload_port.2.pid=0x8126

adafruit_matrixportal_esp32s3.bootloader.tool=esptool_py
adafruit_matrixportal_esp32s3.bootloader.tool.default=esptool_py

adafruit_matrixportal_esp32s3.upload.tool=esptool_py
adafruit_matrixportal_esp32s3.upload.tool.default=esptool_py
adafruit_matrixportal_esp32s3.upload.tool.network=esp_ota

adafruit_matrixportal_esp32s3.upload.maximum_size=1310720
adafruit_matrixportal_esp32s3.upload.maximum_data_size=327680
adafruit_matrixportal_esp32s3.upload.flags=
adafruit_matrixportal_esp32s3.upload.extra_flags=
adafruit_matrixportal_esp32s3.upload.use_1200bps_touch=true
adafruit_matrixportal_esp32s3.upload.wait_for_upload_port=true

adafruit_matrixportal_esp32s3.serial.disableDTR=false
adafruit_matrixportal_esp32s3.serial.disableRTS=false

adafruit_matrixportal_esp32s3.build.tarch=xtensa
adafruit_matrixportal_esp32s3.build.bootloader_addr=0x0
adafruit_matrixportal_esp32s3.build.target=esp32s3
adafruit_matrixportal_esp32s3.build.mcu=esp32s3
adafruit_matrixportal_esp32s3.build.core=esp32
adafruit_matrixportal_esp32s3.build.variant=adafruit_matrixportal_esp32s3
adafruit_matrixportal_esp32s3.build.board=ADAFRUIT_MATRIXPORTAL_ESP32S3

adafruit_matrixportal_esp32s3.build.usb_mode=0
adafruit_matrixportal_esp32s3.build.cdc_on_boot=1
adafruit_matrixportal_esp32s3.build.msc_on_boot=0
adafruit_matrixportal_esp32s3.build.dfu_on_boot=0
adafruit_matrixportal_esp32s3.build.f_cpu=240000000L
adafruit_matrixportal_esp32s3.build.flash_size=8MB
adafruit_matrixportal_esp32s3.build.flash_freq=80m
adafruit_matrixportal_esp32s3.build.flash_mode=dio
adafruit_matrixportal_esp32s3.build.boot=qio
adafruit_matrixportal_esp32s3.build.partitions=default
adafruit_matrixportal_esp32s3.build.defines=
adafruit_matrixportal_esp32s3.build.loop_core=
adafruit_matrixportal_esp32s3.build.event_core=
adafruit_matrixportal_esp32s3.build.flash_type=qio
adafruit_matrixportal_esp32s3.build.psram_type=qspi
adafruit_matrixportal_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_matrixportal_esp32s3.menu.LoopCore.1=Core 1
adafruit_matrixportal_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_matrixportal_esp32s3.menu.LoopCore.0=Core 0
adafruit_matrixportal_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_matrixportal_esp32s3.menu.EventsCore.1=Core 1
adafruit_matrixportal_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_matrixportal_esp32s3.menu.EventsCore.0=Core 0
adafruit_matrixportal_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_matrixportal_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_matrixportal_esp32s3.menu.USBMode.default.build.usb_mode=0
adafruit_matrixportal_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_matrixportal_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_matrixportal_esp32s3.menu.CDCOnBoot.cdc=Enabled
adafruit_matrixportal_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_matrixportal_esp32s3.menu.CDCOnBoot.default=Disabled
adafruit_matrixportal_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

