espressif/arduino-esp32/boards.txt
sparklemotionmini.menu.EraseFlash.none=Disabled
sparklemotionmini.menu.EraseFlash.none.upload.erase_cmd=
sparklemotionmini.menu.EraseFlash.all=Enabled
sparklemotionmini.menu.EraseFlash.all.upload.erase_cmd=-e

sparklemotionmini.menu.ZigbeeMode.default=Disabled
sparklemotionmini.menu.ZigbeeMode.default.build.zigbee_mode=
sparklemotionmini.menu.ZigbeeMode.default.build.zigbee_libs=
sparklemotionmini.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
sparklemotionmini.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
sparklemotionmini.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
# Adafruit Sparkle Motion Stick w/ESP32

sparklemotionstick.name=Adafruit Sparkle Motion Stick (ESP32)

sparklemotionstick.bootloader.tool=esptool_py
sparklemotionstick.bootloader.tool.default=esptool_py

sparklemotionstick.upload.tool=esptool_py
sparklemotionstick.upload.tool.default=esptool_py
sparklemotionstick.upload.tool.network=esp_ota

sparklemotionstick.upload.maximum_size=1310720
sparklemotionstick.upload.maximum_data_size=327680
sparklemotionstick.upload.flags=
sparklemotionstick.upload.extra_flags=

sparklemotionstick.serial.disableDTR=true
sparklemotionstick.serial.disableRTS=true

sparklemotionstick.build.tarch=xtensa
sparklemotionstick.build.bootloader_addr=0x1000
sparklemotionstick.build.target=esp32
sparklemotionstick.build.mcu=esp32
sparklemotionstick.build.core=esp32
sparklemotionstick.build.variant=adafruit_sparklemotionstick_esp32
sparklemotionstick.build.board=SPARKLEMOTIONSTICK_ESP32

sparklemotionstick.build.f_cpu=240000000L
sparklemotionstick.build.flash_size=4MB
sparklemotionstick.build.flash_freq=80m
sparklemotionstick.build.flash_mode=dio
sparklemotionstick.build.boot=dio
sparklemotionstick.build.partitions=default
sparklemotionstick.build.defines=
sparklemotionstick.build.loop_core=
sparklemotionstick.build.event_core=

sparklemotionstick.menu.LoopCore.1=Core 1
sparklemotionstick.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
sparklemotionstick.menu.LoopCore.0=Core 0
sparklemotionstick.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

sparklemotionstick.menu.EventsCore.1=Core 1
sparklemotionstick.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
sparklemotionstick.menu.EventsCore.0=Core 0
sparklemotionstick.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

sparklemotionstick.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
sparklemotionstick.menu.PartitionScheme.default.build.partitions=default
sparklemotionstick.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
sparklemotionstick.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
sparklemotionstick.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
sparklemotionstick.menu.PartitionScheme.minimal.build.partitions=minimal
sparklemotionstick.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
sparklemotionstick.menu.PartitionScheme.no_ota.build.partitions=no_ota
sparklemotionstick.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
sparklemotionstick.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
sparklemotionstick.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
sparklemotionstick.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
sparklemotionstick.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
sparklemotionstick.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
sparklemotionstick.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
sparklemotionstick.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
sparklemotionstick.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
sparklemotionstick.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
sparklemotionstick.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
sparklemotionstick.menu.PartitionScheme.huge_app.build.partitions=huge_app
sparklemotionstick.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
sparklemotionstick.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
sparklemotionstick.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
sparklemotionstick.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

sparklemotionstick.menu.CPUFreq.240=240MHz (WiFi/BT)
sparklemotionstick.menu.CPUFreq.240.build.f_cpu=240000000L
sparklemotionstick.menu.CPUFreq.160=160MHz (WiFi/BT)
sparklemotionstick.menu.CPUFreq.160.build.f_cpu=160000000L
sparklemotionstick.menu.CPUFreq.80=80MHz (WiFi/BT)
sparklemotionstick.menu.CPUFreq.80.build.f_cpu=80000000L
sparklemotionstick.menu.CPUFreq.40=40MHz
sparklemotionstick.menu.CPUFreq.40.build.f_cpu=40000000L
sparklemotionstick.menu.CPUFreq.20=20MHz
sparklemotionstick.menu.CPUFreq.20.build.f_cpu=20000000L
sparklemotionstick.menu.CPUFreq.10=10MHz
sparklemotionstick.menu.CPUFreq.10.build.f_cpu=10000000L

sparklemotionstick.menu.FlashFreq.80=80MHz
sparklemotionstick.menu.FlashFreq.80.build.flash_freq=80m
sparklemotionstick.menu.FlashFreq.40=40MHz
sparklemotionstick.menu.FlashFreq.40.build.flash_freq=40m

sparklemotionstick.menu.FlashSize.4M=4MB (32Mb)
sparklemotionstick.menu.FlashSize.4M.build.flash_size=4MB

sparklemotionstick.menu.UploadSpeed.921600=921600
sparklemotionstick.menu.UploadSpeed.921600.upload.speed=921600
sparklemotionstick.menu.UploadSpeed.115200=115200
sparklemotionstick.menu.UploadSpeed.115200.upload.speed=115200
sparklemotionstick.menu.UploadSpeed.256000.windows=256000
sparklemotionstick.menu.UploadSpeed.256000.upload.speed=256000
sparklemotionstick.menu.UploadSpeed.230400.windows.upload.speed=256000
sparklemotionstick.menu.UploadSpeed.230400=230400
sparklemotionstick.menu.UploadSpeed.230400.upload.speed=230400
sparklemotionstick.menu.UploadSpeed.460800.linux=460800
sparklemotionstick.menu.UploadSpeed.460800.macosx=460800
sparklemotionstick.menu.UploadSpeed.460800.upload.speed=460800
sparklemotionstick.menu.UploadSpeed.512000.windows=512000
sparklemotionstick.menu.UploadSpeed.512000.upload.speed=512000

sparklemotionstick.menu.DebugLevel.none=None
sparklemotionstick.menu.DebugLevel.none.build.code_debug=0
sparklemotionstick.menu.DebugLevel.error=Error
sparklemotionstick.menu.DebugLevel.error.build.code_debug=1
sparklemotionstick.menu.DebugLevel.warn=Warn
sparklemotionstick.menu.DebugLevel.warn.build.code_debug=2
sparklemotionstick.menu.DebugLevel.info=Info
sparklemotionstick.menu.DebugLevel.info.build.code_debug=3
sparklemotionstick.menu.DebugLevel.debug=Debug
sparklemotionstick.menu.DebugLevel.debug.build.code_debug=4
sparklemotionstick.menu.DebugLevel.verbose=Verbose
sparklemotionstick.menu.DebugLevel.verbose.build.code_debug=5

sparklemotionstick.menu.EraseFlash.none=Disabled
sparklemotionstick.menu.EraseFlash.none.upload.erase_cmd=
sparklemotionstick.menu.EraseFlash.all=Enabled
sparklemotionstick.menu.EraseFlash.all.upload.erase_cmd=-e

