espressif/arduino-esp32/boards.txt
nologo_esp32c3_super_mini.menu.FlashMode.qio=QIO
nologo_esp32c3_super_mini.menu.FlashMode.qio.build.flash_mode=dio
nologo_esp32c3_super_mini.menu.FlashMode.qio.build.boot=qio
nologo_esp32c3_super_mini.menu.FlashMode.dio=DIO
nologo_esp32c3_super_mini.menu.FlashMode.dio.build.flash_mode=dio
nologo_esp32c3_super_mini.menu.FlashMode.dio.build.boot=dio

nologo_esp32c3_super_mini.menu.FlashFreq.80=80MHz
nologo_esp32c3_super_mini.menu.FlashFreq.80.build.flash_freq=80m
nologo_esp32c3_super_mini.menu.FlashFreq.40=40MHz
nologo_esp32c3_super_mini.menu.FlashFreq.40.build.flash_freq=40m

nologo_esp32c3_super_mini.menu.UploadSpeed.921600=921600
nologo_esp32c3_super_mini.menu.UploadSpeed.921600.upload.speed=921600
nologo_esp32c3_super_mini.menu.UploadSpeed.115200=115200
nologo_esp32c3_super_mini.menu.UploadSpeed.115200.upload.speed=115200
nologo_esp32c3_super_mini.menu.UploadSpeed.256000.windows=256000
nologo_esp32c3_super_mini.menu.UploadSpeed.256000.upload.speed=256000
nologo_esp32c3_super_mini.menu.UploadSpeed.230400.windows.upload.speed=256000
nologo_esp32c3_super_mini.menu.UploadSpeed.230400=230400
nologo_esp32c3_super_mini.menu.UploadSpeed.230400.upload.speed=230400
nologo_esp32c3_super_mini.menu.UploadSpeed.460800.linux=460800
nologo_esp32c3_super_mini.menu.UploadSpeed.460800.macosx=460800
nologo_esp32c3_super_mini.menu.UploadSpeed.460800.upload.speed=460800
nologo_esp32c3_super_mini.menu.UploadSpeed.512000.windows=512000
nologo_esp32c3_super_mini.menu.UploadSpeed.512000.upload.speed=512000

nologo_esp32c3_super_mini.menu.DebugLevel.none=None
nologo_esp32c3_super_mini.menu.DebugLevel.none.build.code_debug=0
nologo_esp32c3_super_mini.menu.DebugLevel.error=Error
nologo_esp32c3_super_mini.menu.DebugLevel.error.build.code_debug=1
nologo_esp32c3_super_mini.menu.DebugLevel.warn=Warn
nologo_esp32c3_super_mini.menu.DebugLevel.warn.build.code_debug=2
nologo_esp32c3_super_mini.menu.DebugLevel.info=Info
nologo_esp32c3_super_mini.menu.DebugLevel.info.build.code_debug=3
nologo_esp32c3_super_mini.menu.DebugLevel.debug=Debug
nologo_esp32c3_super_mini.menu.DebugLevel.debug.build.code_debug=4
nologo_esp32c3_super_mini.menu.DebugLevel.verbose=Verbose
nologo_esp32c3_super_mini.menu.DebugLevel.verbose.build.code_debug=5

nologo_esp32c3_super_mini.menu.EraseFlash.none=Disabled
nologo_esp32c3_super_mini.menu.EraseFlash.none.upload.erase_cmd=
nologo_esp32c3_super_mini.menu.EraseFlash.all=Enabled
nologo_esp32c3_super_mini.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

nologo_esp32s3_pico.name=Nologo ESP32S3 Pico

nologo_esp32s3_pico.bootloader.tool=esptool_py
nologo_esp32s3_pico.bootloader.tool.default=esptool_py

nologo_esp32s3_pico.upload.tool=esptool_py
nologo_esp32s3_pico.upload.tool.default=esptool_py
nologo_esp32s3_pico.upload.tool.network=esp_ota

nologo_esp32s3_pico.upload.maximum_size=1310720
nologo_esp32s3_pico.upload.maximum_data_size=327680
nologo_esp32s3_pico.upload.flags=
nologo_esp32s3_pico.upload.extra_flags=
nologo_esp32s3_pico.upload.use_1200bps_touch=false
nologo_esp32s3_pico.upload.wait_for_upload_port=false

nologo_esp32s3_pico.serial.disableDTR=false
nologo_esp32s3_pico.serial.disableRTS=false

nologo_esp32s3_pico.build.tarch=xtensa
nologo_esp32s3_pico.build.bootloader_addr=0x0
nologo_esp32s3_pico.build.target=esp32s3
nologo_esp32s3_pico.build.mcu=esp32s3
nologo_esp32s3_pico.build.core=esp32
nologo_esp32s3_pico.build.variant=nologo_esp32s3_pico
nologo_esp32s3_pico.build.board=NOLOGO_ESP32S3_PICO

nologo_esp32s3_pico.build.usb_mode=1
nologo_esp32s3_pico.build.cdc_on_boot=1
nologo_esp32s3_pico.build.msc_on_boot=0
nologo_esp32s3_pico.build.dfu_on_boot=0
nologo_esp32s3_pico.build.f_cpu=240000000L
nologo_esp32s3_pico.build.flash_size=8MB
nologo_esp32s3_pico.build.flash_freq=80m
nologo_esp32s3_pico.build.flash_mode=dio
nologo_esp32s3_pico.build.boot=qio
nologo_esp32s3_pico.build.boot_freq=80m
nologo_esp32s3_pico.build.partitions=default
nologo_esp32s3_pico.build.defines=
nologo_esp32s3_pico.build.loop_core=
nologo_esp32s3_pico.build.event_core=
nologo_esp32s3_pico.build.psram_type=qspi
nologo_esp32s3_pico.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
nologo_esp32s3_pico.menu.JTAGAdapter.default=Disabled
nologo_esp32s3_pico.menu.JTAGAdapter.default.build.copy_jtag_files=0
nologo_esp32s3_pico.menu.JTAGAdapter.builtin=Integrated USB JTAG
nologo_esp32s3_pico.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
nologo_esp32s3_pico.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
nologo_esp32s3_pico.menu.JTAGAdapter.external=FTDI Adapter
nologo_esp32s3_pico.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
nologo_esp32s3_pico.menu.JTAGAdapter.external.build.copy_jtag_files=1
nologo_esp32s3_pico.menu.JTAGAdapter.bridge=ESP USB Bridge
nologo_esp32s3_pico.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
nologo_esp32s3_pico.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

nologo_esp32s3_pico.menu.PSRAM.disabled=Disabled
nologo_esp32s3_pico.menu.PSRAM.disabled.build.defines=
nologo_esp32s3_pico.menu.PSRAM.disabled.build.psram_type=qspi
nologo_esp32s3_pico.menu.PSRAM.enabled=QSPI PSRAM
nologo_esp32s3_pico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
nologo_esp32s3_pico.menu.PSRAM.enabled.build.psram_type=qspi
nologo_esp32s3_pico.menu.PSRAM.opi=OPI PSRAM
nologo_esp32s3_pico.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
nologo_esp32s3_pico.menu.PSRAM.opi.build.psram_type=opi

nologo_esp32s3_pico.menu.FlashMode.qio=QIO 80MHz
nologo_esp32s3_pico.menu.FlashMode.qio.build.flash_mode=dio
nologo_esp32s3_pico.menu.FlashMode.qio.build.boot=qio
nologo_esp32s3_pico.menu.FlashMode.qio.build.boot_freq=80m
nologo_esp32s3_pico.menu.FlashMode.qio.build.flash_freq=80m
nologo_esp32s3_pico.menu.FlashMode.qio120=QIO 120MHz
nologo_esp32s3_pico.menu.FlashMode.qio120.build.flash_mode=dio
nologo_esp32s3_pico.menu.FlashMode.qio120.build.boot=qio
nologo_esp32s3_pico.menu.FlashMode.qio120.build.boot_freq=120m
nologo_esp32s3_pico.menu.FlashMode.qio120.build.flash_freq=80m
nologo_esp32s3_pico.menu.FlashMode.dio=DIO 80MHz
nologo_esp32s3_pico.menu.FlashMode.dio.build.flash_mode=dio
nologo_esp32s3_pico.menu.FlashMode.dio.build.boot=dio
nologo_esp32s3_pico.menu.FlashMode.dio.build.boot_freq=80m
nologo_esp32s3_pico.menu.FlashMode.dio.build.flash_freq=80m
nologo_esp32s3_pico.menu.FlashMode.opi=OPI 80MHz
nologo_esp32s3_pico.menu.FlashMode.opi.build.flash_mode=dout
nologo_esp32s3_pico.menu.FlashMode.opi.build.boot=opi
nologo_esp32s3_pico.menu.FlashMode.opi.build.boot_freq=80m
nologo_esp32s3_pico.menu.FlashMode.opi.build.flash_freq=80m

nologo_esp32s3_pico.menu.FlashSize.8M=8MB (64Mb)
nologo_esp32s3_pico.menu.FlashSize.8M.build.flash_size=8MB
nologo_esp32s3_pico.menu.FlashSize.16M=16MB (128Mb)
nologo_esp32s3_pico.menu.FlashSize.16M.build.flash_size=16MB

nologo_esp32s3_pico.menu.LoopCore.1=Core 1
nologo_esp32s3_pico.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
nologo_esp32s3_pico.menu.LoopCore.0=Core 0
nologo_esp32s3_pico.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

nologo_esp32s3_pico.menu.EventsCore.1=Core 1
nologo_esp32s3_pico.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nologo_esp32s3_pico.menu.EventsCore.0=Core 0
nologo_esp32s3_pico.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

