espressif/arduino-esp32/boards.txt
nologo_esp32s3_pico.menu.USBMode.hwcdc=Hardware CDC and JTAG
nologo_esp32s3_pico.menu.USBMode.hwcdc.build.usb_mode=1
nologo_esp32s3_pico.menu.USBMode.default=USB-OTG (TinyUSB)
nologo_esp32s3_pico.menu.USBMode.default.build.usb_mode=0

nologo_esp32s3_pico.menu.CDCOnBoot.default=Enabled
nologo_esp32s3_pico.menu.CDCOnBoot.default.build.cdc_on_boot=1
nologo_esp32s3_pico.menu.CDCOnBoot.cdc=Enabled
nologo_esp32s3_pico.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

nologo_esp32s3_pico.menu.MSCOnBoot.default=Disabled
nologo_esp32s3_pico.menu.MSCOnBoot.default.build.msc_on_boot=0
nologo_esp32s3_pico.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
nologo_esp32s3_pico.menu.MSCOnBoot.msc.build.msc_on_boot=1

nologo_esp32s3_pico.menu.DFUOnBoot.default=Disabled
nologo_esp32s3_pico.menu.DFUOnBoot.default.build.dfu_on_boot=0
nologo_esp32s3_pico.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
nologo_esp32s3_pico.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

nologo_esp32s3_pico.menu.UploadMode.default=UART0 / Hardware CDC
nologo_esp32s3_pico.menu.UploadMode.default.upload.use_1200bps_touch=false
nologo_esp32s3_pico.menu.UploadMode.default.upload.wait_for_upload_port=false
nologo_esp32s3_pico.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
nologo_esp32s3_pico.menu.UploadMode.cdc.upload.use_1200bps_touch=true
nologo_esp32s3_pico.menu.UploadMode.cdc.upload.wait_for_upload_port=true

nologo_esp32s3_pico.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.default.build.partitions=default
nologo_esp32s3_pico.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
nologo_esp32s3_pico.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
nologo_esp32s3_pico.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
nologo_esp32s3_pico.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
nologo_esp32s3_pico.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.minimal.build.partitions=minimal
nologo_esp32s3_pico.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.no_ota.build.partitions=no_ota
nologo_esp32s3_pico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
nologo_esp32s3_pico.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
nologo_esp32s3_pico.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
nologo_esp32s3_pico.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
nologo_esp32s3_pico.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
nologo_esp32s3_pico.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
nologo_esp32s3_pico.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
nologo_esp32s3_pico.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
nologo_esp32s3_pico.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
nologo_esp32s3_pico.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.huge_app.build.partitions=huge_app
nologo_esp32s3_pico.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
nologo_esp32s3_pico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
nologo_esp32s3_pico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
nologo_esp32s3_pico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
nologo_esp32s3_pico.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
nologo_esp32s3_pico.menu.PartitionScheme.fatflash.build.partitions=ffat
nologo_esp32s3_pico.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
nologo_esp32s3_pico.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
nologo_esp32s3_pico.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
nologo_esp32s3_pico.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker=RainMaker 4MB
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
nologo_esp32s3_pico.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
nologo_esp32s3_pico.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
nologo_esp32s3_pico.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
nologo_esp32s3_pico.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
nologo_esp32s3_pico.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
nologo_esp32s3_pico.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
nologo_esp32s3_pico.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
nologo_esp32s3_pico.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
nologo_esp32s3_pico.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
nologo_esp32s3_pico.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
nologo_esp32s3_pico.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
nologo_esp32s3_pico.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
nologo_esp32s3_pico.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
nologo_esp32s3_pico.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
nologo_esp32s3_pico.menu.PartitionScheme.custom=Custom
nologo_esp32s3_pico.menu.PartitionScheme.custom.build.partitions=
nologo_esp32s3_pico.menu.PartitionScheme.custom.upload.maximum_size=16777216

nologo_esp32s3_pico.menu.CPUFreq.240=240MHz (WiFi)
nologo_esp32s3_pico.menu.CPUFreq.240.build.f_cpu=240000000L
nologo_esp32s3_pico.menu.CPUFreq.160=160MHz (WiFi)
nologo_esp32s3_pico.menu.CPUFreq.160.build.f_cpu=160000000L
nologo_esp32s3_pico.menu.CPUFreq.80=80MHz (WiFi)
nologo_esp32s3_pico.menu.CPUFreq.80.build.f_cpu=80000000L
nologo_esp32s3_pico.menu.CPUFreq.40=40MHz
nologo_esp32s3_pico.menu.CPUFreq.40.build.f_cpu=40000000L
nologo_esp32s3_pico.menu.CPUFreq.20=20MHz
nologo_esp32s3_pico.menu.CPUFreq.20.build.f_cpu=20000000L
nologo_esp32s3_pico.menu.CPUFreq.10=10MHz
nologo_esp32s3_pico.menu.CPUFreq.10.build.f_cpu=10000000L

nologo_esp32s3_pico.menu.UploadSpeed.921600=921600
nologo_esp32s3_pico.menu.UploadSpeed.921600.upload.speed=921600
nologo_esp32s3_pico.menu.UploadSpeed.115200=115200
nologo_esp32s3_pico.menu.UploadSpeed.115200.upload.speed=115200
nologo_esp32s3_pico.menu.UploadSpeed.256000.windows=256000
nologo_esp32s3_pico.menu.UploadSpeed.256000.upload.speed=256000
nologo_esp32s3_pico.menu.UploadSpeed.230400.windows.upload.speed=256000
nologo_esp32s3_pico.menu.UploadSpeed.230400=230400
nologo_esp32s3_pico.menu.UploadSpeed.230400.upload.speed=230400
nologo_esp32s3_pico.menu.UploadSpeed.460800.linux=460800
nologo_esp32s3_pico.menu.UploadSpeed.460800.macosx=460800
nologo_esp32s3_pico.menu.UploadSpeed.460800.upload.speed=460800
nologo_esp32s3_pico.menu.UploadSpeed.512000.windows=512000
nologo_esp32s3_pico.menu.UploadSpeed.512000.upload.speed=512000

