espressif/arduino-esp32/boards.txt
esp32-evb.menu.PartitionScheme.default=Default
esp32-evb.menu.PartitionScheme.default.build.partitions=default
esp32-evb.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-evb.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-evb.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-evb.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-evb.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-evb.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

esp32-evb.menu.DebugLevel.none=None
esp32-evb.menu.DebugLevel.none.build.code_debug=0
esp32-evb.menu.DebugLevel.error=Error
esp32-evb.menu.DebugLevel.error.build.code_debug=1
esp32-evb.menu.DebugLevel.warn=Warn
esp32-evb.menu.DebugLevel.warn.build.code_debug=2
esp32-evb.menu.DebugLevel.info=Info
esp32-evb.menu.DebugLevel.info.build.code_debug=3
esp32-evb.menu.DebugLevel.debug=Debug
esp32-evb.menu.DebugLevel.debug.build.code_debug=4
esp32-evb.menu.DebugLevel.verbose=Verbose
esp32-evb.menu.DebugLevel.verbose.build.code_debug=5

esp32-evb.menu.EraseFlash.none=Disabled
esp32-evb.menu.EraseFlash.none.upload.erase_cmd=
esp32-evb.menu.EraseFlash.all=Enabled
esp32-evb.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32-gateway.name=OLIMEX ESP32-GATEWAY

esp32-gateway.bootloader.tool=esptool_py
esp32-gateway.bootloader.tool.default=esptool_py

esp32-gateway.upload.tool=esptool_py
esp32-gateway.upload.tool.default=esptool_py
esp32-gateway.upload.tool.network=esp_ota

esp32-gateway.upload.maximum_size=1310720
esp32-gateway.upload.maximum_data_size=327680
esp32-gateway.upload.flags=
esp32-gateway.upload.extra_flags=

esp32-gateway.serial.disableDTR=true
esp32-gateway.serial.disableRTS=true

esp32-gateway.build.tarch=xtensa
esp32-gateway.build.bootloader_addr=0x1000
esp32-gateway.build.target=esp32
esp32-gateway.build.mcu=esp32
esp32-gateway.build.core=esp32
esp32-gateway.build.variant=esp32-gateway
esp32-gateway.build.board=ESP32_GATEWAY
esp32-gateway.menu.Revision.RevC=Revision C or older
esp32-gateway.menu.Revision.RevC.build.board=ESP32_GATEWAY_C
esp32-gateway.menu.Revision.RevE=Revision E
esp32-gateway.menu.Revision.RevE.build.board=ESP32_GATEWAY_E
esp32-gateway.menu.Revision.RevF=Revision F or newer
esp32-gateway.menu.Revision.RevF.build.board=ESP32_GATEWAY_F

esp32-gateway.build.f_cpu=240000000L
esp32-gateway.build.flash_mode=dio
esp32-gateway.build.flash_size=4MB
esp32-gateway.build.boot=dio
esp32-gateway.build.partitions=default
esp32-gateway.build.defines=

esp32-gateway.menu.FlashFreq.80=80MHz
esp32-gateway.menu.FlashFreq.80.build.flash_freq=80m
esp32-gateway.menu.FlashFreq.40=40MHz
esp32-gateway.menu.FlashFreq.40.build.flash_freq=40m

esp32-gateway.menu.UploadSpeed.921600=921600
esp32-gateway.menu.UploadSpeed.921600.upload.speed=921600
esp32-gateway.menu.UploadSpeed.115200=115200
esp32-gateway.menu.UploadSpeed.115200.upload.speed=115200

esp32-gateway.menu.PartitionScheme.default=Default
esp32-gateway.menu.PartitionScheme.default.build.partitions=default
esp32-gateway.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-gateway.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-gateway.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-gateway.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-gateway.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-gateway.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

esp32-gateway.menu.DebugLevel.none=None
esp32-gateway.menu.DebugLevel.none.build.code_debug=0
esp32-gateway.menu.DebugLevel.error=Error
esp32-gateway.menu.DebugLevel.error.build.code_debug=1
esp32-gateway.menu.DebugLevel.warn=Warn
esp32-gateway.menu.DebugLevel.warn.build.code_debug=2
esp32-gateway.menu.DebugLevel.info=Info
esp32-gateway.menu.DebugLevel.info.build.code_debug=3
esp32-gateway.menu.DebugLevel.debug=Debug
esp32-gateway.menu.DebugLevel.debug.build.code_debug=4
esp32-gateway.menu.DebugLevel.verbose=Verbose
esp32-gateway.menu.DebugLevel.verbose.build.code_debug=5

esp32-gateway.menu.EraseFlash.none=Disabled
esp32-gateway.menu.EraseFlash.none.upload.erase_cmd=
esp32-gateway.menu.EraseFlash.all=Enabled
esp32-gateway.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32-poe.name=OLIMEX ESP32-POE

esp32-poe.bootloader.tool=esptool_py
esp32-poe.bootloader.tool.default=esptool_py

esp32-poe.upload.tool=esptool_py
esp32-poe.upload.tool.default=esptool_py
esp32-poe.upload.tool.network=esp_ota

esp32-poe.upload.maximum_size=1310720
esp32-poe.upload.maximum_data_size=327680
esp32-poe.upload.flags=
esp32-poe.upload.extra_flags=

esp32-poe.serial.disableDTR=true
esp32-poe.serial.disableRTS=true

esp32-poe.build.tarch=xtensa
esp32-poe.build.bootloader_addr=0x1000
esp32-poe.build.target=esp32
esp32-poe.build.mcu=esp32
esp32-poe.build.core=esp32
esp32-poe.build.variant=esp32-poe
esp32-poe.build.board=ESP32_POE

esp32-poe.build.f_cpu=240000000L
esp32-poe.build.flash_size=4MB
esp32-poe.build.flash_freq=40m
esp32-poe.build.flash_mode=dio
esp32-poe.build.boot=dio
esp32-poe.build.partitions=default
esp32-poe.build.defines=
esp32-poe.build.loop_core=
esp32-poe.build.event_core=

esp32-poe.menu.PSRAM.disabled=Disabled (WROOM)
esp32-poe.menu.PSRAM.disabled.build.defines=
esp32-poe.menu.PSRAM.disabled.build.extra_libs=
esp32-poe.menu.PSRAM.enabled=Enabled (WROVER)
esp32-poe.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
esp32-poe.menu.PSRAM.enabled.build.extra_libs=

esp32-poe.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32-poe.menu.PartitionScheme.default.build.partitions=default
esp32-poe.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32-poe.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32-poe.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32-poe.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32-poe.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32-poe.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32-poe.menu.PartitionScheme.minimal.build.partitions=minimal
esp32-poe.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32-poe.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-poe.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-poe.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32-poe.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32-poe.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32-poe.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32-poe.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32-poe.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32-poe.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32-poe.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32-poe.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32-poe.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32-poe.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32-poe.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32-poe.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32-poe.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-poe.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32-poe.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32-poe.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32-poe.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32-poe.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32-poe.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32-poe.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32-poe.menu.PartitionScheme.rainmaker=RainMaker 4MB
esp32-poe.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32-poe.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
esp32-poe.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
esp32-poe.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
esp32-poe.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
esp32-poe.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
esp32-poe.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
esp32-poe.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
esp32-poe.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
esp32-poe.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
esp32-poe.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
esp32-poe.menu.PartitionScheme.custom=Custom
esp32-poe.menu.PartitionScheme.custom.build.partitions=
esp32-poe.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32-poe.menu.FlashMode.qio=QIO
esp32-poe.menu.FlashMode.qio.build.flash_mode=dio
esp32-poe.menu.FlashMode.qio.build.boot=qio
esp32-poe.menu.FlashMode.dio=DIO
esp32-poe.menu.FlashMode.dio.build.flash_mode=dio
esp32-poe.menu.FlashMode.dio.build.boot=dio

esp32-poe.menu.FlashFreq.80=80MHz
esp32-poe.menu.FlashFreq.80.build.flash_freq=80m
esp32-poe.menu.FlashFreq.40=40MHz
esp32-poe.menu.FlashFreq.40.build.flash_freq=40m

esp32-poe.menu.FlashSize.4M=4MB (32Mb)
esp32-poe.menu.FlashSize.4M.build.flash_size=4MB
esp32-poe.menu.FlashSize.16M=16MB (128Mb)
esp32-poe.menu.FlashSize.16M.build.flash_size=16MB

esp32-poe.menu.UploadSpeed.921600=921600
esp32-poe.menu.UploadSpeed.921600.upload.speed=921600
esp32-poe.menu.UploadSpeed.115200=115200
esp32-poe.menu.UploadSpeed.115200.upload.speed=115200
esp32-poe.menu.UploadSpeed.256000.windows=256000
esp32-poe.menu.UploadSpeed.256000.upload.speed=256000
esp32-poe.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-poe.menu.UploadSpeed.230400=230400
esp32-poe.menu.UploadSpeed.230400.upload.speed=230400
esp32-poe.menu.UploadSpeed.460800.linux=460800
esp32-poe.menu.UploadSpeed.460800.macosx=460800
esp32-poe.menu.UploadSpeed.460800.upload.speed=460800
esp32-poe.menu.UploadSpeed.512000.windows=512000
esp32-poe.menu.UploadSpeed.512000.upload.speed=512000

esp32-poe.menu.DebugLevel.none=None
esp32-poe.menu.DebugLevel.none.build.code_debug=0
esp32-poe.menu.DebugLevel.error=Error
esp32-poe.menu.DebugLevel.error.build.code_debug=1
esp32-poe.menu.DebugLevel.warn=Warn
esp32-poe.menu.DebugLevel.warn.build.code_debug=2
esp32-poe.menu.DebugLevel.info=Info
esp32-poe.menu.DebugLevel.info.build.code_debug=3
esp32-poe.menu.DebugLevel.debug=Debug
esp32-poe.menu.DebugLevel.debug.build.code_debug=4
esp32-poe.menu.DebugLevel.verbose=Verbose
esp32-poe.menu.DebugLevel.verbose.build.code_debug=5

esp32-poe.menu.EraseFlash.none=Disabled
esp32-poe.menu.EraseFlash.none.upload.erase_cmd=
esp32-poe.menu.EraseFlash.all=Enabled
esp32-poe.menu.EraseFlash.all.upload.erase_cmd=-e

