espressif/arduino-esp32/boards.txt
esp32s2-devkitlipo-usb.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.default.build.partitions=default
esp32s2-devkitlipo-usb.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s2-devkitlipo-usb.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s2-devkitlipo-usb.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s2-devkitlipo-usb.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s2-devkitlipo-usb.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s2-devkitlipo-usb.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s2-devkitlipo-usb.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s2-devkitlipo-usb.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s2-devkitlipo-usb.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s2-devkitlipo-usb.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s2-devkitlipo-usb.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s2-devkitlipo-usb.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s2-devkitlipo-usb.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s2-devkitlipo-usb.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s2-devkitlipo-usb.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s2-devkitlipo-usb.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker=RainMaker 4MB
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
esp32s2-devkitlipo-usb.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
esp32s2-devkitlipo-usb.menu.PartitionScheme.custom=Custom
esp32s2-devkitlipo-usb.menu.PartitionScheme.custom.build.partitions=
esp32s2-devkitlipo-usb.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32s2-devkitlipo-usb.menu.CPUFreq.240=240MHz (WiFi)
esp32s2-devkitlipo-usb.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s2-devkitlipo-usb.menu.CPUFreq.160=160MHz (WiFi)
esp32s2-devkitlipo-usb.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s2-devkitlipo-usb.menu.CPUFreq.80=80MHz (WiFi)
esp32s2-devkitlipo-usb.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s2-devkitlipo-usb.menu.CPUFreq.40=40MHz
esp32s2-devkitlipo-usb.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s2-devkitlipo-usb.menu.CPUFreq.20=20MHz
esp32s2-devkitlipo-usb.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s2-devkitlipo-usb.menu.CPUFreq.10=10MHz
esp32s2-devkitlipo-usb.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s2-devkitlipo-usb.menu.FlashMode.qio=QIO
esp32s2-devkitlipo-usb.menu.FlashMode.qio.build.flash_mode=dio
esp32s2-devkitlipo-usb.menu.FlashMode.qio.build.boot=qio
esp32s2-devkitlipo-usb.menu.FlashMode.dio=DIO
esp32s2-devkitlipo-usb.menu.FlashMode.dio.build.flash_mode=dio
esp32s2-devkitlipo-usb.menu.FlashMode.dio.build.boot=dio
esp32s2-devkitlipo-usb.menu.FlashMode.qout=QOUT
esp32s2-devkitlipo-usb.menu.FlashMode.qout.build.flash_mode=dout
esp32s2-devkitlipo-usb.menu.FlashMode.qout.build.boot=qout
esp32s2-devkitlipo-usb.menu.FlashMode.dout=DOUT
esp32s2-devkitlipo-usb.menu.FlashMode.dout.build.flash_mode=dout
esp32s2-devkitlipo-usb.menu.FlashMode.dout.build.boot=dout

esp32s2-devkitlipo-usb.menu.FlashFreq.80=80MHz
esp32s2-devkitlipo-usb.menu.FlashFreq.80.build.flash_freq=80m
esp32s2-devkitlipo-usb.menu.FlashFreq.40=40MHz
esp32s2-devkitlipo-usb.menu.FlashFreq.40.build.flash_freq=40m

esp32s2-devkitlipo-usb.menu.FlashSize.4M=4MB (32Mb)
esp32s2-devkitlipo-usb.menu.FlashSize.4M.build.flash_size=4MB
esp32s2-devkitlipo-usb.menu.FlashSize.8M=8MB (64Mb)
esp32s2-devkitlipo-usb.menu.FlashSize.8M.build.flash_size=8MB
esp32s2-devkitlipo-usb.menu.FlashSize.2M=2MB (16Mb)
esp32s2-devkitlipo-usb.menu.FlashSize.2M.build.flash_size=2MB
esp32s2-devkitlipo-usb.menu.FlashSize.16M=16MB (128Mb)
esp32s2-devkitlipo-usb.menu.FlashSize.16M.build.flash_size=16MB

esp32s2-devkitlipo-usb.menu.UploadSpeed.921600=921600
esp32s2-devkitlipo-usb.menu.UploadSpeed.921600.upload.speed=921600
esp32s2-devkitlipo-usb.menu.UploadSpeed.115200=115200
esp32s2-devkitlipo-usb.menu.UploadSpeed.115200.upload.speed=115200
esp32s2-devkitlipo-usb.menu.UploadSpeed.256000.windows=256000
esp32s2-devkitlipo-usb.menu.UploadSpeed.256000.upload.speed=256000
esp32s2-devkitlipo-usb.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s2-devkitlipo-usb.menu.UploadSpeed.230400=230400
esp32s2-devkitlipo-usb.menu.UploadSpeed.230400.upload.speed=230400
esp32s2-devkitlipo-usb.menu.UploadSpeed.460800.linux=460800
esp32s2-devkitlipo-usb.menu.UploadSpeed.460800.macosx=460800
esp32s2-devkitlipo-usb.menu.UploadSpeed.460800.upload.speed=460800
esp32s2-devkitlipo-usb.menu.UploadSpeed.512000.windows=512000
esp32s2-devkitlipo-usb.menu.UploadSpeed.512000.upload.speed=512000

esp32s2-devkitlipo-usb.menu.DebugLevel.none=None
esp32s2-devkitlipo-usb.menu.DebugLevel.none.build.code_debug=0
esp32s2-devkitlipo-usb.menu.DebugLevel.error=Error
esp32s2-devkitlipo-usb.menu.DebugLevel.error.build.code_debug=1
esp32s2-devkitlipo-usb.menu.DebugLevel.warn=Warn
esp32s2-devkitlipo-usb.menu.DebugLevel.warn.build.code_debug=2
esp32s2-devkitlipo-usb.menu.DebugLevel.info=Info
esp32s2-devkitlipo-usb.menu.DebugLevel.info.build.code_debug=3
esp32s2-devkitlipo-usb.menu.DebugLevel.debug=Debug
esp32s2-devkitlipo-usb.menu.DebugLevel.debug.build.code_debug=4
esp32s2-devkitlipo-usb.menu.DebugLevel.verbose=Verbose
esp32s2-devkitlipo-usb.menu.DebugLevel.verbose.build.code_debug=5

esp32s2-devkitlipo-usb.menu.EraseFlash.none=Disabled
esp32s2-devkitlipo-usb.menu.EraseFlash.none.upload.erase_cmd=
esp32s2-devkitlipo-usb.menu.EraseFlash.all=Enabled
esp32s2-devkitlipo-usb.menu.EraseFlash.all.upload.erase_cmd=-e

