espressif/arduino-esp32/boards.txt
esp32-sbc-fabgl.menu.FlashFreq.80=80MHz
esp32-sbc-fabgl.menu.FlashFreq.80.build.flash_freq=80m
esp32-sbc-fabgl.menu.FlashFreq.40=40MHz
esp32-sbc-fabgl.menu.FlashFreq.40.build.flash_freq=40m

esp32-sbc-fabgl.menu.FlashSize.4M=4MB (32Mb)
esp32-sbc-fabgl.menu.FlashSize.4M.build.flash_size=4MB
esp32-sbc-fabgl.menu.FlashSize.8M=8MB (64Mb)
esp32-sbc-fabgl.menu.FlashSize.8M.build.flash_size=8MB
esp32-sbc-fabgl.menu.FlashSize.2M=2MB (16Mb)
esp32-sbc-fabgl.menu.FlashSize.2M.build.flash_size=2MB
esp32-sbc-fabgl.menu.FlashSize.16M=16MB (128Mb)
esp32-sbc-fabgl.menu.FlashSize.16M.build.flash_size=16MB

esp32-sbc-fabgl.menu.UploadSpeed.921600=921600
esp32-sbc-fabgl.menu.UploadSpeed.921600.upload.speed=921600
esp32-sbc-fabgl.menu.UploadSpeed.115200=115200
esp32-sbc-fabgl.menu.UploadSpeed.115200.upload.speed=115200
esp32-sbc-fabgl.menu.UploadSpeed.256000.windows=256000
esp32-sbc-fabgl.menu.UploadSpeed.256000.upload.speed=256000
esp32-sbc-fabgl.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32-sbc-fabgl.menu.UploadSpeed.230400=230400
esp32-sbc-fabgl.menu.UploadSpeed.230400.upload.speed=230400
esp32-sbc-fabgl.menu.UploadSpeed.460800.linux=460800
esp32-sbc-fabgl.menu.UploadSpeed.460800.macosx=460800
esp32-sbc-fabgl.menu.UploadSpeed.460800.upload.speed=460800
esp32-sbc-fabgl.menu.UploadSpeed.512000.windows=512000
esp32-sbc-fabgl.menu.UploadSpeed.512000.upload.speed=512000

esp32-sbc-fabgl.menu.LoopCore.1=Core 1
esp32-sbc-fabgl.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32-sbc-fabgl.menu.LoopCore.0=Core 0
esp32-sbc-fabgl.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32-sbc-fabgl.menu.EventsCore.1=Core 1
esp32-sbc-fabgl.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32-sbc-fabgl.menu.EventsCore.0=Core 0
esp32-sbc-fabgl.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32-sbc-fabgl.menu.DebugLevel.none=None
esp32-sbc-fabgl.menu.DebugLevel.none.build.code_debug=0
esp32-sbc-fabgl.menu.DebugLevel.error=Error
esp32-sbc-fabgl.menu.DebugLevel.error.build.code_debug=1
esp32-sbc-fabgl.menu.DebugLevel.warn=Warn
esp32-sbc-fabgl.menu.DebugLevel.warn.build.code_debug=2
esp32-sbc-fabgl.menu.DebugLevel.info=Info
esp32-sbc-fabgl.menu.DebugLevel.info.build.code_debug=3
esp32-sbc-fabgl.menu.DebugLevel.debug=Debug
esp32-sbc-fabgl.menu.DebugLevel.debug.build.code_debug=4
esp32-sbc-fabgl.menu.DebugLevel.verbose=Verbose
esp32-sbc-fabgl.menu.DebugLevel.verbose.build.code_debug=5

esp32-sbc-fabgl.menu.EraseFlash.none=Disabled
esp32-sbc-fabgl.menu.EraseFlash.none.upload.erase_cmd=
esp32-sbc-fabgl.menu.EraseFlash.all=Enabled
esp32-sbc-fabgl.menu.EraseFlash.all.upload.erase_cmd=-e

esp32-sbc-fabgl.menu.ZigbeeMode.default=Disabled
esp32-sbc-fabgl.menu.ZigbeeMode.default.build.zigbee_mode=
esp32-sbc-fabgl.menu.ZigbeeMode.default.build.zigbee_libs=
esp32-sbc-fabgl.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32-sbc-fabgl.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32-sbc-fabgl.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

espino32.name=ThaiEasyElec's ESPino32

espino32.bootloader.tool=esptool_py
espino32.bootloader.tool.default=esptool_py

espino32.upload.tool=esptool_py
espino32.upload.tool.default=esptool_py
espino32.upload.tool.network=esp_ota

espino32.upload.maximum_size=1310720
espino32.upload.maximum_data_size=327680
espino32.upload.flags=
espino32.upload.extra_flags=

espino32.serial.disableDTR=true
espino32.serial.disableRTS=true

espino32.build.tarch=xtensa
espino32.build.bootloader_addr=0x1000
espino32.build.target=esp32
espino32.build.mcu=esp32
espino32.build.core=esp32
espino32.build.variant=espino32
espino32.build.board=ESPino32

espino32.build.f_cpu=240000000L
espino32.build.flash_mode=dio
espino32.build.flash_size=4MB
espino32.build.boot=dio
espino32.build.partitions=default
espino32.build.defines=

espino32.menu.FlashFreq.80=80MHz
espino32.menu.FlashFreq.80.build.flash_freq=80m
espino32.menu.FlashFreq.40=40MHz
espino32.menu.FlashFreq.40.build.flash_freq=40m

espino32.menu.UploadSpeed.921600=921600
espino32.menu.UploadSpeed.921600.upload.speed=921600
espino32.menu.UploadSpeed.115200=115200
espino32.menu.UploadSpeed.115200.upload.speed=115200
espino32.menu.UploadSpeed.256000.windows=256000
espino32.menu.UploadSpeed.256000.upload.speed=256000
espino32.menu.UploadSpeed.230400.windows.upload.speed=256000
espino32.menu.UploadSpeed.230400=230400
espino32.menu.UploadSpeed.230400.upload.speed=230400
espino32.menu.UploadSpeed.460800.linux=460800
espino32.menu.UploadSpeed.460800.macosx=460800
espino32.menu.UploadSpeed.460800.upload.speed=460800
espino32.menu.UploadSpeed.512000.windows=512000
espino32.menu.UploadSpeed.512000.upload.speed=512000

espino32.menu.DebugLevel.none=None
espino32.menu.DebugLevel.none.build.code_debug=0
espino32.menu.DebugLevel.error=Error
espino32.menu.DebugLevel.error.build.code_debug=1
espino32.menu.DebugLevel.warn=Warn
espino32.menu.DebugLevel.warn.build.code_debug=2
espino32.menu.DebugLevel.info=Info
espino32.menu.DebugLevel.info.build.code_debug=3
espino32.menu.DebugLevel.debug=Debug
espino32.menu.DebugLevel.debug.build.code_debug=4
espino32.menu.DebugLevel.verbose=Verbose
espino32.menu.DebugLevel.verbose.build.code_debug=5

espino32.menu.EraseFlash.none=Disabled
espino32.menu.EraseFlash.none.upload.erase_cmd=
espino32.menu.EraseFlash.all=Enabled
espino32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack_core.name=M5Core

m5stack_core.bootloader.tool=esptool_py
m5stack_core.bootloader.tool.default=esptool_py

m5stack_core.upload.tool=esptool_py
m5stack_core.upload.tool.default=esptool_py
m5stack_core.upload.tool.network=esp_ota

m5stack_core.upload.maximum_size=1310720
m5stack_core.upload.maximum_data_size=327680
m5stack_core.upload.flags=
m5stack_core.upload.extra_flags=

m5stack_core.serial.disableDTR=true
m5stack_core.serial.disableRTS=true

m5stack_core.build.tarch=xtensa
m5stack_core.build.bootloader_addr=0x1000
m5stack_core.build.target=esp32
m5stack_core.build.mcu=esp32
m5stack_core.build.core=esp32
m5stack_core.build.variant=m5stack_core
m5stack_core.build.board=M5STACK_CORE

m5stack_core.build.f_cpu=240000000L
m5stack_core.build.flash_size=4MB
m5stack_core.build.flash_freq=80m
m5stack_core.build.flash_mode=dio
m5stack_core.build.boot=dio
m5stack_core.build.partitions=default
m5stack_core.build.defines=
m5stack_core.build.loop_core=
m5stack_core.build.event_core=

