espressif/arduino-esp32/boards.txt
##############################################################

m5stack_stickc.name=M5StickC

m5stack_stickc.bootloader.tool=esptool_py
m5stack_stickc.bootloader.tool.default=esptool_py

m5stack_stickc.upload.tool=esptool_py
m5stack_stickc.upload.tool.default=esptool_py
m5stack_stickc.upload.tool.network=esp_ota

m5stack_stickc.upload.maximum_size=1310720
m5stack_stickc.upload.maximum_data_size=327680
m5stack_stickc.upload.flags=
m5stack_stickc.upload.extra_flags=

m5stack_stickc.serial.disableDTR=true
m5stack_stickc.serial.disableRTS=true

m5stack_stickc.build.tarch=xtensa
m5stack_stickc.build.bootloader_addr=0x1000
m5stack_stickc.build.target=esp32
m5stack_stickc.build.mcu=esp32
m5stack_stickc.build.core=esp32
m5stack_stickc.build.variant=m5stack_stickc
m5stack_stickc.build.board=M5STACK_STICKC

m5stack_stickc.build.f_cpu=240000000L
m5stack_stickc.build.flash_size=4MB
m5stack_stickc.build.flash_freq=80m
m5stack_stickc.build.flash_mode=dio
m5stack_stickc.build.boot=dio
m5stack_stickc.build.partitions=huge_app
m5stack_stickc.build.defines=
m5stack_stickc.build.loop_core=
m5stack_stickc.build.event_core=

m5stack_stickc.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack_stickc.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack_stickc.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack_stickc.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack_stickc.menu.PartitionScheme.default.build.partitions=default
m5stack_stickc.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack_stickc.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack_stickc.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
m5stack_stickc.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack_stickc.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack_stickc.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack_stickc.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack_stickc.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack_stickc.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack_stickc.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack_stickc.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack_stickc.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack_stickc.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack_stickc.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack_stickc.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack_stickc.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack_stickc.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack_stickc.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack_stickc.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack_stickc.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack_stickc.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack_stickc.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
m5stack_stickc.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
m5stack_stickc.menu.PartitionScheme.fatflash.build.partitions=ffat
m5stack_stickc.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
m5stack_stickc.menu.PartitionScheme.rainmaker=RainMaker 4MB
m5stack_stickc.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
m5stack_stickc.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
m5stack_stickc.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
m5stack_stickc.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
m5stack_stickc.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
m5stack_stickc.menu.PartitionScheme.custom=Custom
m5stack_stickc.menu.PartitionScheme.custom.build.partitions=
m5stack_stickc.menu.PartitionScheme.custom.upload.maximum_size=16777216

m5stack_stickc.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack_stickc.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack_stickc.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack_stickc.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack_stickc.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack_stickc.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack_stickc.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack_stickc.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack_stickc.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack_stickc.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack_stickc.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack_stickc.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack_stickc.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack_stickc.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack_stickc.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack_stickc.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack_stickc.menu.FlashMode.qio=QIO
m5stack_stickc.menu.FlashMode.qio.build.flash_mode=dio
m5stack_stickc.menu.FlashMode.qio.build.boot=qio
m5stack_stickc.menu.FlashMode.dio=DIO
m5stack_stickc.menu.FlashMode.dio.build.flash_mode=dio
m5stack_stickc.menu.FlashMode.dio.build.boot=dio
m5stack_stickc.menu.FlashMode.qout=QOUT
m5stack_stickc.menu.FlashMode.qout.build.flash_mode=dout
m5stack_stickc.menu.FlashMode.qout.build.boot=qout
m5stack_stickc.menu.FlashMode.dout=DOUT
m5stack_stickc.menu.FlashMode.dout.build.flash_mode=dout
m5stack_stickc.menu.FlashMode.dout.build.boot=dout

m5stack_stickc.menu.FlashFreq.80=80MHz
m5stack_stickc.menu.FlashFreq.80.build.flash_freq=80m
m5stack_stickc.menu.FlashFreq.40=40MHz
m5stack_stickc.menu.FlashFreq.40.build.flash_freq=40m

m5stack_stickc.menu.FlashSize.4M=4MB (32Mb)
m5stack_stickc.menu.FlashSize.4M.build.flash_size=4MB

m5stack_stickc.menu.UploadSpeed.1500000=1500000
m5stack_stickc.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack_stickc.menu.UploadSpeed.750000=750000
m5stack_stickc.menu.UploadSpeed.750000.upload.speed=750000
m5stack_stickc.menu.UploadSpeed.500000=500000
m5stack_stickc.menu.UploadSpeed.500000.upload.speed=500000
m5stack_stickc.menu.UploadSpeed.250000=250000
m5stack_stickc.menu.UploadSpeed.250000.upload.speed=250000
m5stack_stickc.menu.UploadSpeed.115200=115200
m5stack_stickc.menu.UploadSpeed.115200.upload.speed=115200

