espressif/arduino-esp32/boards.txt
m5stack_timer_cam.menu.EraseFlash.none=Disabled
m5stack_timer_cam.menu.EraseFlash.none.upload.erase_cmd=
m5stack_timer_cam.menu.EraseFlash.all=Enabled
m5stack_timer_cam.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################


m5stack_unit_cam.name=M5UnitCAM

m5stack_unit_cam.bootloader.tool=esptool_py
m5stack_unit_cam.bootloader.tool.default=esptool_py

m5stack_unit_cam.upload.tool=esptool_py
m5stack_unit_cam.upload.tool.default=esptool_py
m5stack_unit_cam.upload.tool.network=esp_ota

m5stack_unit_cam.upload.maximum_size=1310720
m5stack_unit_cam.upload.maximum_data_size=327680

m5stack_unit_cam.upload.flags=
m5stack_unit_cam.upload.extra_flags=

m5stack_unit_cam.serial.disableDTR=true
m5stack_unit_cam.serial.disableRTS=true

m5stack_unit_cam.build.tarch=xtensa
m5stack_unit_cam.build.bootloader_addr=0x1000
m5stack_unit_cam.build.target=esp32
m5stack_unit_cam.build.mcu=esp32
m5stack_unit_cam.build.core=esp32
m5stack_unit_cam.build.variant=m5stack_unit_cam
m5stack_unit_cam.build.board=M5STACK_UNIT_CAM

m5stack_unit_cam.build.f_cpu=240000000L
m5stack_unit_cam.build.flash_size=4MB
m5stack_unit_cam.build.flash_freq=80m
m5stack_unit_cam.build.flash_mode=dio
m5stack_unit_cam.build.boot=dio
m5stack_unit_cam.build.partitions=default
m5stack_unit_cam.build.defines=
m5stack_unit_cam.build.loop_core=
m5stack_unit_cam.build.event_core=

m5stack_unit_cam.menu.PSRAM.enabled=Enabled
m5stack_unit_cam.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
m5stack_unit_cam.menu.PSRAM.enabled.build.extra_libs=
m5stack_unit_cam.menu.PSRAM.disabled=Disabled
m5stack_unit_cam.menu.PSRAM.disabled.build.defines=
m5stack_unit_cam.menu.PSRAM.disabled.build.extra_libs=

m5stack_unit_cam.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.default.build.partitions=default
m5stack_unit_cam.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack_unit_cam.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack_unit_cam.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack_unit_cam.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack_unit_cam.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack_unit_cam.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack_unit_cam.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack_unit_cam.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack_unit_cam.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack_unit_cam.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack_unit_cam.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack_unit_cam.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack_unit_cam.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack_unit_cam.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack_unit_cam.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack_unit_cam.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack_unit_cam.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack_unit_cam.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack_unit_cam.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack_unit_cam.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack_unit_cam.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack_unit_cam.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack_unit_cam.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack_unit_cam.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack_unit_cam.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack_unit_cam.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack_unit_cam.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack_unit_cam.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack_unit_cam.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack_unit_cam.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack_unit_cam.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack_unit_cam.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack_unit_cam.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack_unit_cam.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack_unit_cam.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack_unit_cam.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack_unit_cam.menu.FlashMode.qio=QIO
m5stack_unit_cam.menu.FlashMode.qio.build.flash_mode=dio
m5stack_unit_cam.menu.FlashMode.qio.build.boot=qio
m5stack_unit_cam.menu.FlashMode.dio=DIO
m5stack_unit_cam.menu.FlashMode.dio.build.flash_mode=dio
m5stack_unit_cam.menu.FlashMode.dio.build.boot=dio
m5stack_unit_cam.menu.FlashMode.qout=QOUT
m5stack_unit_cam.menu.FlashMode.qout.build.flash_mode=dout
m5stack_unit_cam.menu.FlashMode.qout.build.boot=qout
m5stack_unit_cam.menu.FlashMode.dout=DOUT
m5stack_unit_cam.menu.FlashMode.dout.build.flash_mode=dout
m5stack_unit_cam.menu.FlashMode.dout.build.boot=dout

m5stack_unit_cam.menu.FlashFreq.80=80MHz
m5stack_unit_cam.menu.FlashFreq.80.build.flash_freq=80m
m5stack_unit_cam.menu.FlashFreq.40=40MHz
m5stack_unit_cam.menu.FlashFreq.40.build.flash_freq=40m

m5stack_unit_cam.menu.FlashSize.4M=4MB (32Mb)
m5stack_unit_cam.menu.FlashSize.4M.build.flash_size=4MB

m5stack_unit_cam.menu.UploadSpeed.1500000=1500000
m5stack_unit_cam.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack_unit_cam.menu.UploadSpeed.750000=750000
m5stack_unit_cam.menu.UploadSpeed.750000.upload.speed=750000
m5stack_unit_cam.menu.UploadSpeed.500000=500000
m5stack_unit_cam.menu.UploadSpeed.500000.upload.speed=500000
m5stack_unit_cam.menu.UploadSpeed.250000=250000
m5stack_unit_cam.menu.UploadSpeed.250000.upload.speed=250000
m5stack_unit_cam.menu.UploadSpeed.115200=115200
m5stack_unit_cam.menu.UploadSpeed.115200.upload.speed=115200

m5stack_unit_cam.menu.LoopCore.1=Core 1
m5stack_unit_cam.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack_unit_cam.menu.LoopCore.0=Core 0
m5stack_unit_cam.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

