espressif/arduino-esp32/boards.txt
m5stack_unit_cams3.menu.MSCOnBoot.default=Disabled
m5stack_unit_cams3.menu.MSCOnBoot.default.build.msc_on_boot=0
m5stack_unit_cams3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
m5stack_unit_cams3.menu.MSCOnBoot.msc.build.msc_on_boot=1

m5stack_unit_cams3.menu.DFUOnBoot.default=Disabled
m5stack_unit_cams3.menu.DFUOnBoot.default.build.dfu_on_boot=0
m5stack_unit_cams3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
m5stack_unit_cams3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

m5stack_unit_cams3.menu.UploadMode.default=UART0 / Hardware CDC
m5stack_unit_cams3.menu.UploadMode.default.upload.use_1200bps_touch=false
m5stack_unit_cams3.menu.UploadMode.default.upload.wait_for_upload_port=false
m5stack_unit_cams3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
m5stack_unit_cams3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
m5stack_unit_cams3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

m5stack_unit_cams3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
m5stack_unit_cams3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
m5stack_unit_cams3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
m5stack_unit_cams3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.default.build.partitions=default
m5stack_unit_cams3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack_unit_cams3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack_unit_cams3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack_unit_cams3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack_unit_cams3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack_unit_cams3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack_unit_cams3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack_unit_cams3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack_unit_cams3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack_unit_cams3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack_unit_cams3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack_unit_cams3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack_unit_cams3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack_unit_cams3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack_unit_cams3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack_unit_cams3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack_unit_cams3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack_unit_cams3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack_unit_cams3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack_unit_cams3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
m5stack_unit_cams3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
m5stack_unit_cams3.menu.PartitionScheme.fatflash.build.partitions=ffat
m5stack_unit_cams3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
m5stack_unit_cams3.menu.PartitionScheme.rainmaker=RainMaker 4MB
m5stack_unit_cams3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
m5stack_unit_cams3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
m5stack_unit_cams3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
m5stack_unit_cams3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
m5stack_unit_cams3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
m5stack_unit_cams3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
m5stack_unit_cams3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
m5stack_unit_cams3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
m5stack_unit_cams3.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
m5stack_unit_cams3.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
m5stack_unit_cams3.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
m5stack_unit_cams3.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
m5stack_unit_cams3.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
m5stack_unit_cams3.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
m5stack_unit_cams3.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
m5stack_unit_cams3.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
m5stack_unit_cams3.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
m5stack_unit_cams3.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
m5stack_unit_cams3.menu.PartitionScheme.custom=Custom
m5stack_unit_cams3.menu.PartitionScheme.custom.build.partitions=
m5stack_unit_cams3.menu.PartitionScheme.custom.upload.maximum_size=16777216

m5stack_unit_cams3.menu.CPUFreq.240=240MHz (WiFi)
m5stack_unit_cams3.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack_unit_cams3.menu.CPUFreq.160=160MHz (WiFi)
m5stack_unit_cams3.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack_unit_cams3.menu.CPUFreq.80=80MHz (WiFi)
m5stack_unit_cams3.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack_unit_cams3.menu.CPUFreq.40=40MHz
m5stack_unit_cams3.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack_unit_cams3.menu.CPUFreq.20=20MHz
m5stack_unit_cams3.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack_unit_cams3.menu.CPUFreq.10=10MHz
m5stack_unit_cams3.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack_unit_cams3.menu.UploadSpeed.921600=921600
m5stack_unit_cams3.menu.UploadSpeed.921600.upload.speed=921600
m5stack_unit_cams3.menu.UploadSpeed.115200=115200
m5stack_unit_cams3.menu.UploadSpeed.115200.upload.speed=115200
m5stack_unit_cams3.menu.UploadSpeed.256000.windows=256000
m5stack_unit_cams3.menu.UploadSpeed.256000.upload.speed=256000
m5stack_unit_cams3.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack_unit_cams3.menu.UploadSpeed.230400=230400
m5stack_unit_cams3.menu.UploadSpeed.230400.upload.speed=230400
m5stack_unit_cams3.menu.UploadSpeed.460800.linux=460800
m5stack_unit_cams3.menu.UploadSpeed.460800.macosx=460800
m5stack_unit_cams3.menu.UploadSpeed.460800.upload.speed=460800
m5stack_unit_cams3.menu.UploadSpeed.512000.windows=512000
m5stack_unit_cams3.menu.UploadSpeed.512000.upload.speed=512000

m5stack_unit_cams3.menu.DebugLevel.none=None
m5stack_unit_cams3.menu.DebugLevel.none.build.code_debug=0
m5stack_unit_cams3.menu.DebugLevel.error=Error
m5stack_unit_cams3.menu.DebugLevel.error.build.code_debug=1
m5stack_unit_cams3.menu.DebugLevel.warn=Warn
m5stack_unit_cams3.menu.DebugLevel.warn.build.code_debug=2
m5stack_unit_cams3.menu.DebugLevel.info=Info
m5stack_unit_cams3.menu.DebugLevel.info.build.code_debug=3
m5stack_unit_cams3.menu.DebugLevel.debug=Debug
m5stack_unit_cams3.menu.DebugLevel.debug.build.code_debug=4
m5stack_unit_cams3.menu.DebugLevel.verbose=Verbose
m5stack_unit_cams3.menu.DebugLevel.verbose.build.code_debug=5

m5stack_unit_cams3.menu.EraseFlash.none=Disabled
m5stack_unit_cams3.menu.EraseFlash.none.upload.erase_cmd=
m5stack_unit_cams3.menu.EraseFlash.all=Enabled
m5stack_unit_cams3.menu.EraseFlash.all.upload.erase_cmd=-e

