espressif/arduino-esp32/boards.txt
m5stack_stamp_pico.menu.FlashMode.qio=QIO
m5stack_stamp_pico.menu.FlashMode.qio.build.flash_mode=dio
m5stack_stamp_pico.menu.FlashMode.qio.build.boot=qio
m5stack_stamp_pico.menu.FlashMode.dio=DIO
m5stack_stamp_pico.menu.FlashMode.dio.build.flash_mode=dio
m5stack_stamp_pico.menu.FlashMode.dio.build.boot=dio
m5stack_stamp_pico.menu.FlashMode.qout=QOUT
m5stack_stamp_pico.menu.FlashMode.qout.build.flash_mode=dout
m5stack_stamp_pico.menu.FlashMode.qout.build.boot=qout
m5stack_stamp_pico.menu.FlashMode.dout=DOUT
m5stack_stamp_pico.menu.FlashMode.dout.build.flash_mode=dout
m5stack_stamp_pico.menu.FlashMode.dout.build.boot=dout

m5stack_stamp_pico.menu.FlashFreq.80=80MHz
m5stack_stamp_pico.menu.FlashFreq.80.build.flash_freq=80m
m5stack_stamp_pico.menu.FlashFreq.40=40MHz
m5stack_stamp_pico.menu.FlashFreq.40.build.flash_freq=40m

m5stack_stamp_pico.menu.FlashSize.4M=4MB (32Mb)
m5stack_stamp_pico.menu.FlashSize.4M.build.flash_size=4MB

m5stack_stamp_pico.menu.UploadSpeed.1500000=1500000
m5stack_stamp_pico.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack_stamp_pico.menu.UploadSpeed.750000=750000
m5stack_stamp_pico.menu.UploadSpeed.750000.upload.speed=750000
m5stack_stamp_pico.menu.UploadSpeed.500000=500000
m5stack_stamp_pico.menu.UploadSpeed.500000.upload.speed=500000
m5stack_stamp_pico.menu.UploadSpeed.250000=250000
m5stack_stamp_pico.menu.UploadSpeed.250000.upload.speed=250000
m5stack_stamp_pico.menu.UploadSpeed.115200=115200
m5stack_stamp_pico.menu.UploadSpeed.115200.upload.speed=115200

m5stack_stamp_pico.menu.LoopCore.1=Core 1
m5stack_stamp_pico.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack_stamp_pico.menu.LoopCore.0=Core 0
m5stack_stamp_pico.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

m5stack_stamp_pico.menu.EventsCore.1=Core 1
m5stack_stamp_pico.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack_stamp_pico.menu.EventsCore.0=Core 0
m5stack_stamp_pico.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack_stamp_pico.menu.DebugLevel.none=None
m5stack_stamp_pico.menu.DebugLevel.none.build.code_debug=0
m5stack_stamp_pico.menu.DebugLevel.error=Error
m5stack_stamp_pico.menu.DebugLevel.error.build.code_debug=1
m5stack_stamp_pico.menu.DebugLevel.warn=Warn
m5stack_stamp_pico.menu.DebugLevel.warn.build.code_debug=2
m5stack_stamp_pico.menu.DebugLevel.info=Info
m5stack_stamp_pico.menu.DebugLevel.info.build.code_debug=3
m5stack_stamp_pico.menu.DebugLevel.debug=Debug
m5stack_stamp_pico.menu.DebugLevel.debug.build.code_debug=4
m5stack_stamp_pico.menu.DebugLevel.verbose=Verbose
m5stack_stamp_pico.menu.DebugLevel.verbose.build.code_debug=5

m5stack_stamp_pico.menu.EraseFlash.none=Disabled
m5stack_stamp_pico.menu.EraseFlash.none.upload.erase_cmd=
m5stack_stamp_pico.menu.EraseFlash.all=Enabled
m5stack_stamp_pico.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack_stamp_c3.name=M5StampC3

m5stack_stamp_c3.bootloader.tool=esptool_py
m5stack_stamp_c3.bootloader.tool.default=esptool_py

m5stack_stamp_c3.upload.tool=esptool_py
m5stack_stamp_c3.upload.tool.default=esptool_py
m5stack_stamp_c3.upload.tool.network=esp_ota

m5stack_stamp_c3.upload.maximum_size=1310720
m5stack_stamp_c3.upload.maximum_data_size=327680
m5stack_stamp_c3.upload.wait_for_upload_port=false
m5stack_stamp_c3.upload.flags=
m5stack_stamp_c3.upload.extra_flags=

m5stack_stamp_c3.serial.disableDTR=false
m5stack_stamp_c3.serial.disableRTS=false

m5stack_stamp_c3.build.tarch=riscv32
m5stack_stamp_c3.build.target=esp
m5stack_stamp_c3.build.mcu=esp32c3
m5stack_stamp_c3.build.core=esp32
m5stack_stamp_c3.build.variant=m5stack_stamp_c3
m5stack_stamp_c3.build.board=M5STACK_STAMP_C3
m5stack_stamp_c3.build.bootloader_addr=0x0

m5stack_stamp_c3.build.cdc_on_boot=1
m5stack_stamp_c3.build.f_cpu=160000000L
m5stack_stamp_c3.build.flash_size=4MB
m5stack_stamp_c3.build.flash_freq=80m
m5stack_stamp_c3.build.flash_mode=qio
m5stack_stamp_c3.build.boot=qio
m5stack_stamp_c3.build.partitions=default
m5stack_stamp_c3.build.defines=

## IDE 2.0 Seems to not update the value
m5stack_stamp_c3.menu.JTAGAdapter.default=Disabled
m5stack_stamp_c3.menu.JTAGAdapter.default.build.copy_jtag_files=0
m5stack_stamp_c3.menu.JTAGAdapter.builtin=Integrated USB JTAG
m5stack_stamp_c3.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
m5stack_stamp_c3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
m5stack_stamp_c3.menu.JTAGAdapter.external=FTDI Adapter
m5stack_stamp_c3.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
m5stack_stamp_c3.menu.JTAGAdapter.external.build.copy_jtag_files=1
m5stack_stamp_c3.menu.JTAGAdapter.bridge=ESP USB Bridge
m5stack_stamp_c3.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
m5stack_stamp_c3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

m5stack_stamp_c3.menu.CDCOnBoot.cdc=Enabled
m5stack_stamp_c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
m5stack_stamp_c3.menu.CDCOnBoot.default=Disabled
m5stack_stamp_c3.menu.CDCOnBoot.default.build.cdc_on_boot=0

m5stack_stamp_c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack_stamp_c3.menu.PartitionScheme.default.build.partitions=default
m5stack_stamp_c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack_stamp_c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack_stamp_c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack_stamp_c3.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack_stamp_c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack_stamp_c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack_stamp_c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack_stamp_c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack_stamp_c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack_stamp_c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack_stamp_c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack_stamp_c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack_stamp_c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack_stamp_c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack_stamp_c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack_stamp_c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack_stamp_c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack_stamp_c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack_stamp_c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack_stamp_c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack_stamp_c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack_stamp_c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080


