espressif/arduino-esp32/boards.txt
##############################################################

bpi-bit.name=BPI-BIT

bpi-bit.bootloader.tool=esptool_py
bpi-bit.bootloader.tool.default=esptool_py

bpi-bit.upload.tool=esptool_py
bpi-bit.upload.tool.default=esptool_py
bpi-bit.upload.tool.network=esp_ota

bpi-bit.upload.maximum_size=1310720
bpi-bit.upload.maximum_data_size=294912
bpi-bit.upload.flags=
bpi-bit.upload.extra_flags=

bpi-bit.serial.disableDTR=true
bpi-bit.serial.disableRTS=true

bpi-bit.build.tarch=xtensa
bpi-bit.build.bootloader_addr=0x1000
bpi-bit.build.target=esp32
bpi-bit.build.mcu=esp32
bpi-bit.build.core=esp32
bpi-bit.build.variant=bpi-bit
bpi-bit.build.board=BPI_BIT

bpi-bit.build.f_cpu=160000000L
bpi-bit.build.flash_mode=dio
bpi-bit.build.flash_size=4MB
bpi-bit.build.boot=dio
bpi-bit.build.partitions=default

bpi-bit.menu.FlashFreq.80=80MHz
bpi-bit.menu.FlashFreq.80.build.flash_freq=80m
bpi-bit.menu.FlashFreq.40=40MHz
bpi-bit.menu.FlashFreq.40.build.flash_freq=40m

bpi-bit.menu.UploadSpeed.921600=921600
bpi-bit.menu.UploadSpeed.921600.upload.speed=921600
bpi-bit.menu.UploadSpeed.115200=115200
bpi-bit.menu.UploadSpeed.115200.upload.speed=115200
bpi-bit.menu.UploadSpeed.256000.windows=256000
bpi-bit.menu.UploadSpeed.256000.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400.windows.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400=230400
bpi-bit.menu.UploadSpeed.230400.upload.speed=230400
bpi-bit.menu.UploadSpeed.460800.linux=460800
bpi-bit.menu.UploadSpeed.460800.macosx=460800
bpi-bit.menu.UploadSpeed.460800.upload.speed=460800
bpi-bit.menu.UploadSpeed.512000.windows=512000
bpi-bit.menu.UploadSpeed.512000.upload.speed=512000

bpi-bit.menu.DebugLevel.none=None
bpi-bit.menu.DebugLevel.none.build.code_debug=0
bpi-bit.menu.DebugLevel.error=Error
bpi-bit.menu.DebugLevel.error.build.code_debug=1
bpi-bit.menu.DebugLevel.warn=Warn
bpi-bit.menu.DebugLevel.warn.build.code_debug=2
bpi-bit.menu.DebugLevel.info=Info
bpi-bit.menu.DebugLevel.info.build.code_debug=3
bpi-bit.menu.DebugLevel.debug=Debug
bpi-bit.menu.DebugLevel.debug.build.code_debug=4
bpi-bit.menu.DebugLevel.verbose=Verbose
bpi-bit.menu.DebugLevel.verbose.build.code_debug=5

bpi-bit.menu.EraseFlash.none=Disabled
bpi-bit.menu.EraseFlash.none.upload.erase_cmd=
bpi-bit.menu.EraseFlash.all=Enabled
bpi-bit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

bpi_leaf_s3.name=BPI-Leaf-S3
bpi_leaf_s3.vid.0=0x303a
bpi_leaf_s3.pid.0=0x80df

bpi_leaf_s3.bootloader.tool=esptool_py
bpi_leaf_s3.bootloader.tool.default=esptool_py

bpi_leaf_s3.upload.tool=esptool_py
bpi_leaf_s3.upload.tool.default=esptool_py
bpi_leaf_s3.upload.tool.network=esp_ota

bpi_leaf_s3.upload.maximum_size=1310720
bpi_leaf_s3.upload.maximum_data_size=327680
bpi_leaf_s3.upload.flags=
bpi_leaf_s3.upload.extra_flags=
bpi_leaf_s3.upload.use_1200bps_touch=false
bpi_leaf_s3.upload.wait_for_upload_port=false

bpi_leaf_s3.serial.disableDTR=false
bpi_leaf_s3.serial.disableRTS=false

bpi_leaf_s3.build.tarch=xtensa
bpi_leaf_s3.build.bootloader_addr=0x0
bpi_leaf_s3.build.target=esp32s3
bpi_leaf_s3.build.mcu=esp32s3
bpi_leaf_s3.build.core=esp32
bpi_leaf_s3.build.variant=bpi_leaf_s3
bpi_leaf_s3.build.board=BPI_LEAF_S3

bpi_leaf_s3.build.usb_mode=1
bpi_leaf_s3.build.cdc_on_boot=0
bpi_leaf_s3.build.msc_on_boot=0
bpi_leaf_s3.build.dfu_on_boot=0
bpi_leaf_s3.build.f_cpu=240000000L
bpi_leaf_s3.build.flash_size=8MB
bpi_leaf_s3.build.flash_freq=80m
bpi_leaf_s3.build.flash_mode=dio
bpi_leaf_s3.build.boot=qio
bpi_leaf_s3.build.boot_freq=80m
bpi_leaf_s3.build.partitions=default
bpi_leaf_s3.build.defines=
bpi_leaf_s3.build.loop_core=
bpi_leaf_s3.build.event_core=
bpi_leaf_s3.build.psram_type=qspi
bpi_leaf_s3.build.memory_type={build.boot}_{build.psram_type}

bpi_leaf_s3.menu.PSRAM.enabled=QSPI PSRAM
bpi_leaf_s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
bpi_leaf_s3.menu.PSRAM.enabled.build.psram_type=qspi
bpi_leaf_s3.menu.PSRAM.disabled=Disabled
bpi_leaf_s3.menu.PSRAM.disabled.build.defines=
bpi_leaf_s3.menu.PSRAM.disabled.build.psram_type=qspi
bpi_leaf_s3.menu.PSRAM.opi=OPI PSRAM
bpi_leaf_s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
bpi_leaf_s3.menu.PSRAM.opi.build.psram_type=opi

bpi_leaf_s3.menu.FlashMode.qio=QIO 80MHz
bpi_leaf_s3.menu.FlashMode.qio.build.flash_mode=dio
bpi_leaf_s3.menu.FlashMode.qio.build.boot=qio
bpi_leaf_s3.menu.FlashMode.qio.build.boot_freq=80m
bpi_leaf_s3.menu.FlashMode.qio.build.flash_freq=80m
bpi_leaf_s3.menu.FlashMode.qio120=QIO 120MHz
bpi_leaf_s3.menu.FlashMode.qio120.build.flash_mode=dio
bpi_leaf_s3.menu.FlashMode.qio120.build.boot=qio
bpi_leaf_s3.menu.FlashMode.qio120.build.boot_freq=120m
bpi_leaf_s3.menu.FlashMode.qio120.build.flash_freq=80m
bpi_leaf_s3.menu.FlashMode.dio=DIO 80MHz
bpi_leaf_s3.menu.FlashMode.dio.build.flash_mode=dio
bpi_leaf_s3.menu.FlashMode.dio.build.boot=dio
bpi_leaf_s3.menu.FlashMode.dio.build.boot_freq=80m
bpi_leaf_s3.menu.FlashMode.dio.build.flash_freq=80m
bpi_leaf_s3.menu.FlashMode.opi=OPI 80MHz
bpi_leaf_s3.menu.FlashMode.opi.build.flash_mode=dout
bpi_leaf_s3.menu.FlashMode.opi.build.boot=opi
bpi_leaf_s3.menu.FlashMode.opi.build.boot_freq=80m
bpi_leaf_s3.menu.FlashMode.opi.build.flash_freq=80m

bpi_leaf_s3.menu.FlashSize.8M=8MB (64Mb)
bpi_leaf_s3.menu.FlashSize.8M.build.flash_size=8MB
bpi_leaf_s3.menu.FlashSize.4M=4MB (32Mb)
bpi_leaf_s3.menu.FlashSize.4M.build.flash_size=4MB
bpi_leaf_s3.menu.FlashSize.16M=16MB (128Mb)
bpi_leaf_s3.menu.FlashSize.16M.build.flash_size=16MB
#bpi_leaf_s3.menu.FlashSize.32M=32MB (256Mb)
#bpi_leaf_s3.menu.FlashSize.32M.build.flash_size=32MB

bpi_leaf_s3.menu.LoopCore.1=Core 1
bpi_leaf_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
bpi_leaf_s3.menu.LoopCore.0=Core 0
bpi_leaf_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

bpi_leaf_s3.menu.EventsCore.1=Core 1
bpi_leaf_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
bpi_leaf_s3.menu.EventsCore.0=Core 0
bpi_leaf_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

bpi_leaf_s3.menu.USBMode.default=USB-OTG (TinyUSB)
bpi_leaf_s3.menu.USBMode.default.build.usb_mode=0
bpi_leaf_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
bpi_leaf_s3.menu.USBMode.hwcdc.build.usb_mode=1

bpi_leaf_s3.menu.CDCOnBoot.cdc=Enabled
bpi_leaf_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
bpi_leaf_s3.menu.CDCOnBoot.default=Disabled
bpi_leaf_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

bpi_leaf_s3.menu.MSCOnBoot.default=Disabled
bpi_leaf_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
bpi_leaf_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
bpi_leaf_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

bpi_leaf_s3.menu.DFUOnBoot.default=Disabled
bpi_leaf_s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
bpi_leaf_s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
bpi_leaf_s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

bpi_leaf_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
bpi_leaf_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
bpi_leaf_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
bpi_leaf_s3.menu.UploadMode.default=UART0 / Hardware CDC
bpi_leaf_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
bpi_leaf_s3.menu.UploadMode.default.upload.wait_for_upload_port=false

bpi_leaf_s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
bpi_leaf_s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
bpi_leaf_s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.default.build.partitions=default
bpi_leaf_s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
bpi_leaf_s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
bpi_leaf_s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.minimal.build.partitions=minimal
bpi_leaf_s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
bpi_leaf_s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
bpi_leaf_s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
bpi_leaf_s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
bpi_leaf_s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
bpi_leaf_s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
bpi_leaf_s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
bpi_leaf_s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
bpi_leaf_s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
bpi_leaf_s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
bpi_leaf_s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
bpi_leaf_s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
bpi_leaf_s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
bpi_leaf_s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
bpi_leaf_s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
bpi_leaf_s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
bpi_leaf_s3.menu.PartitionScheme.fatflash.build.partitions=ffat
bpi_leaf_s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
bpi_leaf_s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
bpi_leaf_s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
bpi_leaf_s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
bpi_leaf_s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
bpi_leaf_s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
bpi_leaf_s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
bpi_leaf_s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
bpi_leaf_s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
bpi_leaf_s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
bpi_leaf_s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
bpi_leaf_s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
bpi_leaf_s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

bpi_leaf_s3.menu.CPUFreq.240=240MHz (WiFi)
bpi_leaf_s3.menu.CPUFreq.240.build.f_cpu=240000000L
bpi_leaf_s3.menu.CPUFreq.160=160MHz (WiFi)
bpi_leaf_s3.menu.CPUFreq.160.build.f_cpu=160000000L
bpi_leaf_s3.menu.CPUFreq.80=80MHz (WiFi)
bpi_leaf_s3.menu.CPUFreq.80.build.f_cpu=80000000L
bpi_leaf_s3.menu.CPUFreq.40=40MHz
bpi_leaf_s3.menu.CPUFreq.40.build.f_cpu=40000000L
bpi_leaf_s3.menu.CPUFreq.20=20MHz
bpi_leaf_s3.menu.CPUFreq.20.build.f_cpu=20000000L
bpi_leaf_s3.menu.CPUFreq.10=10MHz
bpi_leaf_s3.menu.CPUFreq.10.build.f_cpu=10000000L

bpi_leaf_s3.menu.UploadSpeed.921600=921600
bpi_leaf_s3.menu.UploadSpeed.921600.upload.speed=921600
bpi_leaf_s3.menu.UploadSpeed.115200=115200
bpi_leaf_s3.menu.UploadSpeed.115200.upload.speed=115200
bpi_leaf_s3.menu.UploadSpeed.256000.windows=256000
bpi_leaf_s3.menu.UploadSpeed.256000.upload.speed=256000
bpi_leaf_s3.menu.UploadSpeed.230400.windows.upload.speed=256000
bpi_leaf_s3.menu.UploadSpeed.230400=230400
bpi_leaf_s3.menu.UploadSpeed.230400.upload.speed=230400
bpi_leaf_s3.menu.UploadSpeed.460800.linux=460800
bpi_leaf_s3.menu.UploadSpeed.460800.macosx=460800
bpi_leaf_s3.menu.UploadSpeed.460800.upload.speed=460800
bpi_leaf_s3.menu.UploadSpeed.512000.windows=512000
bpi_leaf_s3.menu.UploadSpeed.512000.upload.speed=512000

