espressif/arduino-esp32/boards.txt
fm-devkit.menu.DebugLevel.none=None
fm-devkit.menu.DebugLevel.none.build.code_debug=0
fm-devkit.menu.DebugLevel.error=Error
fm-devkit.menu.DebugLevel.error.build.code_debug=1
fm-devkit.menu.DebugLevel.warn=Warn
fm-devkit.menu.DebugLevel.warn.build.code_debug=2
fm-devkit.menu.DebugLevel.info=Info
fm-devkit.menu.DebugLevel.info.build.code_debug=3
fm-devkit.menu.DebugLevel.debug=Debug
fm-devkit.menu.DebugLevel.debug.build.code_debug=4
fm-devkit.menu.DebugLevel.verbose=Verbose
fm-devkit.menu.DebugLevel.verbose.build.code_debug=5

fm-devkit.menu.EraseFlash.none=Disabled
fm-devkit.menu.EraseFlash.none.upload.erase_cmd=
fm-devkit.menu.EraseFlash.all=Enabled
fm-devkit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
### Fri3d Badge 2024 (ESP32-S3-WROOM-1)

fri3d_2024_esp32s3.name=Fri3d Badge 2024 (ESP32-S3-WROOM-1)

fri3d_2024_esp32s3.bootloader.tool=esptool_py
fri3d_2024_esp32s3.bootloader.tool.default=esptool_py

fri3d_2024_esp32s3.upload.tool=esptool_py
fri3d_2024_esp32s3.upload.tool.default=esptool_py
fri3d_2024_esp32s3.upload.tool.network=esp_ota

fri3d_2024_esp32s3.upload.maximum_size=1310720
fri3d_2024_esp32s3.upload.maximum_data_size=327680
fri3d_2024_esp32s3.upload.flags=
fri3d_2024_esp32s3.upload.extra_flags=
fri3d_2024_esp32s3.upload.use_1200bps_touch=false
fri3d_2024_esp32s3.upload.wait_for_upload_port=false

fri3d_2024_esp32s3.serial.disableDTR=false
fri3d_2024_esp32s3.serial.disableRTS=false

fri3d_2024_esp32s3.build.tarch=xtensa
fri3d_2024_esp32s3.build.bootloader_addr=0x0
fri3d_2024_esp32s3.build.target=esp32s3
fri3d_2024_esp32s3.build.mcu=esp32s3
fri3d_2024_esp32s3.build.core=esp32
fri3d_2024_esp32s3.build.variant=fri3d_2024_esp32s3
fri3d_2024_esp32s3.build.board=FRI3D_2024_ESP32S3

fri3d_2024_esp32s3.build.usb_mode=1
fri3d_2024_esp32s3.build.cdc_on_boot=0
fri3d_2024_esp32s3.build.msc_on_boot=0
fri3d_2024_esp32s3.build.dfu_on_boot=0
fri3d_2024_esp32s3.build.f_cpu=240000000L
fri3d_2024_esp32s3.build.flash_size=16MB
fri3d_2024_esp32s3.build.flash_freq=80m
fri3d_2024_esp32s3.build.flash_mode=dio
fri3d_2024_esp32s3.build.boot=qio
fri3d_2024_esp32s3.build.boot_freq=80m
fri3d_2024_esp32s3.build.partitions=default
fri3d_2024_esp32s3.build.defines=
fri3d_2024_esp32s3.build.loop_core=
fri3d_2024_esp32s3.build.event_core=
fri3d_2024_esp32s3.build.psram_type=opi
fri3d_2024_esp32s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
fri3d_2024_esp32s3.menu.JTAGAdapter.default=Disabled
fri3d_2024_esp32s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
fri3d_2024_esp32s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
fri3d_2024_esp32s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
fri3d_2024_esp32s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
fri3d_2024_esp32s3.menu.JTAGAdapter.external=FTDI Adapter
fri3d_2024_esp32s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
fri3d_2024_esp32s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
fri3d_2024_esp32s3.menu.JTAGAdapter.bridge=ESP USB Bridge
fri3d_2024_esp32s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
fri3d_2024_esp32s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

fri3d_2024_esp32s3.menu.PSRAM.default=OPI PSRAM
fri3d_2024_esp32s3.menu.PSRAM.default.build.defines=-DBOARD_HAS_PSRAM
fri3d_2024_esp32s3.menu.PSRAM.default.build.psram_type=opi
fri3d_2024_esp32s3.menu.PSRAM.disabled=Disabled
fri3d_2024_esp32s3.menu.PSRAM.disabled.build.defines=
fri3d_2024_esp32s3.menu.PSRAM.disabled.build.psram_type=qspi

fri3d_2024_esp32s3.menu.FlashMode.qio=QIO 80MHz
fri3d_2024_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
fri3d_2024_esp32s3.menu.FlashMode.qio.build.boot=qio
fri3d_2024_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
fri3d_2024_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
fri3d_2024_esp32s3.menu.FlashMode.qio120=QIO 120MHz
fri3d_2024_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
fri3d_2024_esp32s3.menu.FlashMode.qio120.build.boot=qio
fri3d_2024_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
fri3d_2024_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
fri3d_2024_esp32s3.menu.FlashMode.dio=DIO 80MHz
fri3d_2024_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
fri3d_2024_esp32s3.menu.FlashMode.dio.build.boot=dio
fri3d_2024_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
fri3d_2024_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
fri3d_2024_esp32s3.menu.FlashMode.opi=OPI 80MHz
fri3d_2024_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
fri3d_2024_esp32s3.menu.FlashMode.opi.build.boot=opi
fri3d_2024_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
fri3d_2024_esp32s3.menu.FlashMode.opi.build.flash_freq=80m

fri3d_2024_esp32s3.menu.FlashSize.default=16MB (128Mb)
fri3d_2024_esp32s3.menu.FlashSize.default.build.flash_size=16MB

fri3d_2024_esp32s3.menu.LoopCore.1=Core 1
fri3d_2024_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
fri3d_2024_esp32s3.menu.LoopCore.0=Core 0
fri3d_2024_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

fri3d_2024_esp32s3.menu.EventsCore.1=Core 1
fri3d_2024_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
fri3d_2024_esp32s3.menu.EventsCore.0=Core 0
fri3d_2024_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

fri3d_2024_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
fri3d_2024_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1
fri3d_2024_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
fri3d_2024_esp32s3.menu.USBMode.default.build.usb_mode=0

fri3d_2024_esp32s3.menu.CDCOnBoot.default=Enabled
fri3d_2024_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=1
fri3d_2024_esp32s3.menu.CDCOnBoot.disabled=Disabled
fri3d_2024_esp32s3.menu.CDCOnBoot.disabled.build.cdc_on_boot=0

fri3d_2024_esp32s3.menu.MSCOnBoot.default=Disabled
fri3d_2024_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
fri3d_2024_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
fri3d_2024_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

fri3d_2024_esp32s3.menu.DFUOnBoot.default=Disabled
fri3d_2024_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
fri3d_2024_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
fri3d_2024_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

