espressif/arduino-esp32/boards.txt
##############################################################

wifiduino32.name=WiFiduino32

wifiduino32.bootloader.tool=esptool_py
wifiduino32.bootloader.tool.default=esptool_py

wifiduino32.upload.tool=esptool_py
wifiduino32.upload.tool.default=esptool_py
wifiduino32.upload.tool.network=esp_ota

wifiduino32.upload.maximum_size=1310720
wifiduino32.upload.maximum_data_size=327680
wifiduino32.upload.wait_for_upload_port=true
wifiduino32.upload.flags=
wifiduino32.upload.extra_flags=

wifiduino32.serial.disableDTR=true
wifiduino32.serial.disableRTS=true

wifiduino32.build.tarch=xtensa
wifiduino32.build.bootloader_addr=0x1000
wifiduino32.build.target=esp32
wifiduino32.build.mcu=esp32
wifiduino32.build.core=esp32
wifiduino32.build.variant=wifiduino32
wifiduino32.build.board=Wifiduino32

wifiduino32.build.f_cpu=240000000L
wifiduino32.build.flash_mode=dio
wifiduino32.build.flash_size=4MB
wifiduino32.build.boot=dio
wifiduino32.build.partitions=default
wifiduino32.build.defines=

wifiduino32.menu.PartitionScheme.default=Default
wifiduino32.menu.PartitionScheme.default.build.partitions=default
wifiduino32.menu.PartitionScheme.no_ota=No OTA (Large APP)
wifiduino32.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
wifiduino32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

wifiduino32.menu.FlashFreq.80=80MHz
wifiduino32.menu.FlashFreq.80.build.flash_freq=80m
wifiduino32.menu.FlashFreq.40=40MHz
wifiduino32.menu.FlashFreq.40.build.flash_freq=40m

wifiduino32.menu.UploadSpeed.921600=921600
wifiduino32.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32.menu.UploadSpeed.115200=115200
wifiduino32.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32.menu.UploadSpeed.256000.windows=256000
wifiduino32.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32.menu.UploadSpeed.230400=230400
wifiduino32.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32.menu.UploadSpeed.460800.linux=460800
wifiduino32.menu.UploadSpeed.460800.macosx=460800
wifiduino32.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32.menu.UploadSpeed.512000.windows=512000
wifiduino32.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32.menu.DebugLevel.none=None
wifiduino32.menu.DebugLevel.none.build.code_debug=0
wifiduino32.menu.DebugLevel.error=Error
wifiduino32.menu.DebugLevel.error.build.code_debug=1
wifiduino32.menu.DebugLevel.warn=Warn
wifiduino32.menu.DebugLevel.warn.build.code_debug=2
wifiduino32.menu.DebugLevel.info=Info
wifiduino32.menu.DebugLevel.info.build.code_debug=3
wifiduino32.menu.DebugLevel.debug=Debug
wifiduino32.menu.DebugLevel.debug.build.code_debug=4
wifiduino32.menu.DebugLevel.verbose=Verbose
wifiduino32.menu.DebugLevel.verbose.build.code_debug=5

wifiduino32.menu.EraseFlash.none=Disabled
wifiduino32.menu.EraseFlash.none.upload.erase_cmd=
wifiduino32.menu.EraseFlash.all=Enabled
wifiduino32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wifiduino32c3.name=WiFiduinoV2

wifiduino32c3.bootloader.tool=esptool_py
wifiduino32c3.bootloader.tool.default=esptool_py

wifiduino32c3.upload.tool=esptool_py
wifiduino32c3.upload.tool.default=esptool_py
wifiduino32c3.upload.tool.network=esp_ota

wifiduino32c3.upload.maximum_size=1310720
wifiduino32c3.upload.maximum_data_size=327680
wifiduino32c3.upload.flags=
wifiduino32c3.upload.extra_flags=
wifiduino32c3.upload.use_1200bps_touch=false
wifiduino32c3.upload.wait_for_upload_port=false

wifiduino32c3.serial.disableDTR=false
wifiduino32c3.serial.disableRTS=false

wifiduino32c3.build.tarch=riscv32
wifiduino32c3.build.target=esp
wifiduino32c3.build.mcu=esp32c3
wifiduino32c3.build.core=esp32
wifiduino32c3.build.variant=wifiduinov2
wifiduino32c3.build.board=WiFiduinoV2
wifiduino32c3.build.bootloader_addr=0x0

wifiduino32c3.build.cdc_on_boot=0
wifiduino32c3.build.f_cpu=160000000L
wifiduino32c3.build.flash_size=4MB
wifiduino32c3.build.flash_freq=80m
wifiduino32c3.build.flash_mode=qio
wifiduino32c3.build.boot=qio
wifiduino32c3.build.partitions=default
wifiduino32c3.build.defines=

wifiduino32c3.menu.CDCOnBoot.default=Disabled
wifiduino32c3.menu.CDCOnBoot.default.build.cdc_on_boot=0
wifiduino32c3.menu.CDCOnBoot.cdc=Enabled
wifiduino32c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wifiduino32c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.default.build.partitions=default
wifiduino32c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wifiduino32c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wifiduino32c3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wifiduino32c3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wifiduino32c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wifiduino32c3.menu.PartitionScheme.minimal.build.partitions=minimal
wifiduino32c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wifiduino32c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wifiduino32c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wifiduino32c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wifiduino32c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wifiduino32c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wifiduino32c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wifiduino32c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wifiduino32c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wifiduino32c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
wifiduino32c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wifiduino32c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wifiduino32c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wifiduino32c3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
wifiduino32c3.menu.PartitionScheme.fatflash.build.partitions=ffat
wifiduino32c3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
wifiduino32c3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
wifiduino32c3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
wifiduino32c3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
wifiduino32c3.menu.PartitionScheme.rainmaker=RainMaker 4MB
wifiduino32c3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
wifiduino32c3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
wifiduino32c3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
wifiduino32c3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
wifiduino32c3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
wifiduino32c3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
wifiduino32c3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
wifiduino32c3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

