espressif/arduino-esp32/boards.txt
wifiduino32s3.menu.UploadMode.default=UART0 / Hardware CDC
wifiduino32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
wifiduino32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
wifiduino32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
wifiduino32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
wifiduino32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

wifiduino32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.default.build.partitions=default
wifiduino32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wifiduino32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wifiduino32s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wifiduino32s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wifiduino32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wifiduino32s3.menu.PartitionScheme.minimal.build.partitions=minimal
wifiduino32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wifiduino32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wifiduino32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wifiduino32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wifiduino32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wifiduino32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wifiduino32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wifiduino32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wifiduino32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wifiduino32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
wifiduino32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wifiduino32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wifiduino32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wifiduino32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
wifiduino32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
wifiduino32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
wifiduino32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
wifiduino32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
wifiduino32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
wifiduino32s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
wifiduino32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
wifiduino32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
wifiduino32s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
wifiduino32s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
wifiduino32s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
wifiduino32s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
wifiduino32s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
wifiduino32s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

wifiduino32s3.menu.CPUFreq.240=240MHz (WiFi)
wifiduino32s3.menu.CPUFreq.240.build.f_cpu=240000000L
wifiduino32s3.menu.CPUFreq.160=160MHz (WiFi)
wifiduino32s3.menu.CPUFreq.160.build.f_cpu=160000000L
wifiduino32s3.menu.CPUFreq.80=80MHz (WiFi)
wifiduino32s3.menu.CPUFreq.80.build.f_cpu=80000000L
wifiduino32s3.menu.CPUFreq.40=40MHz
wifiduino32s3.menu.CPUFreq.40.build.f_cpu=40000000L
wifiduino32s3.menu.CPUFreq.20=20MHz
wifiduino32s3.menu.CPUFreq.20.build.f_cpu=20000000L
wifiduino32s3.menu.CPUFreq.10=10MHz
wifiduino32s3.menu.CPUFreq.10.build.f_cpu=10000000L

wifiduino32s3.menu.UploadSpeed.921600=921600
wifiduino32s3.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32s3.menu.UploadSpeed.115200=115200
wifiduino32s3.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32s3.menu.UploadSpeed.256000.windows=256000
wifiduino32s3.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32s3.menu.UploadSpeed.230400=230400
wifiduino32s3.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32s3.menu.UploadSpeed.460800.linux=460800
wifiduino32s3.menu.UploadSpeed.460800.macosx=460800
wifiduino32s3.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32s3.menu.UploadSpeed.512000.windows=512000
wifiduino32s3.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32s3.menu.DebugLevel.none=None
wifiduino32s3.menu.DebugLevel.none.build.code_debug=0
wifiduino32s3.menu.DebugLevel.error=Error
wifiduino32s3.menu.DebugLevel.error.build.code_debug=1
wifiduino32s3.menu.DebugLevel.warn=Warn
wifiduino32s3.menu.DebugLevel.warn.build.code_debug=2
wifiduino32s3.menu.DebugLevel.info=Info
wifiduino32s3.menu.DebugLevel.info.build.code_debug=3
wifiduino32s3.menu.DebugLevel.debug=Debug
wifiduino32s3.menu.DebugLevel.debug.build.code_debug=4
wifiduino32s3.menu.DebugLevel.verbose=Verbose
wifiduino32s3.menu.DebugLevel.verbose.build.code_debug=5

wifiduino32s3.menu.EraseFlash.none=Disabled
wifiduino32s3.menu.EraseFlash.none.upload.erase_cmd=
wifiduino32s3.menu.EraseFlash.all=Enabled
wifiduino32s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

imbrios-logsens-v1p1.name=IMBRIOS LOGSENS_V1P1

imbrios-logsens-v1p1.bootloader.tool=esptool_py
imbrios-logsens-v1p1.bootloader.tool.default=esptool_py

imbrios-logsens-v1p1.upload.tool=esptool_py
imbrios-logsens-v1p1.upload.tool.default=esptool_py
imbrios-logsens-v1p1.upload.tool.network=esp_ota

imbrios-logsens-v1p1.upload.maximum_size=1310720
imbrios-logsens-v1p1.upload.maximum_data_size=327680
imbrios-logsens-v1p1.upload.wait_for_upload_port=true
imbrios-logsens-v1p1.upload.flags=
imbrios-logsens-v1p1.upload.extra_flags=

imbrios-logsens-v1p1.serial.disableDTR=true
imbrios-logsens-v1p1.serial.disableRTS=true

imbrios-logsens-v1p1.build.tarch=xtensa
imbrios-logsens-v1p1.build.bootloader_addr=0x1000
imbrios-logsens-v1p1.build.target=esp32
imbrios-logsens-v1p1.build.mcu=esp32
imbrios-logsens-v1p1.build.core=esp32
imbrios-logsens-v1p1.build.variant=imbrios-logsens-v1p1
imbrios-logsens-v1p1.build.board=IMBRIOS_LOGSENS_V1P1

