espressif/arduino-esp32/boards.txt
Bee_Motion_S3.menu.DFUOnBoot.default=Disabled
Bee_Motion_S3.menu.DFUOnBoot.default.build.dfu_on_boot=0
Bee_Motion_S3.menu.DFUOnBoot.dfu=Enabled
Bee_Motion_S3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Bee_Motion_S3.menu.USBMode.default=USB-OTG
Bee_Motion_S3.menu.USBMode.default.build.usb_mode=0
Bee_Motion_S3.menu.USBMode.default.upload.use_1200bps_touch=true
Bee_Motion_S3.menu.USBMode.default.upload.wait_for_upload_port=true
Bee_Motion_S3.menu.USBMode.hwcdc=Hardware CDC and JTAG
Bee_Motion_S3.menu.USBMode.hwcdc.build.usb_mode=1
Bee_Motion_S3.menu.USBMode.hwcdc.upload.use_1200bps_touch=false
Bee_Motion_S3.menu.USBMode.hwcdc.upload.wait_for_upload_port=false

Bee_Motion_S3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Bee_Motion_S3.menu.PartitionScheme.default.build.partitions=default
Bee_Motion_S3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Bee_Motion_S3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Bee_Motion_S3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Bee_Motion_S3.menu.PartitionScheme.no_ota.build.partitions=no_ota
Bee_Motion_S3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Bee_Motion_S3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Bee_Motion_S3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Bee_Motion_S3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Bee_Motion_S3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Bee_Motion_S3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Bee_Motion_S3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Bee_Motion_S3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Bee_Motion_S3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Bee_Motion_S3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Bee_Motion_S3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Bee_Motion_S3.menu.PartitionScheme.huge_app.build.partitions=huge_app
Bee_Motion_S3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

Bee_Motion_S3.menu.DebugLevel.none=None
Bee_Motion_S3.menu.DebugLevel.none.build.code_debug=0
Bee_Motion_S3.menu.DebugLevel.error=Error
Bee_Motion_S3.menu.DebugLevel.error.build.code_debug=1
Bee_Motion_S3.menu.DebugLevel.warn=Warn
Bee_Motion_S3.menu.DebugLevel.warn.build.code_debug=2
Bee_Motion_S3.menu.DebugLevel.info=Info
Bee_Motion_S3.menu.DebugLevel.info.build.code_debug=3
Bee_Motion_S3.menu.DebugLevel.debug=Debug
Bee_Motion_S3.menu.DebugLevel.debug.build.code_debug=4
Bee_Motion_S3.menu.DebugLevel.verbose=Verbose
Bee_Motion_S3.menu.DebugLevel.verbose.build.code_debug=5

Bee_Motion_S3.menu.EraseFlash.none=Disabled
Bee_Motion_S3.menu.EraseFlash.none.upload.erase_cmd=
Bee_Motion_S3.menu.EraseFlash.all=Enabled
Bee_Motion_S3.menu.EraseFlash.all.upload.erase_cmd=-e

########################################################################

Bee_Motion.name=Bee Motion
Bee_Motion.vid.0=0x303a
Bee_Motion.pid.0=0x810D
Bee_Motion.vid.upload_port.0.vid=0x303a
Bee_Motion.pid.upload_port.0.pid=0x810D

Bee_Motion.bootloader.tool=esptool_py
Bee_Motion.bootloader.tool.default=esptool_py

Bee_Motion.upload.tool=esptool_py
Bee_Motion.upload.tool.default=esptool_py
Bee_Motion.upload.tool.network=esp_ota

Bee_Motion.upload.maximum_size=1310720
Bee_Motion.upload.maximum_data_size=327680
Bee_Motion.upload.flags=
Bee_Motion.upload.extra_flags=
Bee_Motion.upload.use_1200bps_touch=true
Bee_Motion.upload.wait_for_upload_port=true
Bee_Motion.upload.speed=921600

Bee_Motion.serial.disableDTR=false
Bee_Motion.serial.disableRTS=false

Bee_Motion.build.tarch=xtensa
Bee_Motion.build.bootloader_addr=0x1000
Bee_Motion.build.target=esp32s2
Bee_Motion.build.mcu=esp32s2
Bee_Motion.build.core=esp32
Bee_Motion.build.variant=Bee_Motion
Bee_Motion.build.board=Bee_Motion

Bee_Motion.build.cdc_on_boot=1
Bee_Motion.build.msc_on_boot=1
Bee_Motion.build.dfu_on_boot=1
Bee_Motion.build.f_cpu=240000000L
Bee_Motion.build.flash_size=4MB
Bee_Motion.build.flash_freq=80m
Bee_Motion.build.flash_mode=dio
Bee_Motion.build.boot=qio
Bee_Motion.build.partitions=default
Bee_Motion.build.defines=

Bee_Motion.menu.CDCOnBoot.default=Enabled
Bee_Motion.menu.CDCOnBoot.default.build.cdc_on_boot=1
Bee_Motion.menu.CDCOnBoot.dis_cdc=Disabled
Bee_Motion.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

Bee_Motion.menu.MSCOnBoot.default=Disabled
Bee_Motion.menu.MSCOnBoot.default.build.msc_on_boot=0
Bee_Motion.menu.MSCOnBoot.msc=Enabled
Bee_Motion.menu.MSCOnBoot.msc.build.msc_on_boot=1

Bee_Motion.menu.DFUOnBoot.default=Disabled
Bee_Motion.menu.DFUOnBoot.default.build.dfu_on_boot=0
Bee_Motion.menu.DFUOnBoot.dfu=Enabled
Bee_Motion.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Bee_Motion.menu.USBMode.default=USB-OTG
Bee_Motion.menu.USBMode.default.build.usb_mode=0
Bee_Motion.menu.USBMode.default.upload.use_1200bps_touch=true
Bee_Motion.menu.USBMode.default.upload.wait_for_upload_port=true
Bee_Motion.menu.USBMode.hwcdc=Hardware CDC and JTAG
Bee_Motion.menu.USBMode.hwcdc.build.usb_mode=1
Bee_Motion.menu.USBMode.hwcdc.upload.use_1200bps_touch=false
Bee_Motion.menu.USBMode.hwcdc.upload.wait_for_upload_port=false

Bee_Motion.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Bee_Motion.menu.PartitionScheme.default.build.partitions=default
Bee_Motion.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Bee_Motion.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Bee_Motion.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Bee_Motion.menu.PartitionScheme.no_ota.build.partitions=no_ota
Bee_Motion.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Bee_Motion.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Bee_Motion.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Bee_Motion.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Bee_Motion.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Bee_Motion.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Bee_Motion.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Bee_Motion.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Bee_Motion.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Bee_Motion.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Bee_Motion.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Bee_Motion.menu.PartitionScheme.huge_app.build.partitions=huge_app
Bee_Motion.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

Bee_Motion.menu.DebugLevel.none=None
Bee_Motion.menu.DebugLevel.none.build.code_debug=0
Bee_Motion.menu.DebugLevel.error=Error
Bee_Motion.menu.DebugLevel.error.build.code_debug=1
Bee_Motion.menu.DebugLevel.warn=Warn
Bee_Motion.menu.DebugLevel.warn.build.code_debug=2
Bee_Motion.menu.DebugLevel.info=Info
Bee_Motion.menu.DebugLevel.info.build.code_debug=3
Bee_Motion.menu.DebugLevel.debug=Debug
Bee_Motion.menu.DebugLevel.debug.build.code_debug=4
Bee_Motion.menu.DebugLevel.verbose=Verbose
Bee_Motion.menu.DebugLevel.verbose.build.code_debug=5

Bee_Motion.menu.EraseFlash.none=Disabled
Bee_Motion.menu.EraseFlash.none.upload.erase_cmd=
Bee_Motion.menu.EraseFlash.all=Enabled
Bee_Motion.menu.EraseFlash.all.upload.erase_cmd=-e

#####################################################################

Bee_Motion_Mini.name=Bee Motion Mini

