espressif/arduino-esp32/boards.txt
crabik_slot_esp32_s3.menu.EraseFlash.none=Disabled
crabik_slot_esp32_s3.menu.EraseFlash.none.upload.erase_cmd=
crabik_slot_esp32_s3.menu.EraseFlash.all=Enabled
crabik_slot_esp32_s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################


nebulas3.name=Nebula S3

nebulas3.bootloader.tool=esptool_py
nebulas3.bootloader.tool.default=esptool_py

nebulas3.upload.tool=esptool_py
nebulas3.upload.tool.default=esptool_py
nebulas3.upload.tool.network=esp_ota

nebulas3.upload.maximum_size=1310720
nebulas3.upload.maximum_data_size=327680
nebulas3.upload.flags=
nebulas3.upload.extra_flags=
nebulas3.upload.use_1200bps_touch=false
nebulas3.upload.wait_for_upload_port=false

nebulas3.serial.disableDTR=false
nebulas3.serial.disableRTS=false

nebulas3.build.tarch=xtensa
nebulas3.build.bootloader_addr=0x0
nebulas3.build.target=esp32s3
nebulas3.build.mcu=esp32s3
nebulas3.build.core=esp32
nebulas3.build.variant=Nebula_S3
nebulas3.build.board=NEBULAS3

nebulas3.build.usb_mode=1
nebulas3.build.cdc_on_boot=0
nebulas3.build.msc_on_boot=0
nebulas3.build.dfu_on_boot=0
nebulas3.build.f_cpu=240000000L
nebulas3.build.flash_size=4MB
nebulas3.build.flash_freq=80m
nebulas3.build.flash_mode=dio
nebulas3.build.boot=qio
nebulas3.build.boot_freq=80m
nebulas3.build.partitions=default
nebulas3.build.defines=
nebulas3.build.loop_core=
nebulas3.build.event_core=
nebulas3.build.psram_type=qspi
nebulas3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
nebulas3.menu.JTAGAdapter.default=Disabled
nebulas3.menu.JTAGAdapter.default.build.copy_jtag_files=0
nebulas3.menu.JTAGAdapter.builtin=Integrated USB JTAG
nebulas3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
nebulas3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
nebulas3.menu.JTAGAdapter.external=FTDI Adapter
nebulas3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
nebulas3.menu.JTAGAdapter.external.build.copy_jtag_files=1
nebulas3.menu.JTAGAdapter.bridge=ESP USB Bridge
nebulas3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
nebulas3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

nebulas3.menu.PSRAM.disabled=Disabled
nebulas3.menu.PSRAM.disabled.build.defines=
nebulas3.menu.PSRAM.disabled.build.psram_type=qspi
nebulas3.menu.PSRAM.enabled=QSPI PSRAM
nebulas3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
nebulas3.menu.PSRAM.enabled.build.psram_type=qspi
nebulas3.menu.PSRAM.opi=OPI PSRAM
nebulas3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
nebulas3.menu.PSRAM.opi.build.psram_type=opi

nebulas3.menu.FlashMode.qio=QIO 80MHz
nebulas3.menu.FlashMode.qio.build.flash_mode=dio
nebulas3.menu.FlashMode.qio.build.boot=qio
nebulas3.menu.FlashMode.qio.build.boot_freq=80m
nebulas3.menu.FlashMode.qio.build.flash_freq=80m
nebulas3.menu.FlashMode.qio120=QIO 120MHz
nebulas3.menu.FlashMode.qio120.build.flash_mode=dio
nebulas3.menu.FlashMode.qio120.build.boot=qio
nebulas3.menu.FlashMode.qio120.build.boot_freq=120m
nebulas3.menu.FlashMode.qio120.build.flash_freq=80m
nebulas3.menu.FlashMode.dio=DIO 80MHz
nebulas3.menu.FlashMode.dio.build.flash_mode=dio
nebulas3.menu.FlashMode.dio.build.boot=dio
nebulas3.menu.FlashMode.dio.build.boot_freq=80m
nebulas3.menu.FlashMode.dio.build.flash_freq=80m
nebulas3.menu.FlashMode.opi=OPI 80MHz
nebulas3.menu.FlashMode.opi.build.flash_mode=dout
nebulas3.menu.FlashMode.opi.build.boot=opi
nebulas3.menu.FlashMode.opi.build.boot_freq=80m
nebulas3.menu.FlashMode.opi.build.flash_freq=80m

nebulas3.menu.FlashSize.4M=4MB (32Mb)
nebulas3.menu.FlashSize.4M.build.flash_size=4MB
nebulas3.menu.FlashSize.8M=8MB (64Mb)
nebulas3.menu.FlashSize.8M.build.flash_size=8MB
nebulas3.menu.FlashSize.16M=16MB (128Mb)
nebulas3.menu.FlashSize.16M.build.flash_size=16MB

nebulas3.menu.LoopCore.1=Core 1
nebulas3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
nebulas3.menu.LoopCore.0=Core 0
nebulas3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

nebulas3.menu.EventsCore.1=Core 1
nebulas3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
nebulas3.menu.EventsCore.0=Core 0
nebulas3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

nebulas3.menu.USBMode.hwcdc=Hardware CDC and JTAG
nebulas3.menu.USBMode.hwcdc.build.usb_mode=1
nebulas3.menu.USBMode.default=USB-OTG (TinyUSB)
nebulas3.menu.USBMode.default.build.usb_mode=0

nebulas3.menu.CDCOnBoot.default= Enabled
nebulas3.menu.CDCOnBoot.default.build.cdc_on_boot=1
nebulas3.menu.CDCOnBoot.cdc=Disabled
nebulas3.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

nebulas3.menu.MSCOnBoot.default=Disabled
nebulas3.menu.MSCOnBoot.default.build.msc_on_boot=0
nebulas3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
nebulas3.menu.MSCOnBoot.msc.build.msc_on_boot=1

nebulas3.menu.DFUOnBoot.default=Disabled
nebulas3.menu.DFUOnBoot.default.build.dfu_on_boot=0
nebulas3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
nebulas3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

nebulas3.menu.UploadMode.default=UART0 / Hardware CDC
nebulas3.menu.UploadMode.default.upload.use_1200bps_touch=false
nebulas3.menu.UploadMode.default.upload.wait_for_upload_port=false
nebulas3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
nebulas3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
nebulas3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

nebulas3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
nebulas3.menu.PartitionScheme.default.build.partitions=default
nebulas3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
nebulas3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
nebulas3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
nebulas3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
nebulas3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
nebulas3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
nebulas3.menu.PartitionScheme.minimal.build.partitions=minimal
nebulas3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
nebulas3.menu.PartitionScheme.no_ota.build.partitions=no_ota
nebulas3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
nebulas3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
nebulas3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
nebulas3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
nebulas3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
nebulas3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
nebulas3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
nebulas3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
nebulas3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
nebulas3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
nebulas3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
nebulas3.menu.PartitionScheme.huge_app.build.partitions=huge_app
nebulas3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
nebulas3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
nebulas3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
nebulas3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
nebulas3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
nebulas3.menu.PartitionScheme.fatflash.build.partitions=ffat
nebulas3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
nebulas3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
nebulas3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
nebulas3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
nebulas3.menu.PartitionScheme.rainmaker=RainMaker 4MB
nebulas3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
nebulas3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
nebulas3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
nebulas3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
nebulas3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
nebulas3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
nebulas3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
nebulas3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

nebulas3.menu.CPUFreq.240=240MHz (WiFi)
nebulas3.menu.CPUFreq.240.build.f_cpu=240000000L
nebulas3.menu.CPUFreq.160=160MHz (WiFi)
nebulas3.menu.CPUFreq.160.build.f_cpu=160000000L
nebulas3.menu.CPUFreq.80=80MHz (WiFi)
nebulas3.menu.CPUFreq.80.build.f_cpu=80000000L
nebulas3.menu.CPUFreq.40=40MHz
nebulas3.menu.CPUFreq.40.build.f_cpu=40000000L
nebulas3.menu.CPUFreq.20=20MHz
nebulas3.menu.CPUFreq.20.build.f_cpu=20000000L
nebulas3.menu.CPUFreq.10=10MHz
nebulas3.menu.CPUFreq.10.build.f_cpu=10000000L

