espressif/arduino-esp32/boards.txt
namino_bianco.menu.DebugLevel.none=None
namino_bianco.menu.DebugLevel.none.build.code_debug=0
namino_bianco.menu.DebugLevel.error=Error
namino_bianco.menu.DebugLevel.error.build.code_debug=1
namino_bianco.menu.DebugLevel.warn=Warn
namino_bianco.menu.DebugLevel.warn.build.code_debug=2
namino_bianco.menu.DebugLevel.info=Info
namino_bianco.menu.DebugLevel.info.build.code_debug=3
namino_bianco.menu.DebugLevel.debug=Debug
namino_bianco.menu.DebugLevel.debug.build.code_debug=4
namino_bianco.menu.DebugLevel.verbose=Verbose
namino_bianco.menu.DebugLevel.verbose.build.code_debug=5

namino_bianco.menu.EraseFlash.none=Disabled
namino_bianco.menu.EraseFlash.none.upload.erase_cmd=
namino_bianco.menu.EraseFlash.all=Enabled
namino_bianco.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# IOXESP32, IOXESP32U

ioxesp32.name=IOXESP32

ioxesp32.bootloader.tool=esptool_py
ioxesp32.bootloader.tool.default=esptool_py

ioxesp32.upload.tool=esptool_py
ioxesp32.upload.tool.default=esptool_py
ioxesp32.upload.tool.network=esp_ota

ioxesp32.upload.maximum_size=1310720
ioxesp32.upload.maximum_data_size=327680
ioxesp32.upload.flags=
ioxesp32.upload.extra_flags=

ioxesp32.serial.disableDTR=true
ioxesp32.serial.disableRTS=true

ioxesp32.build.tarch=xtensa
ioxesp32.build.bootloader_addr=0x1000
ioxesp32.build.target=esp32
ioxesp32.build.mcu=esp32
ioxesp32.build.core=esp32
ioxesp32.build.variant=ioxesp32
ioxesp32.build.board=IOXESP32

ioxesp32.build.f_cpu=240000000L
ioxesp32.build.flash_mode=dio
ioxesp32.build.flash_size=4MB
ioxesp32ps.build.flash_freq=40m
ioxesp32.build.boot=dio
ioxesp32.build.partitions=default
ioxesp32.build.defines=
ioxesp32.build.extra_libs=

ioxesp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ioxesp32.menu.PartitionScheme.default.build.partitions=default
ioxesp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ioxesp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ioxesp32.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
ioxesp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
ioxesp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
ioxesp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ioxesp32.menu.PartitionScheme.minimal.build.partitions=minimal
ioxesp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ioxesp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
ioxesp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ioxesp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ioxesp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ioxesp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ioxesp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ioxesp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ioxesp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ioxesp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ioxesp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ioxesp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ioxesp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ioxesp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
ioxesp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ioxesp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ioxesp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ioxesp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ioxesp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
ioxesp32.menu.PartitionScheme.fatflash.build.partitions=ffat
ioxesp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
ioxesp32.menu.PartitionScheme.rainmaker=RainMaker 4MB
ioxesp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
ioxesp32.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
ioxesp32.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
ioxesp32.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
ioxesp32.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656

ioxesp32.menu.FlashFreq.80=80MHz
ioxesp32.menu.FlashFreq.80.build.flash_freq=80m
ioxesp32.menu.FlashFreq.40=40MHz
ioxesp32.menu.FlashFreq.40.build.flash_freq=40m

ioxesp32.menu.UploadSpeed.921600=921600
ioxesp32.menu.UploadSpeed.921600.upload.speed=921600
ioxesp32.menu.UploadSpeed.115200=115200
ioxesp32.menu.UploadSpeed.115200.upload.speed=115200
ioxesp32.menu.UploadSpeed.256000.windows=256000
ioxesp32.menu.UploadSpeed.256000.upload.speed=256000
ioxesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
ioxesp32.menu.UploadSpeed.230400=230400
ioxesp32.menu.UploadSpeed.230400.upload.speed=230400
ioxesp32.menu.UploadSpeed.460800.linux=460800
ioxesp32.menu.UploadSpeed.460800.macosx=460800
ioxesp32.menu.UploadSpeed.460800.upload.speed=460800
ioxesp32.menu.UploadSpeed.512000.windows=512000
ioxesp32.menu.UploadSpeed.512000.upload.speed=512000

ioxesp32.menu.DebugLevel.none=None
ioxesp32.menu.DebugLevel.none.build.code_debug=0
ioxesp32.menu.DebugLevel.error=Error
ioxesp32.menu.DebugLevel.error.build.code_debug=1
ioxesp32.menu.DebugLevel.warn=Warn
ioxesp32.menu.DebugLevel.warn.build.code_debug=2
ioxesp32.menu.DebugLevel.info=Info
ioxesp32.menu.DebugLevel.info.build.code_debug=3
ioxesp32.menu.DebugLevel.debug=Debug
ioxesp32.menu.DebugLevel.debug.build.code_debug=4
ioxesp32.menu.DebugLevel.verbose=Verbose
ioxesp32.menu.DebugLevel.verbose.build.code_debug=5

ioxesp32.menu.EraseFlash.none=Disabled
ioxesp32.menu.EraseFlash.none.upload.erase_cmd=
ioxesp32.menu.EraseFlash.all=Enabled
ioxesp32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# IOXESP32PS

ioxesp32ps.name=IOXESP32PS

ioxesp32ps.bootloader.tool=esptool_py
ioxesp32ps.bootloader.tool.default=esptool_py

ioxesp32ps.upload.tool=esptool_py
ioxesp32ps.upload.tool.default=esptool_py
ioxesp32ps.upload.tool.network=esp_ota

ioxesp32ps.upload.maximum_size=1310720
ioxesp32ps.upload.maximum_data_size=327680
ioxesp32ps.upload.flags=
ioxesp32ps.upload.extra_flags=

ioxesp32ps.serial.disableDTR=true
ioxesp32ps.serial.disableRTS=true

ioxesp32ps.build.tarch=xtensa
ioxesp32ps.build.bootloader_addr=0x1000
ioxesp32ps.build.target=esp32
ioxesp32ps.build.mcu=esp32
ioxesp32ps.build.core=esp32
ioxesp32ps.build.variant=ioxesp32
ioxesp32ps.build.board=IOXESP32PS

