espressif/arduino-esp32/boards.txt
ioxesp32ps.build.f_cpu=240000000L
ioxesp32ps.build.flash_mode=dio
ioxesp32ps.build.flash_size=4MB
ioxesp32ps.build.flash_freq=40m
ioxesp32ps.build.boot=dio
ioxesp32ps.build.partitions=default
ioxesp32ps.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
ioxesp32ps.build.extra_libs=

ioxesp32ps.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.default.build.partitions=default
ioxesp32ps.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ioxesp32ps.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ioxesp32ps.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
ioxesp32ps.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
ioxesp32ps.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ioxesp32ps.menu.PartitionScheme.minimal.build.partitions=minimal
ioxesp32ps.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.no_ota.build.partitions=no_ota
ioxesp32ps.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ioxesp32ps.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ioxesp32ps.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ioxesp32ps.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ioxesp32ps.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ioxesp32ps.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ioxesp32ps.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ioxesp32ps.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ioxesp32ps.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ioxesp32ps.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ioxesp32ps.menu.PartitionScheme.huge_app.build.partitions=huge_app
ioxesp32ps.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ioxesp32ps.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ioxesp32ps.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ioxesp32ps.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ioxesp32ps.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
ioxesp32ps.menu.PartitionScheme.fatflash.build.partitions=ffat
ioxesp32ps.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
ioxesp32ps.menu.PartitionScheme.rainmaker=RainMaker 4MB
ioxesp32ps.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
ioxesp32ps.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
ioxesp32ps.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
ioxesp32ps.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
ioxesp32ps.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656

ioxesp32ps.menu.FlashFreq.80=80MHz
ioxesp32ps.menu.FlashFreq.80.build.flash_freq=80m
ioxesp32ps.menu.FlashFreq.40=40MHz
ioxesp32ps.menu.FlashFreq.40.build.flash_freq=40m

ioxesp32ps.menu.UploadSpeed.921600=921600
ioxesp32ps.menu.UploadSpeed.921600.upload.speed=921600
ioxesp32ps.menu.UploadSpeed.115200=115200
ioxesp32ps.menu.UploadSpeed.115200.upload.speed=115200
ioxesp32ps.menu.UploadSpeed.256000.windows=256000
ioxesp32ps.menu.UploadSpeed.256000.upload.speed=256000
ioxesp32ps.menu.UploadSpeed.230400.windows.upload.speed=256000
ioxesp32ps.menu.UploadSpeed.230400=230400
ioxesp32ps.menu.UploadSpeed.230400.upload.speed=230400
ioxesp32ps.menu.UploadSpeed.460800.linux=460800
ioxesp32ps.menu.UploadSpeed.460800.macosx=460800
ioxesp32ps.menu.UploadSpeed.460800.upload.speed=460800
ioxesp32ps.menu.UploadSpeed.512000.windows=512000
ioxesp32ps.menu.UploadSpeed.512000.upload.speed=512000

ioxesp32ps.menu.DebugLevel.none=None
ioxesp32ps.menu.DebugLevel.none.build.code_debug=0
ioxesp32ps.menu.DebugLevel.error=Error
ioxesp32ps.menu.DebugLevel.error.build.code_debug=1
ioxesp32ps.menu.DebugLevel.warn=Warn
ioxesp32ps.menu.DebugLevel.warn.build.code_debug=2
ioxesp32ps.menu.DebugLevel.info=Info
ioxesp32ps.menu.DebugLevel.info.build.code_debug=3
ioxesp32ps.menu.DebugLevel.debug=Debug
ioxesp32ps.menu.DebugLevel.debug.build.code_debug=4
ioxesp32ps.menu.DebugLevel.verbose=Verbose
ioxesp32ps.menu.DebugLevel.verbose.build.code_debug=5

ioxesp32ps.menu.EraseFlash.none=Disabled
ioxesp32ps.menu.EraseFlash.none.upload.erase_cmd=
ioxesp32ps.menu.EraseFlash.all=Enabled
ioxesp32ps.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# IOXESP32-C6

ioxesp32c6.name=IOXESP32-C6

ioxesp32c6.bootloader.tool=esptool_py
ioxesp32c6.bootloader.tool.default=esptool_py

ioxesp32c6.upload.tool=esptool_py
ioxesp32c6.upload.tool.default=esptool_py
ioxesp32c6.upload.tool.network=esp_ota

ioxesp32c6.upload.maximum_size=1310720
ioxesp32c6.upload.maximum_data_size=327680
ioxesp32c6.upload.flags=
ioxesp32c6.upload.extra_flags=
ioxesp32c6.upload.use_1200bps_touch=false
ioxesp32c6.upload.wait_for_upload_port=false

ioxesp32c6.serial.disableDTR=false
ioxesp32c6.serial.disableRTS=false

ioxesp32c6.build.tarch=riscv32
ioxesp32c6.build.target=esp
ioxesp32c6.build.mcu=esp32c6
ioxesp32c6.build.core=esp32
ioxesp32c6.build.variant=ioxesp32c6
ioxesp32c6.build.board=ESP32C6_DEV
ioxesp32c6.build.bootloader_addr=0x0

ioxesp32c6.build.cdc_on_boot=0
ioxesp32c6.build.f_cpu=160000000L
ioxesp32c6.build.flash_size=4MB
ioxesp32c6.build.flash_freq=80m
ioxesp32c6.build.flash_mode=qio
ioxesp32c6.build.boot=qio
ioxesp32c6.build.partitions=default
ioxesp32c6.build.defines=

## IDE 2.0 Seems to not update the value
ioxesp32c6.menu.JTAGAdapter.default=Disabled
ioxesp32c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
ioxesp32c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
ioxesp32c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
ioxesp32c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
ioxesp32c6.menu.JTAGAdapter.external=FTDI Adapter
ioxesp32c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
ioxesp32c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
ioxesp32c6.menu.JTAGAdapter.bridge=ESP USB Bridge
ioxesp32c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
ioxesp32c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

