espressif/arduino-esp32/boards.txt
ioxesp32c6.menu.CDCOnBoot.default=Disabled
ioxesp32c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
ioxesp32c6.menu.CDCOnBoot.cdc=Enabled
ioxesp32c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

ioxesp32c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ioxesp32c6.menu.PartitionScheme.default.build.partitions=default
ioxesp32c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ioxesp32c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ioxesp32c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ioxesp32c6.menu.PartitionScheme.minimal.build.partitions=minimal
ioxesp32c6.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
ioxesp32c6.menu.PartitionScheme.no_fs.build.partitions=no_fs
ioxesp32c6.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
ioxesp32c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ioxesp32c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
ioxesp32c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ioxesp32c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ioxesp32c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ioxesp32c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ioxesp32c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ioxesp32c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ioxesp32c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ioxesp32c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ioxesp32c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ioxesp32c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ioxesp32c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ioxesp32c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
ioxesp32c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ioxesp32c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ioxesp32c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ioxesp32c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ioxesp32c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
ioxesp32c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
ioxesp32c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
ioxesp32c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
ioxesp32c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
ioxesp32c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
ioxesp32c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
ioxesp32c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
ioxesp32c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
ioxesp32c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
ioxesp32c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
ioxesp32c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
ioxesp32c6.menu.PartitionScheme.custom=Custom
ioxesp32c6.menu.PartitionScheme.custom.build.partitions=
ioxesp32c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

ioxesp32c6.menu.CPUFreq.160=160MHz (WiFi)
ioxesp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
ioxesp32c6.menu.CPUFreq.120=120MHz (WiFi)
ioxesp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
ioxesp32c6.menu.CPUFreq.80=80MHz (WiFi)
ioxesp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
ioxesp32c6.menu.CPUFreq.40=40MHz
ioxesp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
ioxesp32c6.menu.CPUFreq.20=20MHz
ioxesp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
ioxesp32c6.menu.CPUFreq.10=10MHz
ioxesp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

ioxesp32c6.menu.FlashMode.qio=QIO
ioxesp32c6.menu.FlashMode.qio.build.flash_mode=dio
ioxesp32c6.menu.FlashMode.qio.build.boot=qio
ioxesp32c6.menu.FlashMode.dio=DIO
ioxesp32c6.menu.FlashMode.dio.build.flash_mode=dio
ioxesp32c6.menu.FlashMode.dio.build.boot=dio

ioxesp32c6.menu.FlashFreq.80=80MHz
ioxesp32c6.menu.FlashFreq.80.build.flash_freq=80m
ioxesp32c6.menu.FlashFreq.40=40MHz
ioxesp32c6.menu.FlashFreq.40.build.flash_freq=40m

ioxesp32c6.menu.UploadSpeed.921600=921600
ioxesp32c6.menu.UploadSpeed.921600.upload.speed=921600
ioxesp32c6.menu.UploadSpeed.115200=115200
ioxesp32c6.menu.UploadSpeed.115200.upload.speed=115200
ioxesp32c6.menu.UploadSpeed.256000.windows=256000
ioxesp32c6.menu.UploadSpeed.256000.upload.speed=256000
ioxesp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
ioxesp32c6.menu.UploadSpeed.230400=230400
ioxesp32c6.menu.UploadSpeed.230400.upload.speed=230400
ioxesp32c6.menu.UploadSpeed.460800.linux=460800
ioxesp32c6.menu.UploadSpeed.460800.macosx=460800
ioxesp32c6.menu.UploadSpeed.460800.upload.speed=460800
ioxesp32c6.menu.UploadSpeed.512000.windows=512000
ioxesp32c6.menu.UploadSpeed.512000.upload.speed=512000

ioxesp32c6.menu.DebugLevel.none=None
ioxesp32c6.menu.DebugLevel.none.build.code_debug=0
ioxesp32c6.menu.DebugLevel.error=Error
ioxesp32c6.menu.DebugLevel.error.build.code_debug=1
ioxesp32c6.menu.DebugLevel.warn=Warn
ioxesp32c6.menu.DebugLevel.warn.build.code_debug=2
ioxesp32c6.menu.DebugLevel.info=Info
ioxesp32c6.menu.DebugLevel.info.build.code_debug=3
ioxesp32c6.menu.DebugLevel.debug=Debug
ioxesp32c6.menu.DebugLevel.debug.build.code_debug=4
ioxesp32c6.menu.DebugLevel.verbose=Verbose
ioxesp32c6.menu.DebugLevel.verbose.build.code_debug=5

ioxesp32c6.menu.EraseFlash.none=Disabled
ioxesp32c6.menu.EraseFlash.none.upload.erase_cmd=
ioxesp32c6.menu.EraseFlash.all=Enabled
ioxesp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

ioxesp32c6.menu.ZigbeeMode.default=Disabled
ioxesp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
ioxesp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
ioxesp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
ioxesp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
ioxesp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
ioxesp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
ioxesp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
ioxesp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

