espressif/arduino-esp32/boards.txt
##############################################################
# ATD1.47-S3

atd147_s3.name=ATD1.47-S3

atd147_s3.bootloader.tool=esptool_py
atd147_s3.bootloader.tool.default=esptool_py

atd147_s3.upload.tool=esptool_py
atd147_s3.upload.tool.default=esptool_py
atd147_s3.upload.tool.network=esp_ota

atd147_s3.upload.maximum_size=1310720
atd147_s3.upload.maximum_data_size=327680
atd147_s3.upload.flags=
atd147_s3.upload.extra_flags=
atd147_s3.upload.use_1200bps_touch=false
atd147_s3.upload.wait_for_upload_port=false

atd147_s3.serial.disableDTR=false
atd147_s3.serial.disableRTS=false

atd147_s3.build.tarch=xtensa
atd147_s3.build.bootloader_addr=0x0
atd147_s3.build.target=esp32s3
atd147_s3.build.mcu=esp32s3
atd147_s3.build.core=esp32
atd147_s3.build.variant=atd147_s3
atd147_s3.build.board=ATD143_S3

atd147_s3.build.usb_mode=1
atd147_s3.build.cdc_on_boot=0
atd147_s3.build.msc_on_boot=0
atd147_s3.build.dfu_on_boot=0
atd147_s3.build.f_cpu=240000000L
atd147_s3.build.flash_size=8MB
atd147_s3.build.flash_freq=80m
atd147_s3.build.flash_mode=dio
atd147_s3.build.boot=qio
atd147_s3.build.boot_freq=80m
atd147_s3.build.partitions=default_8MB
atd147_s3.build.defines=
atd147_s3.build.loop_core=
atd147_s3.build.event_core=
atd147_s3.build.psram_type=opi
atd147_s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
atd147_s3.menu.JTAGAdapter.default=Disabled
atd147_s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
atd147_s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
atd147_s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
atd147_s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
atd147_s3.menu.JTAGAdapter.external=FTDI Adapter
atd147_s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
atd147_s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
atd147_s3.menu.JTAGAdapter.bridge=ESP USB Bridge
atd147_s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
atd147_s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

atd147_s3.menu.PSRAM.disabled=Disabled
atd147_s3.menu.PSRAM.disabled.build.defines=
atd147_s3.menu.PSRAM.disabled.build.psram_type=opi
atd147_s3.menu.PSRAM.enabled=Enable
atd147_s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
atd147_s3.menu.PSRAM.enabled.build.psram_type=opi

atd147_s3.menu.LoopCore.1=Core 1
atd147_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
atd147_s3.menu.LoopCore.0=Core 0
atd147_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

atd147_s3.menu.EventsCore.1=Core 1
atd147_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
atd147_s3.menu.EventsCore.0=Core 0
atd147_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

atd147_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
atd147_s3.menu.USBMode.hwcdc.build.usb_mode=1
atd147_s3.menu.USBMode.default=USB-OTG (TinyUSB)
atd147_s3.menu.USBMode.default.build.usb_mode=0

atd147_s3.menu.CDCOnBoot.default=Disabled
atd147_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
atd147_s3.menu.CDCOnBoot.cdc=Enabled
atd147_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

atd147_s3.menu.MSCOnBoot.default=Disabled
atd147_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
atd147_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
atd147_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

atd147_s3.menu.DFUOnBoot.default=Disabled
atd147_s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
atd147_s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
atd147_s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

atd147_s3.menu.UploadMode.default=UART0 / Hardware CDC
atd147_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
atd147_s3.menu.UploadMode.default.upload.wait_for_upload_port=false
atd147_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
atd147_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
atd147_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

atd147_s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
atd147_s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
atd147_s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
atd147_s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
atd147_s3.menu.PartitionScheme.minimal.build.partitions=minimal
atd147_s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
atd147_s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
atd147_s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
atd147_s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
atd147_s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
atd147_s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
atd147_s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
atd147_s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
atd147_s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
atd147_s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
atd147_s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
atd147_s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
atd147_s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
atd147_s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
atd147_s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
atd147_s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
atd147_s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
atd147_s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
atd147_s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
atd147_s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
atd147_s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
atd147_s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
atd147_s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
atd147_s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
atd147_s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
atd147_s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
atd147_s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

atd147_s3.menu.CPUFreq.240=240MHz (WiFi)
atd147_s3.menu.CPUFreq.240.build.f_cpu=240000000L
atd147_s3.menu.CPUFreq.160=160MHz (WiFi)
atd147_s3.menu.CPUFreq.160.build.f_cpu=160000000L
atd147_s3.menu.CPUFreq.80=80MHz (WiFi)
atd147_s3.menu.CPUFreq.80.build.f_cpu=80000000L
atd147_s3.menu.CPUFreq.40=40MHz
atd147_s3.menu.CPUFreq.40.build.f_cpu=40000000L
atd147_s3.menu.CPUFreq.20=20MHz
atd147_s3.menu.CPUFreq.20.build.f_cpu=20000000L
atd147_s3.menu.CPUFreq.10=10MHz
atd147_s3.menu.CPUFreq.10.build.f_cpu=10000000L

atd147_s3.menu.UploadSpeed.921600=921600
atd147_s3.menu.UploadSpeed.921600.upload.speed=921600
atd147_s3.menu.UploadSpeed.115200=115200
atd147_s3.menu.UploadSpeed.115200.upload.speed=115200
atd147_s3.menu.UploadSpeed.256000.windows=256000
atd147_s3.menu.UploadSpeed.256000.upload.speed=256000
atd147_s3.menu.UploadSpeed.230400.windows.upload.speed=256000
atd147_s3.menu.UploadSpeed.230400=230400
atd147_s3.menu.UploadSpeed.230400.upload.speed=230400
atd147_s3.menu.UploadSpeed.460800.linux=460800
atd147_s3.menu.UploadSpeed.460800.macosx=460800
atd147_s3.menu.UploadSpeed.460800.upload.speed=460800
atd147_s3.menu.UploadSpeed.512000.windows=512000
atd147_s3.menu.UploadSpeed.512000.upload.speed=512000

atd147_s3.menu.DebugLevel.none=None
atd147_s3.menu.DebugLevel.none.build.code_debug=0
atd147_s3.menu.DebugLevel.error=Error
atd147_s3.menu.DebugLevel.error.build.code_debug=1
atd147_s3.menu.DebugLevel.warn=Warn
atd147_s3.menu.DebugLevel.warn.build.code_debug=2
atd147_s3.menu.DebugLevel.info=Info
atd147_s3.menu.DebugLevel.info.build.code_debug=3
atd147_s3.menu.DebugLevel.debug=Debug
atd147_s3.menu.DebugLevel.debug.build.code_debug=4
atd147_s3.menu.DebugLevel.verbose=Verbose
atd147_s3.menu.DebugLevel.verbose.build.code_debug=5

atd147_s3.menu.EraseFlash.none=Disabled
atd147_s3.menu.EraseFlash.none.upload.erase_cmd=
atd147_s3.menu.EraseFlash.all=Enabled
atd147_s3.menu.EraseFlash.all.upload.erase_cmd=-e

