espressif/arduino-esp32/boards.txt
epulse_feather.menu.CPUFreq.240=240MHz (WiFi/BT)
epulse_feather.menu.CPUFreq.240.build.f_cpu=240000000L
epulse_feather.menu.CPUFreq.160=160MHz (WiFi/BT)
epulse_feather.menu.CPUFreq.160.build.f_cpu=160000000L
epulse_feather.menu.CPUFreq.80=80MHz (WiFi/BT)
epulse_feather.menu.CPUFreq.80.build.f_cpu=80000000L
epulse_feather.menu.CPUFreq.40=40MHz
epulse_feather.menu.CPUFreq.40.build.f_cpu=40000000L
epulse_feather.menu.CPUFreq.20=20MHz
epulse_feather.menu.CPUFreq.20.build.f_cpu=20000000L
epulse_feather.menu.CPUFreq.10=10MHz
epulse_feather.menu.CPUFreq.10.build.f_cpu=10000000L

epulse_feather.menu.FlashFreq.80=80MHz
epulse_feather.menu.FlashFreq.80.build.flash_freq=80m
epulse_feather.menu.FlashFreq.40=40MHz
epulse_feather.menu.FlashFreq.40.build.flash_freq=40m

epulse_feather.menu.UploadSpeed.921600=921600
epulse_feather.menu.UploadSpeed.921600.upload.speed=921600
epulse_feather.menu.UploadSpeed.115200=115200
epulse_feather.menu.UploadSpeed.115200.upload.speed=115200
epulse_feather.menu.UploadSpeed.256000.windows=256000
epulse_feather.menu.UploadSpeed.256000.upload.speed=256000
epulse_feather.menu.UploadSpeed.230400.windows.upload.speed=256000
epulse_feather.menu.UploadSpeed.230400=230400
epulse_feather.menu.UploadSpeed.230400.upload.speed=230400
epulse_feather.menu.UploadSpeed.460800.linux=460800
epulse_feather.menu.UploadSpeed.460800.macosx=460800
epulse_feather.menu.UploadSpeed.460800.upload.speed=460800
epulse_feather.menu.UploadSpeed.512000.windows=512000
epulse_feather.menu.UploadSpeed.512000.upload.speed=512000

epulse_feather.menu.DebugLevel.none=None
epulse_feather.menu.DebugLevel.none.build.code_debug=0
epulse_feather.menu.DebugLevel.error=Error
epulse_feather.menu.DebugLevel.error.build.code_debug=1
epulse_feather.menu.DebugLevel.warn=Warn
epulse_feather.menu.DebugLevel.warn.build.code_debug=2
epulse_feather.menu.DebugLevel.info=Info
epulse_feather.menu.DebugLevel.info.build.code_debug=3
epulse_feather.menu.DebugLevel.debug=Debug
epulse_feather.menu.DebugLevel.debug.build.code_debug=4
epulse_feather.menu.DebugLevel.verbose=Verbose
epulse_feather.menu.DebugLevel.verbose.build.code_debug=5

epulse_feather.menu.EraseFlash.none=Disabled
epulse_feather.menu.EraseFlash.none.upload.erase_cmd=
epulse_feather.menu.EraseFlash.all=Enabled
epulse_feather.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# ThingPulse ePulse Feather C6

epulse_feather_c6.name=ThingPulse ePulse Feather C6

epulse_feather_c6.bootloader.tool=esptool_py
epulse_feather_c6.bootloader.tool.default=esptool_py

epulse_feather_c6.upload.tool=esptool_py
epulse_feather_c6.upload.tool.default=esptool_py
epulse_feather_c6.upload.tool.network=esp_ota

epulse_feather_c6.upload.maximum_size=1310720
epulse_feather_c6.upload.maximum_data_size=327680
epulse_feather_c6.upload.flags=
epulse_feather_c6.upload.extra_flags=
epulse_feather_c6.upload.use_1200bps_touch=false
epulse_feather_c6.upload.wait_for_upload_port=false

epulse_feather_c6.serial.disableDTR=false
epulse_feather_c6.serial.disableRTS=false

epulse_feather_c6.build.tarch=riscv32
epulse_feather_c6.build.target=esp
epulse_feather_c6.build.mcu=esp32c6
epulse_feather_c6.build.core=esp32
epulse_feather_c6.build.variant=thingpulse_epulse_feather_c6
epulse_feather_c6.build.board=THINGPULSE_EPULSE_FEATHER_C6
epulse_feather_c6.build.bootloader_addr=0x0

epulse_feather_c6.build.cdc_on_boot=0
epulse_feather_c6.build.f_cpu=160000000L
epulse_feather_c6.build.flash_size=4MB
epulse_feather_c6.build.flash_freq=80m
epulse_feather_c6.build.flash_mode=qio
epulse_feather_c6.build.boot=qio
epulse_feather_c6.build.partitions=default
epulse_feather_c6.build.defines=

epulse_feather_c6.menu.JTAGAdapter.default=Disabled
epulse_feather_c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
epulse_feather_c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
epulse_feather_c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
epulse_feather_c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
epulse_feather_c6.menu.JTAGAdapter.external=FTDI Adapter
epulse_feather_c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
epulse_feather_c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
epulse_feather_c6.menu.JTAGAdapter.bridge=ESP USB Bridge
epulse_feather_c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
epulse_feather_c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

epulse_feather_c6.menu.CDCOnBoot.default=Disabled
epulse_feather_c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
epulse_feather_c6.menu.CDCOnBoot.cdc=Enabled
epulse_feather_c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

epulse_feather_c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
epulse_feather_c6.menu.PartitionScheme.default.build.partitions=default
epulse_feather_c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
epulse_feather_c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
epulse_feather_c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
epulse_feather_c6.menu.PartitionScheme.minimal.build.partitions=minimal
epulse_feather_c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
epulse_feather_c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
epulse_feather_c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
epulse_feather_c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
epulse_feather_c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
epulse_feather_c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
epulse_feather_c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
epulse_feather_c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
epulse_feather_c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
epulse_feather_c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
epulse_feather_c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
epulse_feather_c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
epulse_feather_c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
epulse_feather_c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
epulse_feather_c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
epulse_feather_c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
epulse_feather_c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
epulse_feather_c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
epulse_feather_c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
epulse_feather_c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
epulse_feather_c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
epulse_feather_c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
epulse_feather_c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
epulse_feather_c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
epulse_feather_c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
epulse_feather_c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
epulse_feather_c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
epulse_feather_c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
epulse_feather_c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
epulse_feather_c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
epulse_feather_c6.menu.PartitionScheme.custom=Custom
epulse_feather_c6.menu.PartitionScheme.custom.build.partitions=
epulse_feather_c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

epulse_feather_c6.menu.CPUFreq.160=160MHz (WiFi)
epulse_feather_c6.menu.CPUFreq.160.build.f_cpu=160000000L
epulse_feather_c6.menu.CPUFreq.120=120MHz (WiFi)
epulse_feather_c6.menu.CPUFreq.120.build.f_cpu=120000000L
epulse_feather_c6.menu.CPUFreq.80=80MHz (WiFi)
epulse_feather_c6.menu.CPUFreq.80.build.f_cpu=80000000L
epulse_feather_c6.menu.CPUFreq.40=40MHz
epulse_feather_c6.menu.CPUFreq.40.build.f_cpu=40000000L
epulse_feather_c6.menu.CPUFreq.20=20MHz
epulse_feather_c6.menu.CPUFreq.20.build.f_cpu=20000000L
epulse_feather_c6.menu.CPUFreq.10=10MHz
epulse_feather_c6.menu.CPUFreq.10.build.f_cpu=10000000L

epulse_feather_c6.menu.FlashMode.qio=QIO
epulse_feather_c6.menu.FlashMode.qio.build.flash_mode=dio
epulse_feather_c6.menu.FlashMode.qio.build.boot=qio
epulse_feather_c6.menu.FlashMode.dio=DIO
epulse_feather_c6.menu.FlashMode.dio.build.flash_mode=dio
epulse_feather_c6.menu.FlashMode.dio.build.boot=dio

epulse_feather_c6.menu.FlashFreq.80=80MHz
epulse_feather_c6.menu.FlashFreq.80.build.flash_freq=80m
epulse_feather_c6.menu.FlashFreq.40=40MHz
epulse_feather_c6.menu.FlashFreq.40.build.flash_freq=40m

epulse_feather_c6.menu.FlashSize.4M=4MB (32Mb)
epulse_feather_c6.menu.FlashSize.4M.build.flash_size=4MB
epulse_feather_c6.menu.FlashSize.2M=2MB (16Mb)
epulse_feather_c6.menu.FlashSize.2M.build.flash_size=2MB

epulse_feather_c6.menu.UploadSpeed.921600=921600
epulse_feather_c6.menu.UploadSpeed.921600.upload.speed=921600
epulse_feather_c6.menu.UploadSpeed.115200=115200
epulse_feather_c6.menu.UploadSpeed.115200.upload.speed=115200
epulse_feather_c6.menu.UploadSpeed.256000.windows=256000
epulse_feather_c6.menu.UploadSpeed.256000.upload.speed=256000
epulse_feather_c6.menu.UploadSpeed.230400.windows.upload.speed=256000
epulse_feather_c6.menu.UploadSpeed.230400=230400
epulse_feather_c6.menu.UploadSpeed.230400.upload.speed=230400
epulse_feather_c6.menu.UploadSpeed.460800.linux=460800
epulse_feather_c6.menu.UploadSpeed.460800.macosx=460800
epulse_feather_c6.menu.UploadSpeed.460800.upload.speed=460800
epulse_feather_c6.menu.UploadSpeed.512000.windows=512000
epulse_feather_c6.menu.UploadSpeed.512000.upload.speed=512000

epulse_feather_c6.menu.DebugLevel.none=None
epulse_feather_c6.menu.DebugLevel.none.build.code_debug=0
epulse_feather_c6.menu.DebugLevel.error=Error
epulse_feather_c6.menu.DebugLevel.error.build.code_debug=1
epulse_feather_c6.menu.DebugLevel.warn=Warn
epulse_feather_c6.menu.DebugLevel.warn.build.code_debug=2
epulse_feather_c6.menu.DebugLevel.info=Info
epulse_feather_c6.menu.DebugLevel.info.build.code_debug=3
epulse_feather_c6.menu.DebugLevel.debug=Debug
epulse_feather_c6.menu.DebugLevel.debug.build.code_debug=4
epulse_feather_c6.menu.DebugLevel.verbose=Verbose
epulse_feather_c6.menu.DebugLevel.verbose.build.code_debug=5

epulse_feather_c6.menu.EraseFlash.none=Disabled
epulse_feather_c6.menu.EraseFlash.none.upload.erase_cmd=
epulse_feather_c6.menu.EraseFlash.all=Enabled
epulse_feather_c6.menu.EraseFlash.all.upload.erase_cmd=-e

