espressif/arduino-esp32/boards.txt
Geekble_ESP32C3.menu.EraseFlash.none=Disabled
Geekble_ESP32C3.menu.EraseFlash.none.upload.erase_cmd=
Geekble_ESP32C3.menu.EraseFlash.all=Enabled
Geekble_ESP32C3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Geekble_Nano_ESP32S3.name=Geekble nano ESP32-S3
Geekble_Nano_ESP32S3.vid.0=0x303a
Geekble_Nano_ESP32S3.pid.0= 0x82C5
Geekble_Nano_ESP32S3.upload_port.0.vid=0x303a
Geekble_Nano_ESP32S3.upload_port.0.pid= 0x82C5

Geekble_Nano_ESP32S3.bootloader.tool=esptool_py
Geekble_Nano_ESP32S3.bootloader.tool.default=esptool_py

Geekble_Nano_ESP32S3.upload.tool=esptool_py
Geekble_Nano_ESP32S3.upload.tool.default=esptool_py
Geekble_Nano_ESP32S3.upload.tool.network=esp_ota

Geekble_Nano_ESP32S3.upload.maximum_size=1310720
Geekble_Nano_ESP32S3.upload.maximum_data_size=327680
Geekble_Nano_ESP32S3.upload.speed=921600
Geekble_Nano_ESP32S3.upload.flags=
Geekble_Nano_ESP32S3.upload.extra_flags=
Geekble_Nano_ESP32S3.upload.use_1200bps_touch=false
Geekble_Nano_ESP32S3.upload.wait_for_upload_port=false

Geekble_Nano_ESP32S3.serial.disableDTR=false
Geekble_Nano_ESP32S3.serial.disableRTS=false

Geekble_Nano_ESP32S3.build.tarch=xtensa
Geekble_Nano_ESP32S3.build.bootloader_addr=0x0
Geekble_Nano_ESP32S3.build.target=esp32s3
Geekble_Nano_ESP32S3.build.mcu=esp32s3
Geekble_Nano_ESP32S3.build.core=esp32
Geekble_Nano_ESP32S3.build.variant=Geekble_Nano_ESP32S3
Geekble_Nano_ESP32S3.build.board=GEEKBLE_NANO_ESP32S3

Geekble_Nano_ESP32S3.build.usb_mode=1
Geekble_Nano_ESP32S3.build.cdc_on_boot=1
Geekble_Nano_ESP32S3.build.msc_on_boot=0
Geekble_Nano_ESP32S3.build.dfu_on_boot=0
Geekble_Nano_ESP32S3.build.f_cpu=240000000L
Geekble_Nano_ESP32S3.build.flash_size=4MB
Geekble_Nano_ESP32S3.build.flash_freq=80m
Geekble_Nano_ESP32S3.build.flash_mode=dio
Geekble_Nano_ESP32S3.build.boot=qio
Geekble_Nano_ESP32S3.build.partitions=default
Geekble_Nano_ESP32S3.build.defines=
Geekble_Nano_ESP32S3.build.memory_type=qio_qspi
Geekble_Nano_ESP32S3.build.loop_core=-DARDUINO_RUNNING_CORE=1
Geekble_Nano_ESP32S3.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1

Geekble_Nano_ESP32S3.menu.USBMode.default=USB-OTG (TinyUSB)
Geekble_Nano_ESP32S3.menu.USBMode.default.build.usb_mode=0
Geekble_Nano_ESP32S3.menu.USBMode.default.build.cdc_on_boot=1
Geekble_Nano_ESP32S3.menu.USBMode.hwcdc=Hardware CDC and JTAG
Geekble_Nano_ESP32S3.menu.USBMode.hwcdc.build.usb_mode=1
Geekble_Nano_ESP32S3.menu.USBMode.hwcdc.build.cdc_on_boot=1

Geekble_Nano_ESP32S3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
Geekble_Nano_ESP32S3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
Geekble_Nano_ESP32S3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

Geekble_Nano_ESP32S3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.default.build.partitions=default
Geekble_Nano_ESP32S3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Geekble_Nano_ESP32S3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.no_ota.build.partitions=no_ota
Geekble_Nano_ESP32S3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Geekble_Nano_ESP32S3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Geekble_Nano_ESP32S3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.huge_app.build.partitions=huge_app
Geekble_Nano_ESP32S3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Geekble_Nano_ESP32S3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Geekble_Nano_ESP32S3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Geekble_Nano_ESP32S3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Geekble_Nano_ESP32S3.menu.PartitionScheme.rainmaker=RainMaker 4MB
Geekble_Nano_ESP32S3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
Geekble_Nano_ESP32S3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
Geekble_Nano_ESP32S3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
Geekble_Nano_ESP32S3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
Geekble_Nano_ESP32S3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
Geekble_Nano_ESP32S3.menu.PartitionScheme.otanofs=OTA no FS (2MB APP with OTA)
Geekble_Nano_ESP32S3.menu.PartitionScheme.otanofs.build.custom_partitions=ota_nofs_4MB
Geekble_Nano_ESP32S3.menu.PartitionScheme.otanofs.upload.maximum_size=2031616
Geekble_Nano_ESP32S3.menu.PartitionScheme.all_app=Max APP (4MB APP no OTA)
Geekble_Nano_ESP32S3.menu.PartitionScheme.all_app.build.custom_partitions=max_app_4MB
Geekble_Nano_ESP32S3.menu.PartitionScheme.all_app.upload.maximum_size=4063232
Geekble_Nano_ESP32S3.menu.PartitionScheme.custom=Custom
Geekble_Nano_ESP32S3.menu.PartitionScheme.custom.build.partitions=
Geekble_Nano_ESP32S3.menu.PartitionScheme.custom.upload.maximum_size=16777216

Geekble_Nano_ESP32S3.menu.PSRAM.disabled=Disabled
Geekble_Nano_ESP32S3.menu.PSRAM.disabled.build.defines=
Geekble_Nano_ESP32S3.menu.PSRAM.disabled.build.psram_type=qspi
Geekble_Nano_ESP32S3.menu.PSRAM.enabled=Enabled
Geekble_Nano_ESP32S3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
Geekble_Nano_ESP32S3.menu.PSRAM.enabled.build.psram_type=qspi

Geekble_Nano_ESP32S3.menu.DebugLevel.none=None
Geekble_Nano_ESP32S3.menu.DebugLevel.none.build.code_debug=0
Geekble_Nano_ESP32S3.menu.DebugLevel.error=Error
Geekble_Nano_ESP32S3.menu.DebugLevel.error.build.code_debug=1
Geekble_Nano_ESP32S3.menu.DebugLevel.warn=Warn
Geekble_Nano_ESP32S3.menu.DebugLevel.warn.build.code_debug=2
Geekble_Nano_ESP32S3.menu.DebugLevel.info=Info
Geekble_Nano_ESP32S3.menu.DebugLevel.info.build.code_debug=3
Geekble_Nano_ESP32S3.menu.DebugLevel.debug=Debug
Geekble_Nano_ESP32S3.menu.DebugLevel.debug.build.code_debug=4
Geekble_Nano_ESP32S3.menu.DebugLevel.verbose=Verbose
Geekble_Nano_ESP32S3.menu.DebugLevel.verbose.build.code_debug=5

Geekble_Nano_ESP32S3.menu.EraseFlash.none=Disabled
Geekble_Nano_ESP32S3.menu.EraseFlash.none.upload.erase_cmd=
Geekble_Nano_ESP32S3.menu.EraseFlash.all=Enabled
Geekble_Nano_ESP32S3.menu.EraseFlash.all.upload.erase_cmd=-e

