espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_zero.menu.CPUFreq.240=240MHz (WiFi)
waveshare_esp32_s3_zero.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32_s3_zero.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_s3_zero.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_s3_zero.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_s3_zero.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_s3_zero.menu.CPUFreq.40=40MHz
waveshare_esp32_s3_zero.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_s3_zero.menu.CPUFreq.20=20MHz
waveshare_esp32_s3_zero.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_s3_zero.menu.CPUFreq.10=10MHz
waveshare_esp32_s3_zero.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_s3_zero.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_zero.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_zero.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_zero.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_zero.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_zero.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_zero.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_zero.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_zero.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_zero.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_zero.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_zero.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_zero.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_zero.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_zero.menu.DebugLevel.none=None
waveshare_esp32_s3_zero.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_zero.menu.DebugLevel.error=Error
waveshare_esp32_s3_zero.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_zero.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_zero.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_zero.menu.DebugLevel.info=Info
waveshare_esp32_s3_zero.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_zero.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_zero.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_zero.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_zero.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_zero.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_zero.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_zero.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_zero.menu.EraseFlash.all.upload.erase_cmd=-e

######################################################

ws_esp32_s3_matrix.name=Waveshare ESP32-S3-Matrix
ws_esp32_s3_matrix.vid.0=0x303a
ws_esp32_s3_matrix.pid.0=0x81FB
ws_esp32_s3_matrix.upload_port.0.vid=0x303a
ws_esp32_s3_matrix.upload_port.0.pid=0x81FB

ws_esp32_s3_matrix.bootloader.tool=esptool_py
ws_esp32_s3_matrix.bootloader.tool.default=esptool_py

ws_esp32_s3_matrix.upload.tool=esptool_py
ws_esp32_s3_matrix.upload.tool.default=esptool_py
ws_esp32_s3_matrix.upload.tool.network=esp_ota

ws_esp32_s3_matrix.upload.maximum_size=1310720

ws_esp32_s3_matrix.upload.maximum_data_size=327680
ws_esp32_s3_matrix.upload.flags=
ws_esp32_s3_matrix.upload.extra_flags=
ws_esp32_s3_matrix.upload.use_1200bps_touch=false
ws_esp32_s3_matrix.upload.wait_for_upload_port=false

ws_esp32_s3_matrix.serial.disableDTR=false
ws_esp32_s3_matrix.serial.disableRTS=false

ws_esp32_s3_matrix.build.tarch=xtensa
ws_esp32_s3_matrix.build.bootloader_addr=0x0
ws_esp32_s3_matrix.build.target=esp32s3
ws_esp32_s3_matrix.build.mcu=esp32s3
ws_esp32_s3_matrix.build.core=esp32
ws_esp32_s3_matrix.build.variant=ws_esp32_s3_matrix
ws_esp32_s3_matrix.build.board=WS_ESP32_S3_MATRIX

ws_esp32_s3_matrix.build.usb_mode=1
ws_esp32_s3_matrix.build.cdc_on_boot=0
ws_esp32_s3_matrix.build.msc_on_boot=0
ws_esp32_s3_matrix.build.dfu_on_boot=0
ws_esp32_s3_matrix.build.f_cpu=240000000L
ws_esp32_s3_matrix.build.flash_size=4MB
ws_esp32_s3_matrix.build.flash_freq=80m
ws_esp32_s3_matrix.build.flash_mode=dio
ws_esp32_s3_matrix.build.boot=qio
ws_esp32_s3_matrix.build.boot_freq=80m
ws_esp32_s3_matrix.build.partitions=default
ws_esp32_s3_matrix.build.defines=
ws_esp32_s3_matrix.build.loop_core=
ws_esp32_s3_matrix.build.event_core=
ws_esp32_s3_matrix.build.psram_type=qspi
ws_esp32_s3_matrix.build.memory_type={build.boot}_{build.psram_type}

ws_esp32_s3_matrix.menu.PSRAM.disabled=Disabled
ws_esp32_s3_matrix.menu.PSRAM.disabled.build.defines=
ws_esp32_s3_matrix.menu.PSRAM.disabled.build.psram_type=qspi
ws_esp32_s3_matrix.menu.PSRAM.enabled=Enabled
ws_esp32_s3_matrix.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
ws_esp32_s3_matrix.menu.PSRAM.enabled.build.psram_type=qspi

ws_esp32_s3_matrix.menu.FlashMode.qio=QIO 80MHz
ws_esp32_s3_matrix.menu.FlashMode.qio.build.flash_mode=dio
ws_esp32_s3_matrix.menu.FlashMode.qio.build.boot=qio
ws_esp32_s3_matrix.menu.FlashMode.qio.build.boot_freq=80m
ws_esp32_s3_matrix.menu.FlashMode.qio.build.flash_freq=80m
ws_esp32_s3_matrix.menu.FlashMode.qio120=QIO 120MHz
ws_esp32_s3_matrix.menu.FlashMode.qio120.build.flash_mode=dio
ws_esp32_s3_matrix.menu.FlashMode.qio120.build.boot=qio
ws_esp32_s3_matrix.menu.FlashMode.qio120.build.boot_freq=120m
ws_esp32_s3_matrix.menu.FlashMode.qio120.build.flash_freq=80m

ws_esp32_s3_matrix.menu.FlashSize.4M=4MB (32Mb)
ws_esp32_s3_matrix.menu.FlashSize.4M.build.flash_size=4MB

ws_esp32_s3_matrix.menu.LoopCore.1=Core 1
ws_esp32_s3_matrix.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
ws_esp32_s3_matrix.menu.LoopCore.0=Core 0
ws_esp32_s3_matrix.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

ws_esp32_s3_matrix.menu.EventsCore.1=Core 1
ws_esp32_s3_matrix.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
ws_esp32_s3_matrix.menu.EventsCore.0=Core 0
ws_esp32_s3_matrix.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

ws_esp32_s3_matrix.menu.USBMode.hwcdc=Hardware CDC and JTAG
ws_esp32_s3_matrix.menu.USBMode.hwcdc.build.usb_mode=1
ws_esp32_s3_matrix.menu.USBMode.default=USB-OTG (TinyUSB)
ws_esp32_s3_matrix.menu.USBMode.default.build.usb_mode=0

ws_esp32_s3_matrix.menu.CDCOnBoot.default=Disabled
ws_esp32_s3_matrix.menu.CDCOnBoot.default.build.cdc_on_boot=0
ws_esp32_s3_matrix.menu.CDCOnBoot.cdc=Enabled
ws_esp32_s3_matrix.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

ws_esp32_s3_matrix.menu.MSCOnBoot.default=Disabled
ws_esp32_s3_matrix.menu.MSCOnBoot.default.build.msc_on_boot=0
ws_esp32_s3_matrix.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
ws_esp32_s3_matrix.menu.MSCOnBoot.msc.build.msc_on_boot=1

ws_esp32_s3_matrix.menu.DFUOnBoot.default=Disabled
ws_esp32_s3_matrix.menu.DFUOnBoot.default.build.dfu_on_boot=0
ws_esp32_s3_matrix.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
ws_esp32_s3_matrix.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

