espressif/arduino-esp32/boards.txt
ws_esp32_s3_matrix.menu.UploadMode.default=UART0 / Hardware CDC
ws_esp32_s3_matrix.menu.UploadMode.default.upload.use_1200bps_touch=false
ws_esp32_s3_matrix.menu.UploadMode.default.upload.wait_for_upload_port=false
ws_esp32_s3_matrix.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
ws_esp32_s3_matrix.menu.UploadMode.cdc.upload.use_1200bps_touch=true
ws_esp32_s3_matrix.menu.UploadMode.cdc.upload.wait_for_upload_port=true

ws_esp32_s3_matrix.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ws_esp32_s3_matrix.menu.PartitionScheme.default.build.partitions=default
ws_esp32_s3_matrix.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ws_esp32_s3_matrix.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ws_esp32_s3_matrix.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ws_esp32_s3_matrix.menu.PartitionScheme.no_ota.build.partitions=no_ota
ws_esp32_s3_matrix.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ws_esp32_s3_matrix.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ws_esp32_s3_matrix.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ws_esp32_s3_matrix.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ws_esp32_s3_matrix.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ws_esp32_s3_matrix.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ws_esp32_s3_matrix.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ws_esp32_s3_matrix.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ws_esp32_s3_matrix.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ws_esp32_s3_matrix.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ws_esp32_s3_matrix.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ws_esp32_s3_matrix.menu.PartitionScheme.huge_app.build.partitions=huge_app
ws_esp32_s3_matrix.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ws_esp32_s3_matrix.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ws_esp32_s3_matrix.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ws_esp32_s3_matrix.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ws_esp32_s3_matrix.menu.PartitionScheme.rainmaker=RainMaker 4MB
ws_esp32_s3_matrix.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
ws_esp32_s3_matrix.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
ws_esp32_s3_matrix.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
ws_esp32_s3_matrix.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
ws_esp32_s3_matrix.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656

ws_esp32_s3_matrix.menu.PartitionScheme.otanofs=OTA no FS (2MB APP with OTA)
ws_esp32_s3_matrix.menu.PartitionScheme.otanofs.build.custom_partitions=partitions_otanofs_4MB
ws_esp32_s3_matrix.menu.PartitionScheme.otanofs.upload.maximum_size=2031616
ws_esp32_s3_matrix.menu.PartitionScheme.all_app=Max APP (4MB APP no OTA)
ws_esp32_s3_matrix.menu.PartitionScheme.all_app.build.custom_partitions=partitions_all_app_4MB
ws_esp32_s3_matrix.menu.PartitionScheme.all_app.upload.maximum_size=4128768

ws_esp32_s3_matrix.menu.PartitionScheme.custom=Custom
ws_esp32_s3_matrix.menu.PartitionScheme.custom.build.partitions=
ws_esp32_s3_matrix.menu.PartitionScheme.custom.upload.maximum_size=16777216

ws_esp32_s3_matrix.menu.CPUFreq.240=240MHz (WiFi)
ws_esp32_s3_matrix.menu.CPUFreq.240.build.f_cpu=240000000L
ws_esp32_s3_matrix.menu.CPUFreq.160=160MHz (WiFi)
ws_esp32_s3_matrix.menu.CPUFreq.160.build.f_cpu=160000000L
ws_esp32_s3_matrix.menu.CPUFreq.80=80MHz (WiFi)
ws_esp32_s3_matrix.menu.CPUFreq.80.build.f_cpu=80000000L
ws_esp32_s3_matrix.menu.CPUFreq.40=40MHz
ws_esp32_s3_matrix.menu.CPUFreq.40.build.f_cpu=40000000L
ws_esp32_s3_matrix.menu.CPUFreq.20=20MHz
ws_esp32_s3_matrix.menu.CPUFreq.20.build.f_cpu=20000000L
ws_esp32_s3_matrix.menu.CPUFreq.10=10MHz
ws_esp32_s3_matrix.menu.CPUFreq.10.build.f_cpu=10000000L

ws_esp32_s3_matrix.menu.UploadSpeed.921600=921600
ws_esp32_s3_matrix.menu.UploadSpeed.921600.upload.speed=921600
ws_esp32_s3_matrix.menu.UploadSpeed.115200=115200
ws_esp32_s3_matrix.menu.UploadSpeed.115200.upload.speed=115200
ws_esp32_s3_matrix.menu.UploadSpeed.256000.windows=256000
ws_esp32_s3_matrix.menu.UploadSpeed.256000.upload.speed=256000
ws_esp32_s3_matrix.menu.UploadSpeed.230400.windows.upload.speed=256000
ws_esp32_s3_matrix.menu.UploadSpeed.230400=230400
ws_esp32_s3_matrix.menu.UploadSpeed.230400.upload.speed=230400
ws_esp32_s3_matrix.menu.UploadSpeed.460800.linux=460800
ws_esp32_s3_matrix.menu.UploadSpeed.460800.macosx=460800
ws_esp32_s3_matrix.menu.UploadSpeed.460800.upload.speed=460800
ws_esp32_s3_matrix.menu.UploadSpeed.512000.windows=512000
ws_esp32_s3_matrix.menu.UploadSpeed.512000.upload.speed=512000

ws_esp32_s3_matrix.menu.DebugLevel.none=None
ws_esp32_s3_matrix.menu.DebugLevel.none.build.code_debug=0
ws_esp32_s3_matrix.menu.DebugLevel.error=Error
ws_esp32_s3_matrix.menu.DebugLevel.error.build.code_debug=1
ws_esp32_s3_matrix.menu.DebugLevel.warn=Warn
ws_esp32_s3_matrix.menu.DebugLevel.warn.build.code_debug=2
ws_esp32_s3_matrix.menu.DebugLevel.info=Info
ws_esp32_s3_matrix.menu.DebugLevel.info.build.code_debug=3
ws_esp32_s3_matrix.menu.DebugLevel.debug=Debug
ws_esp32_s3_matrix.menu.DebugLevel.debug.build.code_debug=4
ws_esp32_s3_matrix.menu.DebugLevel.verbose=Verbose
ws_esp32_s3_matrix.menu.DebugLevel.verbose.build.code_debug=5

ws_esp32_s3_matrix.menu.EraseFlash.none=Disabled
ws_esp32_s3_matrix.menu.EraseFlash.none.upload.erase_cmd=
ws_esp32_s3_matrix.menu.EraseFlash.all=Enabled
ws_esp32_s3_matrix.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

waveshare_esp32_s3_touch_lcd_169.name=Waveshare ESP32-S3-Touch-LCD-1.69
waveshare_esp32_s3_touch_lcd_169.vid.0=0x303a
waveshare_esp32_s3_touch_lcd_169.pid.0=0x821E
waveshare_esp32_s3_touch_lcd_169.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_lcd_169.upload_port.0.pid=0x821E

waveshare_esp32_s3_touch_lcd_169.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_lcd_169.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_lcd_169.upload.tool=esptool_py
waveshare_esp32_s3_touch_lcd_169.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_lcd_169.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_lcd_169.upload.maximum_size=1310720

