espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.otanofs=OTA no FS (2MB APP with OTA)
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.otanofs.build.custom_partitions=partitions_otanofs_4MB
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.otanofs.upload.maximum_size=2031616
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.all_app=Max APP (4MB APP no OTA)
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.all_app.build.custom_partitions=partitions_all_app_4MB
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.all_app.upload.maximum_size=4128768

waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.custom=Custom
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.custom.build.partitions=
waveshare_esp32_s3_touch_lcd_169.menu.PartitionScheme.custom.upload.maximum_size=16777216

waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.240=240MHz (WiFi)
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.40=40MHz
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.20=20MHz
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.10=10MHz
waveshare_esp32_s3_touch_lcd_169.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_touch_lcd_169.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_lcd_169.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_lcd_169.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_lcd_169.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_lcd_169.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_lcd_169.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

waveshare_esp32_s3_touch_amoled_18.name=Waveshare ESP32-S3-Touch-AMOLED-1.8
waveshare_esp32_s3_touch_amoled_18.vid.0=0x303a
waveshare_esp32_s3_touch_amoled_18.pid.0=0x8255
waveshare_esp32_s3_touch_amoled_18.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_amoled_18.upload_port.0.pid=0x8255

waveshare_esp32_s3_touch_amoled_18.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_amoled_18.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_amoled_18.upload.tool=esptool_py
waveshare_esp32_s3_touch_amoled_18.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_amoled_18.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_amoled_18.upload.maximum_size=1310720

waveshare_esp32_s3_touch_amoled_18.upload.maximum_data_size=327680
waveshare_esp32_s3_touch_amoled_18.upload.flags=
waveshare_esp32_s3_touch_amoled_18.upload.extra_flags=
waveshare_esp32_s3_touch_amoled_18.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_18.upload.wait_for_upload_port=false

waveshare_esp32_s3_touch_amoled_18.serial.disableDTR=false
waveshare_esp32_s3_touch_amoled_18.serial.disableRTS=false

waveshare_esp32_s3_touch_amoled_18.build.tarch=xtensa
waveshare_esp32_s3_touch_amoled_18.build.bootloader_addr=0x0
waveshare_esp32_s3_touch_amoled_18.build.target=esp32s3
waveshare_esp32_s3_touch_amoled_18.build.mcu=esp32s3
waveshare_esp32_s3_touch_amoled_18.build.core=esp32
waveshare_esp32_s3_touch_amoled_18.build.variant=waveshare_esp32_s3_touch_amoled_18
waveshare_esp32_s3_touch_amoled_18.build.board=WAVESHARE_ESP32_S3_TOUCH_AMOLED_18

waveshare_esp32_s3_touch_amoled_18.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_18.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_18.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_18.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_18.build.f_cpu=240000000L
waveshare_esp32_s3_touch_amoled_18.build.flash_size=16MB
waveshare_esp32_s3_touch_amoled_18.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_18.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_18.build.boot=qio
waveshare_esp32_s3_touch_amoled_18.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_18.build.partitions=default
waveshare_esp32_s3_touch_amoled_18.build.defines=
waveshare_esp32_s3_touch_amoled_18.build.loop_core=
waveshare_esp32_s3_touch_amoled_18.build.event_core=
waveshare_esp32_s3_touch_amoled_18.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_18.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_touch_amoled_18.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_touch_amoled_18.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_touch_amoled_18.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_18.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_touch_amoled_18.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_touch_amoled_18.menu.PSRAM.enabled.build.psram_type=opi

waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_touch_amoled_18.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_touch_amoled_18.menu.LoopCore.1=Core 1
waveshare_esp32_s3_touch_amoled_18.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_18.menu.LoopCore.0=Core 0
waveshare_esp32_s3_touch_amoled_18.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

