espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_touch_amoled_18.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_amoled_18.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_amoled_18.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_amoled_18.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_amoled_18.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_amoled_18.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

waveshare_esp32_s3_lcd_169.name=Waveshare ESP32-S3-LCD-1.69
waveshare_esp32_s3_lcd_169.vid.0=0x303a
waveshare_esp32_s3_lcd_169.pid.0=0x8221
waveshare_esp32_s3_lcd_169.upload_port.0.vid=0x303a
waveshare_esp32_s3_lcd_169.upload_port.0.pid=0x8221

waveshare_esp32_s3_lcd_169.bootloader.tool=esptool_py
waveshare_esp32_s3_lcd_169.bootloader.tool.default=esptool_py

waveshare_esp32_s3_lcd_169.upload.tool=esptool_py
waveshare_esp32_s3_lcd_169.upload.tool.default=esptool_py
waveshare_esp32_s3_lcd_169.upload.tool.network=esp_ota

waveshare_esp32_s3_lcd_169.upload.maximum_size=1310720

waveshare_esp32_s3_lcd_169.upload.maximum_data_size=327680
waveshare_esp32_s3_lcd_169.upload.flags=
waveshare_esp32_s3_lcd_169.upload.extra_flags=
waveshare_esp32_s3_lcd_169.upload.use_1200bps_touch=false
waveshare_esp32_s3_lcd_169.upload.wait_for_upload_port=false

waveshare_esp32_s3_lcd_169.serial.disableDTR=false
waveshare_esp32_s3_lcd_169.serial.disableRTS=false

waveshare_esp32_s3_lcd_169.build.tarch=xtensa
waveshare_esp32_s3_lcd_169.build.bootloader_addr=0x0
waveshare_esp32_s3_lcd_169.build.target=esp32s3
waveshare_esp32_s3_lcd_169.build.mcu=esp32s3
waveshare_esp32_s3_lcd_169.build.core=esp32
waveshare_esp32_s3_lcd_169.build.variant=waveshare_esp32_s3_lcd_169
waveshare_esp32_s3_lcd_169.build.board=WAVESHARE_ESP32_S3_LCD_169

waveshare_esp32_s3_lcd_169.build.usb_mode=1
waveshare_esp32_s3_lcd_169.build.cdc_on_boot=0
waveshare_esp32_s3_lcd_169.build.msc_on_boot=0
waveshare_esp32_s3_lcd_169.build.dfu_on_boot=0
waveshare_esp32_s3_lcd_169.build.f_cpu=240000000L
waveshare_esp32_s3_lcd_169.build.flash_size=16MB
waveshare_esp32_s3_lcd_169.build.flash_freq=80m
waveshare_esp32_s3_lcd_169.build.flash_mode=dio
waveshare_esp32_s3_lcd_169.build.boot=qio
waveshare_esp32_s3_lcd_169.build.boot_freq=80m
waveshare_esp32_s3_lcd_169.build.partitions=default
waveshare_esp32_s3_lcd_169.build.defines=
waveshare_esp32_s3_lcd_169.build.loop_core=
waveshare_esp32_s3_lcd_169.build.event_core=
waveshare_esp32_s3_lcd_169.build.psram_type=qspi
waveshare_esp32_s3_lcd_169.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_lcd_169.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_lcd_169.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_lcd_169.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_lcd_169.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_lcd_169.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_lcd_169.menu.PSRAM.enabled.build.psram_type=opi

waveshare_esp32_s3_lcd_169.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_lcd_169.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_lcd_169.menu.LoopCore.1=Core 1
waveshare_esp32_s3_lcd_169.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_lcd_169.menu.LoopCore.0=Core 0
waveshare_esp32_s3_lcd_169.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_lcd_169.menu.EventsCore.1=Core 1
waveshare_esp32_s3_lcd_169.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_lcd_169.menu.EventsCore.0=Core 0
waveshare_esp32_s3_lcd_169.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

waveshare_esp32_s3_lcd_169.menu.USBMode.hwcdc=Hardware CDC and JTAG
waveshare_esp32_s3_lcd_169.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_lcd_169.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_lcd_169.menu.USBMode.default.build.usb_mode=0

waveshare_esp32_s3_lcd_169.menu.CDCOnBoot.default=Disabled
waveshare_esp32_s3_lcd_169.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_lcd_169.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_lcd_169.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_s3_lcd_169.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_lcd_169.menu.MSCOnBoot.default.build.msc_on_boot=0
waveshare_esp32_s3_lcd_169.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_lcd_169.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_lcd_169.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_lcd_169.menu.DFUOnBoot.default.build.dfu_on_boot=0
waveshare_esp32_s3_lcd_169.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_lcd_169.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

