espressif/arduino-esp32/boards.txt
##############################################################

waveshare_esp32s3_touch_lcd_128.name=Waveshare ESP32S3 Touch LCD 128

waveshare_esp32s3_touch_lcd_128.upload.tool=esptool_py
waveshare_esp32s3_touch_lcd_128.upload.tool.default=esptool_py
waveshare_esp32s3_touch_lcd_128.upload.tool.network=esp_ota
waveshare_esp32s3_touch_lcd_128.upload.maximum_size=16777216
waveshare_esp32s3_touch_lcd_128.upload.maximum_data_size=327680
waveshare_esp32s3_touch_lcd_128.upload.wait_for_upload_port=false
waveshare_esp32s3_touch_lcd_128.upload.speed=460800
waveshare_esp32s3_touch_lcd_128.upload.flags=
waveshare_esp32s3_touch_lcd_128.upload.extra_flags=

waveshare_esp32s3_touch_lcd_128.bootloader.tool=esptool_py
waveshare_esp32s3_touch_lcd_128.bootloader.tool.default=esptool_py

waveshare_esp32s3_touch_lcd_128.serial.disableDTR=true
waveshare_esp32s3_touch_lcd_128.serial.disableRTS=true

waveshare_esp32s3_touch_lcd_128.build.tarch=xtensa
waveshare_esp32s3_touch_lcd_128.build.bootloader_addr=0x0
waveshare_esp32s3_touch_lcd_128.build.mcu=esp32s3
waveshare_esp32s3_touch_lcd_128.build.core=esp32
waveshare_esp32s3_touch_lcd_128.build.target=esp32s3
waveshare_esp32s3_touch_lcd_128.build.variant=waveshare_esp32s3_touch_lcd_128
waveshare_esp32s3_touch_lcd_128.build.board=WAVESHARE_ESP32S3_TOUCH_LCD_128

waveshare_esp32s3_touch_lcd_128.build.usb_mode=1
waveshare_esp32s3_touch_lcd_128.build.cdc_on_boot=1
waveshare_esp32s3_touch_lcd_128.build.msc_on_boot=0
waveshare_esp32s3_touch_lcd_128.build.dfu_on_boot=0

waveshare_esp32s3_touch_lcd_128.build.f_cpu=240000000L
waveshare_esp32s3_touch_lcd_128.build.flash_size=16MB
waveshare_esp32s3_touch_lcd_128.build.flash_freq=80m
waveshare_esp32s3_touch_lcd_128.build.flash_mode=dio
waveshare_esp32s3_touch_lcd_128.build.boot=dio
waveshare_esp32s3_touch_lcd_128.build.partitions=default

waveshare_esp32s3_touch_lcd_128.menu.PSRAM.disabled=Disabled
waveshare_esp32s3_touch_lcd_128.menu.PSRAM.disabled.build.defines=
waveshare_esp32s3_touch_lcd_128.menu.PSRAM.enabled=Enabled
waveshare_esp32s3_touch_lcd_128.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32s3_touch_lcd_128.menu.PSRAM.enabled.build.psram_type=qspi

waveshare_esp32s3_touch_lcd_128.menu.LoopCore.1=Core 1
waveshare_esp32s3_touch_lcd_128.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32s3_touch_lcd_128.menu.LoopCore.0=Core 0
waveshare_esp32s3_touch_lcd_128.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32s3_touch_lcd_128.menu.EventsCore.1=Core 1
waveshare_esp32s3_touch_lcd_128.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32s3_touch_lcd_128.menu.EventsCore.0=Core 0
waveshare_esp32s3_touch_lcd_128.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.default.build.partitions=default
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.minimal.build.partitions=minimal
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.no_ota.build.partitions=no_ota
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.huge_app.build.partitions=huge_app
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.fatflash.build.partitions=ffat
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
waveshare_esp32s3_touch_lcd_128.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.240=240MHz (WiFi/BT)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.160=160MHz (WiFi/BT)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.80=80MHz (WiFi/BT)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.40=40MHz (40MHz XTAL)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.26=26MHz (26MHz XTAL)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.26.build.f_cpu=26000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.20=20MHz (40MHz XTAL)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.13=13MHz (26MHz XTAL)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.13.build.f_cpu=13000000L
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.10=10MHz (40MHz XTAL)
waveshare_esp32s3_touch_lcd_128.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32s3_touch_lcd_128.menu.FlashMode.qio=QIO
waveshare_esp32s3_touch_lcd_128.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32s3_touch_lcd_128.menu.FlashMode.qio.build.boot=qio
waveshare_esp32s3_touch_lcd_128.menu.FlashMode.dio=DIO
waveshare_esp32s3_touch_lcd_128.menu.FlashMode.dio.build.flash_mode=dio
waveshare_esp32s3_touch_lcd_128.menu.FlashMode.dio.build.boot=dio

waveshare_esp32s3_touch_lcd_128.menu.FlashFreq.80=80MHz
waveshare_esp32s3_touch_lcd_128.menu.FlashFreq.80.build.flash_freq=80m
waveshare_esp32s3_touch_lcd_128.menu.FlashFreq.40=40MHz
waveshare_esp32s3_touch_lcd_128.menu.FlashFreq.40.build.flash_freq=40m

