espressif/arduino-esp32/boards.txt
weact_studio_esp32c3.menu.FlashFreq.80=80MHz
weact_studio_esp32c3.menu.FlashFreq.80.build.flash_freq=80m
weact_studio_esp32c3.menu.FlashFreq.40=40MHz
weact_studio_esp32c3.menu.FlashFreq.40.build.flash_freq=40m

weact_studio_esp32c3.menu.UploadSpeed.921600=921600
weact_studio_esp32c3.menu.UploadSpeed.921600.upload.speed=921600
weact_studio_esp32c3.menu.UploadSpeed.115200=115200
weact_studio_esp32c3.menu.UploadSpeed.115200.upload.speed=115200
weact_studio_esp32c3.menu.UploadSpeed.256000.windows=256000
weact_studio_esp32c3.menu.UploadSpeed.256000.upload.speed=256000
weact_studio_esp32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
weact_studio_esp32c3.menu.UploadSpeed.230400=230400
weact_studio_esp32c3.menu.UploadSpeed.230400.upload.speed=230400
weact_studio_esp32c3.menu.UploadSpeed.460800.linux=460800
weact_studio_esp32c3.menu.UploadSpeed.460800.macosx=460800
weact_studio_esp32c3.menu.UploadSpeed.460800.upload.speed=460800
weact_studio_esp32c3.menu.UploadSpeed.512000.windows=512000
weact_studio_esp32c3.menu.UploadSpeed.512000.upload.speed=512000

weact_studio_esp32c3.menu.DebugLevel.none=None
weact_studio_esp32c3.menu.DebugLevel.none.build.code_debug=0
weact_studio_esp32c3.menu.DebugLevel.error=Error
weact_studio_esp32c3.menu.DebugLevel.error.build.code_debug=1
weact_studio_esp32c3.menu.DebugLevel.warn=Warn
weact_studio_esp32c3.menu.DebugLevel.warn.build.code_debug=2
weact_studio_esp32c3.menu.DebugLevel.info=Info
weact_studio_esp32c3.menu.DebugLevel.info.build.code_debug=3
weact_studio_esp32c3.menu.DebugLevel.debug=Debug
weact_studio_esp32c3.menu.DebugLevel.debug.build.code_debug=4
weact_studio_esp32c3.menu.DebugLevel.verbose=Verbose
weact_studio_esp32c3.menu.DebugLevel.verbose.build.code_debug=5

weact_studio_esp32c3.menu.EraseFlash.none=Disabled
weact_studio_esp32c3.menu.EraseFlash.none.upload.erase_cmd=
weact_studio_esp32c3.menu.EraseFlash.all=Enabled
weact_studio_esp32c3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

aslcanx2.name=AutosportLabs ESP-CAN-X2

aslcanx2.bootloader.tool=esptool_py
aslcanx2.bootloader.tool.default=esptool_py

aslcanx2.upload.tool=esptool_py
aslcanx2.upload.tool.default=esptool_py
aslcanx2.upload.tool.network=esp_ota

aslcanx2.upload.maximum_size=1310720
aslcanx2.upload.maximum_data_size=327680
aslcanx2.upload.flags=
aslcanx2.upload.extra_flags=
aslcanx2.upload.use_1200bps_touch=false
aslcanx2.upload.wait_for_upload_port=false

aslcanx2.serial.disableDTR=false
aslcanx2.serial.disableRTS=false

aslcanx2.build.tarch=xtensa
aslcanx2.build.bootloader_addr=0x0
aslcanx2.build.target=esp32s3
aslcanx2.build.mcu=esp32s3
aslcanx2.build.core=esp32
aslcanx2.build.variant=aslcanx2
aslcanx2.build.board=ASL_CAN_X2

aslcanx2.build.usb_mode=1
aslcanx2.build.cdc_on_boot=0
aslcanx2.build.msc_on_boot=0
aslcanx2.build.dfu_on_boot=0
aslcanx2.build.f_cpu=240000000L
aslcanx2.build.flash_size=8MB
aslcanx2.build.flash_freq=80m
aslcanx2.build.flash_mode=dio
aslcanx2.build.boot=qio
aslcanx2.build.boot_freq=80m
aslcanx2.build.partitions=default_8MB
aslcanx2.build.defines=
aslcanx2.build.loop_core=
aslcanx2.build.event_core=
aslcanx2.build.psram_type=qspi
aslcanx2.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
aslcanx2.menu.JTAGAdapter.default=Disabled
aslcanx2.menu.JTAGAdapter.default.build.copy_jtag_files=0
aslcanx2.menu.JTAGAdapter.builtin=Integrated USB JTAG
aslcanx2.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
aslcanx2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
aslcanx2.menu.JTAGAdapter.external=FTDI Adapter
aslcanx2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
aslcanx2.menu.JTAGAdapter.external.build.copy_jtag_files=1
aslcanx2.menu.JTAGAdapter.bridge=ESP USB Bridge
aslcanx2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
aslcanx2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

aslcanx2.menu.PSRAM.disabled=Disabled
aslcanx2.menu.PSRAM.disabled.build.defines=
aslcanx2.menu.PSRAM.disabled.build.psram_type=qspi
aslcanx2.menu.PSRAM.opi=OPI PSRAM
aslcanx2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
aslcanx2.menu.PSRAM.opi.build.psram_type=opi

aslcanx2.menu.FlashMode.qio=QIO 80MHz
aslcanx2.menu.FlashMode.qio.build.flash_mode=dio
aslcanx2.menu.FlashMode.qio.build.boot=qio
aslcanx2.menu.FlashMode.qio.build.boot_freq=80m
aslcanx2.menu.FlashMode.qio.build.flash_freq=80m
aslcanx2.menu.FlashMode.qio120=QIO 120MHz
aslcanx2.menu.FlashMode.qio120.build.flash_mode=dio
aslcanx2.menu.FlashMode.qio120.build.boot=qio
aslcanx2.menu.FlashMode.qio120.build.boot_freq=120m
aslcanx2.menu.FlashMode.qio120.build.flash_freq=80m
aslcanx2.menu.FlashMode.dio=DIO 80MHz
aslcanx2.menu.FlashMode.dio.build.flash_mode=dio
aslcanx2.menu.FlashMode.dio.build.boot=dio
aslcanx2.menu.FlashMode.dio.build.boot_freq=80m
aslcanx2.menu.FlashMode.dio.build.flash_freq=80m
aslcanx2.menu.FlashMode.opi=OPI 80MHz
aslcanx2.menu.FlashMode.opi.build.flash_mode=dout
aslcanx2.menu.FlashMode.opi.build.boot=opi
aslcanx2.menu.FlashMode.opi.build.boot_freq=80m
aslcanx2.menu.FlashMode.opi.build.flash_freq=80m

aslcanx2.menu.LoopCore.1=Core 1
aslcanx2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
aslcanx2.menu.LoopCore.0=Core 0
aslcanx2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

aslcanx2.menu.EventsCore.1=Core 1
aslcanx2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
aslcanx2.menu.EventsCore.0=Core 0
aslcanx2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

aslcanx2.menu.USBMode.hwcdc=Hardware CDC and JTAG
aslcanx2.menu.USBMode.hwcdc.build.usb_mode=1
aslcanx2.menu.USBMode.default=USB-OTG (TinyUSB)
aslcanx2.menu.USBMode.default.build.usb_mode=0

aslcanx2.menu.CDCOnBoot.default=Enabled
aslcanx2.menu.CDCOnBoot.default.build.cdc_on_boot=1
aslcanx2.menu.CDCOnBoot.cdc=Disabled
aslcanx2.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

aslcanx2.menu.MSCOnBoot.default=Disabled
aslcanx2.menu.MSCOnBoot.default.build.msc_on_boot=0
aslcanx2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
aslcanx2.menu.MSCOnBoot.msc.build.msc_on_boot=1

aslcanx2.menu.DFUOnBoot.default=Disabled
aslcanx2.menu.DFUOnBoot.default.build.dfu_on_boot=0
aslcanx2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
aslcanx2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

aslcanx2.menu.UploadMode.default=UART0 / Hardware CDC
aslcanx2.menu.UploadMode.default.upload.use_1200bps_touch=false
aslcanx2.menu.UploadMode.default.upload.wait_for_upload_port=false
aslcanx2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
aslcanx2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
aslcanx2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

aslcanx2.menu.PartitionScheme.default=Default with spiffs (3MB APP/1.5MB SPIFFS)
aslcanx2.menu.PartitionScheme.default.build.partitions=default_8MB
aslcanx2.menu.PartitionScheme.default.upload.maximum_size=3342336
aslcanx2.menu.PartitionScheme.defaultffat=Default with ffat (3MB APP/1.5MB FATFS)
aslcanx2.menu.PartitionScheme.defaultffat.build.partitions=default_8MB_ffat
aslcanx2.menu.PartitionScheme.defaultffat.upload.maximum_size=3342336
aslcanx2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
aslcanx2.menu.PartitionScheme.minimal.build.partitions=minimal
aslcanx2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
aslcanx2.menu.PartitionScheme.no_ota.build.partitions=no_ota
aslcanx2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
aslcanx2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
aslcanx2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
aslcanx2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
aslcanx2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
aslcanx2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
aslcanx2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
aslcanx2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
aslcanx2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
aslcanx2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
aslcanx2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
aslcanx2.menu.PartitionScheme.huge_app.build.partitions=huge_app
aslcanx2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
aslcanx2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
aslcanx2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
aslcanx2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
aslcanx2.menu.PartitionScheme.rainmaker=RainMaker 4MB
aslcanx2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
aslcanx2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
aslcanx2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
aslcanx2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
aslcanx2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
aslcanx2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
aslcanx2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
aslcanx2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000

