espressif/arduino-esp32/boards.txt
walter.menu.UploadSpeed.921600=921600
walter.menu.UploadSpeed.921600.upload.speed=921600
walter.menu.UploadSpeed.115200=115200
walter.menu.UploadSpeed.115200.upload.speed=115200
walter.menu.UploadSpeed.256000.windows=256000
walter.menu.UploadSpeed.256000.upload.speed=256000
walter.menu.UploadSpeed.230400.windows.upload.speed=256000
walter.menu.UploadSpeed.230400=230400
walter.menu.UploadSpeed.230400.upload.speed=230400
walter.menu.UploadSpeed.460800.linux=460800
walter.menu.UploadSpeed.460800.macosx=460800
walter.menu.UploadSpeed.460800.upload.speed=460800
walter.menu.UploadSpeed.512000.windows=512000
walter.menu.UploadSpeed.512000.upload.speed=512000

walter.menu.DebugLevel.none=None
walter.menu.DebugLevel.none.build.code_debug=0
walter.menu.DebugLevel.error=Error
walter.menu.DebugLevel.error.build.code_debug=1
walter.menu.DebugLevel.warn=Warn
walter.menu.DebugLevel.warn.build.code_debug=2
walter.menu.DebugLevel.info=Info
walter.menu.DebugLevel.info.build.code_debug=3
walter.menu.DebugLevel.debug=Debug
walter.menu.DebugLevel.debug.build.code_debug=4
walter.menu.DebugLevel.verbose=Verbose
walter.menu.DebugLevel.verbose.build.code_debug=5

walter.menu.EraseFlash.none=Disabled
walter.menu.EraseFlash.none.upload.erase_cmd=
walter.menu.EraseFlash.all=Enabled
walter.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

elecrow_crowpanel_7.name=Elecrow CrowPanel 7.0P

elecrow_crowpanel_7.upload.tool=esptool_py
elecrow_crowpanel_7.upload.tool.default=esptool_py
elecrow_crowpanel_7.upload.tool.network=esp_ota
elecrow_crowpanel_7.upload.maximum_size=1310720
elecrow_crowpanel_7.upload.maximum_data_size=327680
elecrow_crowpanel_7.upload.wait_for_upload_port=false
elecrow_crowpanel_7.upload.speed=460800
elecrow_crowpanel_7.upload.flags=
elecrow_crowpanel_7.upload.extra_flags=

elecrow_crowpanel_7.bootloader.tool=esptool_py
elecrow_crowpanel_7.bootloader.tool.default=esptool_py

elecrow_crowpanel_7.serial.disableDTR=true
elecrow_crowpanel_7.serial.disableRTS=true

elecrow_crowpanel_7.build.tarch=xtensa
elecrow_crowpanel_7.build.bootloader_addr=0x0
elecrow_crowpanel_7.build.mcu=esp32s3
elecrow_crowpanel_7.build.core=esp32
elecrow_crowpanel_7.build.target=esp32s3
elecrow_crowpanel_7.build.variant=elecrow_crowpanel_7
elecrow_crowpanel_7.build.board=ELECROW_CROWPANEL_7

elecrow_crowpanel_7.build.usb_mode=1
elecrow_crowpanel_7.build.cdc_on_boot=1
elecrow_crowpanel_7.build.msc_on_boot=0
elecrow_crowpanel_7.build.dfu_on_boot=0

elecrow_crowpanel_7.build.f_cpu=240000000L
elecrow_crowpanel_7.build.flash_size=4MB
elecrow_crowpanel_7.build.flash_freq=80m
elecrow_crowpanel_7.build.flash_mode=dio
elecrow_crowpanel_7.build.boot=dio
elecrow_crowpanel_7.build.partitions=default

elecrow_crowpanel_7.menu.PSRAM.disabled=Disabled
elecrow_crowpanel_7.menu.PSRAM.disabled.build.defines=
elecrow_crowpanel_7.menu.PSRAM.enabled=Enabled
elecrow_crowpanel_7.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
elecrow_crowpanel_7.menu.PSRAM.enabled.build.psram_type=opi

elecrow_crowpanel_7.menu.LoopCore.1=Core 1
elecrow_crowpanel_7.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
elecrow_crowpanel_7.menu.LoopCore.0=Core 0
elecrow_crowpanel_7.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

elecrow_crowpanel_7.menu.EventsCore.1=Core 1
elecrow_crowpanel_7.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
elecrow_crowpanel_7.menu.EventsCore.0=Core 0
elecrow_crowpanel_7.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

elecrow_crowpanel_7.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
elecrow_crowpanel_7.menu.PartitionScheme.default.build.partitions=default
elecrow_crowpanel_7.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
elecrow_crowpanel_7.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
elecrow_crowpanel_7.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
elecrow_crowpanel_7.menu.PartitionScheme.minimal.build.partitions=minimal
elecrow_crowpanel_7.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
elecrow_crowpanel_7.menu.PartitionScheme.no_ota.build.partitions=no_ota
elecrow_crowpanel_7.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
elecrow_crowpanel_7.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
elecrow_crowpanel_7.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
elecrow_crowpanel_7.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
elecrow_crowpanel_7.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
elecrow_crowpanel_7.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
elecrow_crowpanel_7.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
elecrow_crowpanel_7.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
elecrow_crowpanel_7.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
elecrow_crowpanel_7.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
elecrow_crowpanel_7.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
elecrow_crowpanel_7.menu.PartitionScheme.huge_app.build.partitions=huge_app
elecrow_crowpanel_7.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
elecrow_crowpanel_7.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
elecrow_crowpanel_7.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
elecrow_crowpanel_7.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

elecrow_crowpanel_7.menu.CPUFreq.240=240MHz (WiFi/BT)
elecrow_crowpanel_7.menu.CPUFreq.240.build.f_cpu=240000000L
elecrow_crowpanel_7.menu.CPUFreq.160=160MHz (WiFi/BT)
elecrow_crowpanel_7.menu.CPUFreq.160.build.f_cpu=160000000L
elecrow_crowpanel_7.menu.CPUFreq.80=80MHz (WiFi/BT)
elecrow_crowpanel_7.menu.CPUFreq.80.build.f_cpu=80000000L
elecrow_crowpanel_7.menu.CPUFreq.40=40MHz (40MHz XTAL)
elecrow_crowpanel_7.menu.CPUFreq.40.build.f_cpu=40000000L
elecrow_crowpanel_7.menu.CPUFreq.26=26MHz (26MHz XTAL)
elecrow_crowpanel_7.menu.CPUFreq.26.build.f_cpu=26000000L
elecrow_crowpanel_7.menu.CPUFreq.20=20MHz (40MHz XTAL)
elecrow_crowpanel_7.menu.CPUFreq.20.build.f_cpu=20000000L
elecrow_crowpanel_7.menu.CPUFreq.13=13MHz (26MHz XTAL)
elecrow_crowpanel_7.menu.CPUFreq.13.build.f_cpu=13000000L
elecrow_crowpanel_7.menu.CPUFreq.10=10MHz (40MHz XTAL)
elecrow_crowpanel_7.menu.CPUFreq.10.build.f_cpu=10000000L

elecrow_crowpanel_7.menu.FlashMode.qio=QIO
elecrow_crowpanel_7.menu.FlashMode.qio.build.flash_mode=dio
elecrow_crowpanel_7.menu.FlashMode.qio.build.boot=qio
elecrow_crowpanel_7.menu.FlashMode.dio=DIO
elecrow_crowpanel_7.menu.FlashMode.dio.build.flash_mode=dio
elecrow_crowpanel_7.menu.FlashMode.dio.build.boot=dio

elecrow_crowpanel_7.menu.FlashFreq.80=80MHz
elecrow_crowpanel_7.menu.FlashFreq.80.build.flash_freq=80m
elecrow_crowpanel_7.menu.FlashFreq.40=40MHz
elecrow_crowpanel_7.menu.FlashFreq.40.build.flash_freq=40m

elecrow_crowpanel_7.menu.FlashSize.4MB=4MB (32Mb)
elecrow_crowpanel_7.menu.FlashSize.4MB.build.flash_size=4MB

elecrow_crowpanel_7.menu.UploadSpeed.921600=921600
elecrow_crowpanel_7.menu.UploadSpeed.921600.upload.speed=921600
elecrow_crowpanel_7.menu.UploadSpeed.115200=115200
elecrow_crowpanel_7.menu.UploadSpeed.115200.upload.speed=115200
elecrow_crowpanel_7.menu.UploadSpeed.256000.windows=256000
elecrow_crowpanel_7.menu.UploadSpeed.256000.upload.speed=256000
elecrow_crowpanel_7.menu.UploadSpeed.230400.windows.upload.speed=256000
elecrow_crowpanel_7.menu.UploadSpeed.230400=230400
elecrow_crowpanel_7.menu.UploadSpeed.230400.upload.speed=230400
elecrow_crowpanel_7.menu.UploadSpeed.460800.linux=460800
elecrow_crowpanel_7.menu.UploadSpeed.460800.macosx=460800
elecrow_crowpanel_7.menu.UploadSpeed.460800.upload.speed=460800
elecrow_crowpanel_7.menu.UploadSpeed.512000.windows=512000
elecrow_crowpanel_7.menu.UploadSpeed.512000.upload.speed=512000

