espressif/arduino-esp32/boards.txt
elecrow_crowpanel_7.menu.DebugLevel.none=None
elecrow_crowpanel_7.menu.DebugLevel.none.build.code_debug=0
elecrow_crowpanel_7.menu.DebugLevel.error=Error
elecrow_crowpanel_7.menu.DebugLevel.error.build.code_debug=1
elecrow_crowpanel_7.menu.DebugLevel.warn=Warn
elecrow_crowpanel_7.menu.DebugLevel.warn.build.code_debug=2
elecrow_crowpanel_7.menu.DebugLevel.info=Info
elecrow_crowpanel_7.menu.DebugLevel.info.build.code_debug=3
elecrow_crowpanel_7.menu.DebugLevel.debug=Debug
elecrow_crowpanel_7.menu.DebugLevel.debug.build.code_debug=4
elecrow_crowpanel_7.menu.DebugLevel.verbose=Verbose
elecrow_crowpanel_7.menu.DebugLevel.verbose.build.code_debug=5

elecrow_crowpanel_7.menu.EraseFlash.none=Disabled
elecrow_crowpanel_7.menu.EraseFlash.none.upload.erase_cmd=
elecrow_crowpanel_7.menu.EraseFlash.all=Enabled
elecrow_crowpanel_7.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

circuitart_zero_s3.name=CircuitART Zero S3
circuitart_zero_s3.vid.0=0x303a
circuitart_zero_s3.pid.0=0x80DB

circuitart_zero_s3.bootloader.tool=esptool_py
circuitart_zero_s3.bootloader.tool.default=esptool_py

circuitart_zero_s3.upload.tool=esptool_py
circuitart_zero_s3.upload.tool.default=esptool_py
circuitart_zero_s3.upload.tool.network=esp_ota

circuitart_zero_s3.upload.maximum_size=1310720
circuitart_zero_s3.upload.maximum_data_size=327680
circuitart_zero_s3.upload.flags=
circuitart_zero_s3.upload.extra_flags=
circuitart_zero_s3.upload.use_1200bps_touch=false
circuitart_zero_s3.upload.wait_for_upload_port=false

circuitart_zero_s3.serial.disableDTR=false
circuitart_zero_s3.serial.disableRTS=false

circuitart_zero_s3.build.tarch=xtensa
circuitart_zero_s3.build.bootloader_addr=0x0
circuitart_zero_s3.build.target=esp32s3
circuitart_zero_s3.build.mcu=esp32s3
circuitart_zero_s3.build.core=esp32
circuitart_zero_s3.build.variant=circuitart_zero_s3
circuitart_zero_s3.build.board=CIRCUITART_ZERO_S3

circuitart_zero_s3.build.usb_mode=1
circuitart_zero_s3.build.cdc_on_boot=0
circuitart_zero_s3.build.msc_on_boot=0
circuitart_zero_s3.build.dfu_on_boot=0
circuitart_zero_s3.build.f_cpu=240000000L
circuitart_zero_s3.build.flash_size=16MB
circuitart_zero_s3.build.flash_freq=80m
circuitart_zero_s3.build.flash_mode=dio
circuitart_zero_s3.build.boot=qio
circuitart_zero_s3.build.partitions=default
circuitart_zero_s3.build.defines=
circuitart_zero_s3.build.loop_core=
circuitart_zero_s3.build.event_core=
circuitart_zero_s3.build.flash_type=qio
circuitart_zero_s3.build.psram_type=qspi
circuitart_zero_s3.build.memory_type=qio_qspi

circuitart_zero_s3.menu.LoopCore.1=Core 1
circuitart_zero_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
circuitart_zero_s3.menu.LoopCore.0=Core 0
circuitart_zero_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

circuitart_zero_s3.menu.EventsCore.1=Core 1
circuitart_zero_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
circuitart_zero_s3.menu.EventsCore.0=Core 0
circuitart_zero_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

circuitart_zero_s3.menu.USBMode.default=USB-OTG (TinyUSB)
circuitart_zero_s3.menu.USBMode.default.build.usb_mode=0
circuitart_zero_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
circuitart_zero_s3.menu.USBMode.hwcdc.build.usb_mode=1

circuitart_zero_s3.menu.CDCOnBoot.cdc=Enabled
circuitart_zero_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
circuitart_zero_s3.menu.CDCOnBoot.default=Disabled
circuitart_zero_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

circuitart_zero_s3.menu.MSCOnBoot.default=Disabled
circuitart_zero_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
circuitart_zero_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
circuitart_zero_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

circuitart_zero_s3.menu.DFUOnBoot.default=Disabled
circuitart_zero_s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
circuitart_zero_s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
circuitart_zero_s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

circuitart_zero_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
circuitart_zero_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
circuitart_zero_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
circuitart_zero_s3.menu.UploadMode.default=UART0 / Hardware CDC
circuitart_zero_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
circuitart_zero_s3.menu.UploadMode.default.upload.wait_for_upload_port=false

circuitart_zero_s3.menu.PSRAM.enabled=Enabled
circuitart_zero_s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
circuitart_zero_s3.menu.PSRAM.disabled=Disabled
circuitart_zero_s3.menu.PSRAM.disabled.build.defines=

circuitart_zero_s3.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
circuitart_zero_s3.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
circuitart_zero_s3.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
circuitart_zero_s3.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/12MB FFAT)
circuitart_zero_s3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
circuitart_zero_s3.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
circuitart_zero_s3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
circuitart_zero_s3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
circuitart_zero_s3.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/6.93MB SPIFFS)
circuitart_zero_s3.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
circuitart_zero_s3.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592
circuitart_zero_s3.menu.PartitionScheme.app3M_fat9M_16MB=FFAT (3MB APP/9MB FATFS)
circuitart_zero_s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
circuitart_zero_s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
circuitart_zero_s3.menu.PartitionScheme.fatflash=Large FFAT (2MB APP/12.5MB FATFS)
circuitart_zero_s3.menu.PartitionScheme.fatflash.build.partitions=ffat
circuitart_zero_s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

circuitart_zero_s3.menu.CPUFreq.240=240MHz (WiFi)
circuitart_zero_s3.menu.CPUFreq.240.build.f_cpu=240000000L
circuitart_zero_s3.menu.CPUFreq.160=160MHz (WiFi)
circuitart_zero_s3.menu.CPUFreq.160.build.f_cpu=160000000L
circuitart_zero_s3.menu.CPUFreq.80=80MHz (WiFi)
circuitart_zero_s3.menu.CPUFreq.80.build.f_cpu=80000000L
circuitart_zero_s3.menu.CPUFreq.40=40MHz
circuitart_zero_s3.menu.CPUFreq.40.build.f_cpu=40000000L
circuitart_zero_s3.menu.CPUFreq.20=20MHz
circuitart_zero_s3.menu.CPUFreq.20.build.f_cpu=20000000L
circuitart_zero_s3.menu.CPUFreq.10=10MHz
circuitart_zero_s3.menu.CPUFreq.10.build.f_cpu=10000000L

circuitart_zero_s3.menu.FlashMode.qio=QIO
circuitart_zero_s3.menu.FlashMode.qio.build.flash_mode=dio
circuitart_zero_s3.menu.FlashMode.qio.build.boot=qio
circuitart_zero_s3.menu.FlashMode.dio=DIO
circuitart_zero_s3.menu.FlashMode.dio.build.flash_mode=dio
circuitart_zero_s3.menu.FlashMode.dio.build.boot=dio

