espressif/arduino-esp32/boards.txt
alfredo-nou3.menu.UploadSpeed.921600=921600
alfredo-nou3.menu.UploadSpeed.921600.upload.speed=921600
alfredo-nou3.menu.UploadSpeed.512000.windows=512000
alfredo-nou3.menu.UploadSpeed.512000.upload.speed=512000
alfredo-nou3.menu.UploadSpeed.460800.linux=460800
alfredo-nou3.menu.UploadSpeed.460800.macosx=460800
alfredo-nou3.menu.UploadSpeed.460800.upload.speed=460800
alfredo-nou3.menu.UploadSpeed.256000.windows=256000
alfredo-nou3.menu.UploadSpeed.256000.upload.speed=256000
alfredo-nou3.menu.UploadSpeed.230400.windows.upload.speed=256000
alfredo-nou3.menu.UploadSpeed.230400=230400
alfredo-nou3.menu.UploadSpeed.230400.upload.speed=230400
alfredo-nou3.menu.UploadSpeed.115200=115200
alfredo-nou3.menu.UploadSpeed.115200.upload.speed=115200

alfredo-nou3.menu.DebugLevel.none=None
alfredo-nou3.menu.DebugLevel.none.build.code_debug=0
alfredo-nou3.menu.DebugLevel.error=Error
alfredo-nou3.menu.DebugLevel.error.build.code_debug=1
alfredo-nou3.menu.DebugLevel.warn=Warn
alfredo-nou3.menu.DebugLevel.warn.build.code_debug=2
alfredo-nou3.menu.DebugLevel.info=Info
alfredo-nou3.menu.DebugLevel.info.build.code_debug=3
alfredo-nou3.menu.DebugLevel.debug=Debug
alfredo-nou3.menu.DebugLevel.debug.build.code_debug=4
alfredo-nou3.menu.DebugLevel.verbose=Verbose
alfredo-nou3.menu.DebugLevel.verbose.build.code_debug=5

alfredo-nou3.menu.EraseFlash.none=Disabled
alfredo-nou3.menu.EraseFlash.none.upload.erase_cmd=
alfredo-nou3.menu.EraseFlash.all=Enabled
alfredo-nou3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
codecell.name=CodeCell C3

codecell.bootloader.tool=esptool_py
codecell.bootloader.tool.default=esptool_py

codecell.upload.tool=esptool_py
codecell.upload.tool.default=esptool_py
codecell.upload.tool.network=esp_ota

codecell.upload.maximum_size=1310720
codecell.upload.maximum_data_size=327680
codecell.upload.flags=
codecell.upload.extra_flags=
codecell.upload.use_1200bps_touch=false
codecell.upload.wait_for_upload_port=false

codecell.serial.disableDTR=false
codecell.serial.disableRTS=false

codecell.build.tarch=riscv32
codecell.build.target=esp
codecell.build.mcu=esp32c3
codecell.build.core=esp32
codecell.build.variant=codecell
codecell.build.board=CODECELLC3
codecell.build.bootloader_addr=0x0

codecell.build.cdc_on_boot=1
codecell.build.f_cpu=160000000L
codecell.build.flash_size=4MB
codecell.build.flash_freq=80m
codecell.build.flash_mode=qio
codecell.build.boot=qio
codecell.build.partitions=default
codecell.build.defines=


codecell.menu.JTAGAdapter.default=Disabled
codecell.menu.JTAGAdapter.default.build.copy_jtag_files=0
codecell.menu.JTAGAdapter.builtin=Integrated USB JTAG
codecell.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
codecell.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
codecell.menu.JTAGAdapter.external=FTDI Adapter
codecell.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
codecell.menu.JTAGAdapter.external.build.copy_jtag_files=1
codecell.menu.JTAGAdapter.bridge=ESP USB Bridge
codecell.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
codecell.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

codecell.menu.CDCOnBoot.default=Enabled
codecell.menu.CDCOnBoot.default.build.cdc_on_boot=0
codecell.menu.CDCOnBoot.cdc=Enabled
codecell.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

codecell.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
codecell.menu.PartitionScheme.default.build.partitions=default
codecell.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
codecell.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
codecell.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
codecell.menu.PartitionScheme.minimal.build.partitions=minimal
codecell.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
codecell.menu.PartitionScheme.no_fs.build.partitions=no_fs
codecell.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
codecell.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
codecell.menu.PartitionScheme.no_ota.build.partitions=no_ota
codecell.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
codecell.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
codecell.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
codecell.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
codecell.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
codecell.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
codecell.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
codecell.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
codecell.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
codecell.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
codecell.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
codecell.menu.PartitionScheme.huge_app.build.partitions=huge_app
codecell.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
codecell.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
codecell.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
codecell.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
codecell.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
codecell.menu.PartitionScheme.fatflash.build.partitions=ffat
codecell.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
codecell.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
codecell.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
codecell.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
codecell.menu.PartitionScheme.rainmaker=RainMaker 4MB
codecell.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
codecell.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
codecell.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
codecell.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
codecell.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
codecell.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
codecell.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
codecell.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
codecell.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
codecell.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
codecell.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
codecell.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
codecell.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
codecell.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
codecell.menu.PartitionScheme.custom=Custom
codecell.menu.PartitionScheme.custom.build.partitions=
codecell.menu.PartitionScheme.custom.upload.maximum_size=16777216

