espressif/arduino-esp32/boards.txt
jczn_2432s028r.menu.EraseFlash.none=Disabled
jczn_2432s028r.menu.EraseFlash.none.upload.erase_cmd=
jczn_2432s028r.menu.EraseFlash.all=Enabled
jczn_2432s028r.menu.EraseFlash.all.upload.erase_cmd=-e

jczn_2432s028r.menu.ZigbeeMode.default=Disabled
jczn_2432s028r.menu.ZigbeeMode.default.build.zigbee_mode=
jczn_2432s028r.menu.ZigbeeMode.default.build.zigbee_libs=
jczn_2432s028r.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
jczn_2432s028r.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
jczn_2432s028r.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

waveshare_esp32_s3_touch_amoled_241.name=Waveshare ESP32-S3-Touch-AMOLED-2.41
waveshare_esp32_s3_touch_amoled_241.vid.0=0x303a
waveshare_esp32_s3_touch_amoled_241.pid.0=0x8242
waveshare_esp32_s3_touch_amoled_241.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_amoled_241.upload_port.0.pid=0x8242

waveshare_esp32_s3_touch_amoled_241.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_amoled_241.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_amoled_241.upload.tool=esptool_py
waveshare_esp32_s3_touch_amoled_241.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_amoled_241.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_amoled_241.upload.maximum_size=1310720

waveshare_esp32_s3_touch_amoled_241.upload.maximum_data_size=327680
waveshare_esp32_s3_touch_amoled_241.upload.flags=
waveshare_esp32_s3_touch_amoled_241.upload.extra_flags=
waveshare_esp32_s3_touch_amoled_241.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_241.upload.wait_for_upload_port=false

waveshare_esp32_s3_touch_amoled_241.serial.disableDTR=false
waveshare_esp32_s3_touch_amoled_241.serial.disableRTS=false

waveshare_esp32_s3_touch_amoled_241.build.tarch=xtensa
waveshare_esp32_s3_touch_amoled_241.build.bootloader_addr=0x0
waveshare_esp32_s3_touch_amoled_241.build.target=esp32s3
waveshare_esp32_s3_touch_amoled_241.build.mcu=esp32s3
waveshare_esp32_s3_touch_amoled_241.build.core=esp32
waveshare_esp32_s3_touch_amoled_241.build.variant=waveshare_esp32_s3_touch_amoled_241
waveshare_esp32_s3_touch_amoled_241.build.board=WAVESHARE_ESP32_S3_TOUCH_AMOLED_241

waveshare_esp32_s3_touch_amoled_241.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_241.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_241.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_241.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_241.build.f_cpu=240000000L
waveshare_esp32_s3_touch_amoled_241.build.flash_size=16MB

waveshare_esp32_s3_touch_amoled_241.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_241.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_241.build.boot=qio
waveshare_esp32_s3_touch_amoled_241.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_241.build.partitions=default
waveshare_esp32_s3_touch_amoled_241.build.defines=
waveshare_esp32_s3_touch_amoled_241.build.loop_core=
waveshare_esp32_s3_touch_amoled_241.build.event_core=
waveshare_esp32_s3_touch_amoled_241.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_241.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_touch_amoled_241.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_touch_amoled_241.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_touch_amoled_241.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_241.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_touch_amoled_241.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_touch_amoled_241.menu.PSRAM.enabled.build.psram_type=opi

waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_touch_amoled_241.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_touch_amoled_241.menu.LoopCore.1=Core 1
waveshare_esp32_s3_touch_amoled_241.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_241.menu.LoopCore.0=Core 0
waveshare_esp32_s3_touch_amoled_241.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_touch_amoled_241.menu.EventsCore.1=Core 1
waveshare_esp32_s3_touch_amoled_241.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_241.menu.EventsCore.0=Core 0
waveshare_esp32_s3_touch_amoled_241.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

waveshare_esp32_s3_touch_amoled_241.menu.USBMode.hwcdc=Hardware CDC and JTAG
waveshare_esp32_s3_touch_amoled_241.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_241.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_touch_amoled_241.menu.USBMode.default.build.usb_mode=0

waveshare_esp32_s3_touch_amoled_241.menu.CDCOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_241.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_241.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_touch_amoled_241.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_s3_touch_amoled_241.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_241.menu.MSCOnBoot.default.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_241.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_amoled_241.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_touch_amoled_241.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_241.menu.DFUOnBoot.default.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_241.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_amoled_241.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

waveshare_esp32_s3_touch_amoled_241.menu.UploadMode.default=UART0 / Hardware CDC
waveshare_esp32_s3_touch_amoled_241.menu.UploadMode.default.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_241.menu.UploadMode.default.upload.wait_for_upload_port=false
waveshare_esp32_s3_touch_amoled_241.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
waveshare_esp32_s3_touch_amoled_241.menu.UploadMode.cdc.upload.use_1200bps_touch=true
waveshare_esp32_s3_touch_amoled_241.menu.UploadMode.cdc.upload.wait_for_upload_port=true

