espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.default.build.partitions=default
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)

waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.no_ota.build.partitions=no_ota
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.huge_app.build.partitions=huge_app
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.rainmaker=RainMaker 4MB
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.fatflash.build.partitions=ffat
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.otanofs=OTA no FS (2MB APP with OTA)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.otanofs.build.custom_partitions=partitions_otanofs_4MB
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.otanofs.upload.maximum_size=2031616
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.all_app=Max APP (4MB APP no OTA)
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.all_app.build.custom_partitions=partitions_all_app_4MB
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.all_app.upload.maximum_size=4128768

waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.custom=Custom
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.custom.build.partitions=
waveshare_esp32_s3_touch_amoled_241.menu.PartitionScheme.custom.upload.maximum_size=16777216

waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.240=240MHz (WiFi)
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.40=40MHz
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.20=20MHz
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.10=10MHz
waveshare_esp32_s3_touch_amoled_241.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_touch_amoled_241.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_amoled_241.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_amoled_241.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_amoled_241.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_amoled_241.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_amoled_241.menu.EraseFlash.all.upload.erase_cmd=-e

