espressif/arduino-esp32/boards.txt
##############################################################

waveshare_esp32_s3_touch_lcd_5.name=Waveshare ESP32-S3-Touch-LCD-5
waveshare_esp32_s3_touch_lcd_5.vid.0=0x303a
waveshare_esp32_s3_touch_lcd_5.pid.0=0x8237
waveshare_esp32_s3_touch_lcd_5.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_lcd_5.upload_port.0.pid=0x8237

waveshare_esp32_s3_touch_lcd_5.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_lcd_5.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_lcd_5.upload.tool=esptool_py
waveshare_esp32_s3_touch_lcd_5.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_lcd_5.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_lcd_5.upload.maximum_size=1310720

waveshare_esp32_s3_touch_lcd_5.upload.maximum_data_size=327680
waveshare_esp32_s3_touch_lcd_5.upload.flags=
waveshare_esp32_s3_touch_lcd_5.upload.extra_flags=
waveshare_esp32_s3_touch_lcd_5.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_lcd_5.upload.wait_for_upload_port=false

waveshare_esp32_s3_touch_lcd_5.serial.disableDTR=false
waveshare_esp32_s3_touch_lcd_5.serial.disableRTS=false

waveshare_esp32_s3_touch_lcd_5.build.tarch=xtensa
waveshare_esp32_s3_touch_lcd_5.build.bootloader_addr=0x0
waveshare_esp32_s3_touch_lcd_5.build.target=esp32s3
waveshare_esp32_s3_touch_lcd_5.build.mcu=esp32s3
waveshare_esp32_s3_touch_lcd_5.build.core=esp32
waveshare_esp32_s3_touch_lcd_5.build.variant=waveshare_esp32_s3_touch_lcd_5
waveshare_esp32_s3_touch_lcd_5.build.board=WAVESHARE_ESP32_S3_TOUCH_LCD_5

waveshare_esp32_s3_touch_lcd_5.build.usb_mode=1
waveshare_esp32_s3_touch_lcd_5.build.cdc_on_boot=0
waveshare_esp32_s3_touch_lcd_5.build.msc_on_boot=0
waveshare_esp32_s3_touch_lcd_5.build.dfu_on_boot=0
waveshare_esp32_s3_touch_lcd_5.build.f_cpu=240000000L
waveshare_esp32_s3_touch_lcd_5.build.flash_size=16MB
waveshare_esp32_s3_touch_lcd_5.build.flash_freq=80m
waveshare_esp32_s3_touch_lcd_5.build.flash_mode=dio
waveshare_esp32_s3_touch_lcd_5.build.boot=qio
waveshare_esp32_s3_touch_lcd_5.build.boot_freq=80m
waveshare_esp32_s3_touch_lcd_5.build.partitions=default
waveshare_esp32_s3_touch_lcd_5.build.defines=
waveshare_esp32_s3_touch_lcd_5.build.loop_core=
waveshare_esp32_s3_touch_lcd_5.build.event_core=
waveshare_esp32_s3_touch_lcd_5.build.psram_type=qspi
waveshare_esp32_s3_touch_lcd_5.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_touch_lcd_5.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_touch_lcd_5.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_touch_lcd_5.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_touch_lcd_5.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_touch_lcd_5.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_touch_lcd_5.menu.PSRAM.enabled.build.psram_type=opi

waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_touch_lcd_5.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_touch_lcd_5.menu.LoopCore.1=Core 1
waveshare_esp32_s3_touch_lcd_5.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_touch_lcd_5.menu.LoopCore.0=Core 0
waveshare_esp32_s3_touch_lcd_5.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_touch_lcd_5.menu.EventsCore.1=Core 1
waveshare_esp32_s3_touch_lcd_5.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_touch_lcd_5.menu.EventsCore.0=Core 0
waveshare_esp32_s3_touch_lcd_5.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

waveshare_esp32_s3_touch_lcd_5.menu.USBMode.hwcdc=Hardware CDC and JTAG
waveshare_esp32_s3_touch_lcd_5.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_touch_lcd_5.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_touch_lcd_5.menu.USBMode.default.build.usb_mode=0

waveshare_esp32_s3_touch_lcd_5.menu.CDCOnBoot.default=Disabled
waveshare_esp32_s3_touch_lcd_5.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_touch_lcd_5.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_touch_lcd_5.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_s3_touch_lcd_5.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_touch_lcd_5.menu.MSCOnBoot.default.build.msc_on_boot=0
waveshare_esp32_s3_touch_lcd_5.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_lcd_5.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_touch_lcd_5.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_touch_lcd_5.menu.DFUOnBoot.default.build.dfu_on_boot=0
waveshare_esp32_s3_touch_lcd_5.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_lcd_5.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

waveshare_esp32_s3_touch_lcd_5.menu.UploadMode.default=UART0 / Hardware CDC
waveshare_esp32_s3_touch_lcd_5.menu.UploadMode.default.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_lcd_5.menu.UploadMode.default.upload.wait_for_upload_port=false
waveshare_esp32_s3_touch_lcd_5.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
waveshare_esp32_s3_touch_lcd_5.menu.UploadMode.cdc.upload.use_1200bps_touch=true
waveshare_esp32_s3_touch_lcd_5.menu.UploadMode.cdc.upload.wait_for_upload_port=true

waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.default.build.partitions=default
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.no_ota.build.partitions=no_ota
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.huge_app.build.partitions=huge_app
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.rainmaker=RainMaker 4MB
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.fatflash.build.partitions=ffat
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
waveshare_esp32_s3_touch_lcd_5.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

