espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.240=240MHz (WiFi)
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.40=40MHz
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.20=20MHz
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.10=10MHz
waveshare_esp32_s3_touch_lcd_4.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_touch_lcd_4.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_lcd_4.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_lcd_4.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_lcd_4.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_lcd_4.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_lcd_4.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

waveshare_esp32_s3_touch_lcd_185.name=Waveshare ESP32-S3-Touch-LCD-1.85
waveshare_esp32_s3_touch_lcd_185.vid.0=0x303a
waveshare_esp32_s3_touch_lcd_185.pid.0=0x8290
waveshare_esp32_s3_touch_lcd_185.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_lcd_185.upload_port.0.pid=0x8290

waveshare_esp32_s3_touch_lcd_185.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_lcd_185.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_lcd_185.upload.tool=esptool_py
waveshare_esp32_s3_touch_lcd_185.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_lcd_185.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_lcd_185.upload.maximum_size=1310720
waveshare_esp32_s3_touch_lcd_185.upload.maximum_data_size=327680
waveshare_esp32_s3_touch_lcd_185.upload.flags=
waveshare_esp32_s3_touch_lcd_185.upload.extra_flags=
waveshare_esp32_s3_touch_lcd_185.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_lcd_185.upload.wait_for_upload_port=false

waveshare_esp32_s3_touch_lcd_185.serial.disableDTR=false
waveshare_esp32_s3_touch_lcd_185.serial.disableRTS=false

waveshare_esp32_s3_touch_lcd_185.build.tarch=xtensa
waveshare_esp32_s3_touch_lcd_185.build.bootloader_addr=0x0
waveshare_esp32_s3_touch_lcd_185.build.target=esp32s3
waveshare_esp32_s3_touch_lcd_185.build.mcu=esp32s3
waveshare_esp32_s3_touch_lcd_185.build.core=esp32
waveshare_esp32_s3_touch_lcd_185.build.variant=waveshare_esp32_s3_touch_lcd_185
waveshare_esp32_s3_touch_lcd_185.build.board=WAVESHARE_ESP32_S3_TOUCH_LCD_185

waveshare_esp32_s3_touch_lcd_185.build.usb_mode=1
waveshare_esp32_s3_touch_lcd_185.build.cdc_on_boot=0
waveshare_esp32_s3_touch_lcd_185.build.msc_on_boot=0
waveshare_esp32_s3_touch_lcd_185.build.dfu_on_boot=0
waveshare_esp32_s3_touch_lcd_185.build.f_cpu=240000000L
waveshare_esp32_s3_touch_lcd_185.build.flash_size=16MB
waveshare_esp32_s3_touch_lcd_185.build.flash_freq=120m
waveshare_esp32_s3_touch_lcd_185.build.flash_mode=qio
waveshare_esp32_s3_touch_lcd_185.build.boot=qio
waveshare_esp32_s3_touch_lcd_185.build.boot_freq=80m
waveshare_esp32_s3_touch_lcd_185.build.partitions=default
waveshare_esp32_s3_touch_lcd_185.build.defines=
waveshare_esp32_s3_touch_lcd_185.build.loop_core=
waveshare_esp32_s3_touch_lcd_185.build.event_core=
waveshare_esp32_s3_touch_lcd_185.build.psram_type=opi
waveshare_esp32_s3_touch_lcd_185.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.default=Disabled
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.default.build.copy_jtag_files=0
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.builtin=Integrated USB JTAG
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.external=FTDI Adapter
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.external.build.copy_jtag_files=1
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.bridge=ESP USB Bridge
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
waveshare_esp32_s3_touch_lcd_185.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

waveshare_esp32_s3_touch_lcd_185.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_touch_lcd_185.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_touch_lcd_185.menu.PSRAM.enabled.build.psram_type=opi
waveshare_esp32_s3_touch_lcd_185.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_touch_lcd_185.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_touch_lcd_185.menu.PSRAM.disabled.build.psram_type=qspi

waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio120.build.flash_freq=80m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.dio=DIO 80MHz
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.dio.build.flash_mode=dio
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.dio.build.boot=dio
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.dio.build.boot_freq=80m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.dio.build.flash_freq=80m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.opi=OPI 80MHz
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.opi.build.flash_mode=dout
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.opi.build.boot=opi
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.opi.build.boot_freq=80m
waveshare_esp32_s3_touch_lcd_185.menu.FlashMode.opi.build.flash_freq=80m

waveshare_esp32_s3_touch_lcd_185.menu.LoopCore.1=Core 1
waveshare_esp32_s3_touch_lcd_185.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_touch_lcd_185.menu.LoopCore.0=Core 0
waveshare_esp32_s3_touch_lcd_185.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_touch_lcd_185.menu.EventsCore.0=Core 0
waveshare_esp32_s3_touch_lcd_185.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0
waveshare_esp32_s3_touch_lcd_185.menu.EventsCore.1=Core 1
waveshare_esp32_s3_touch_lcd_185.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1

waveshare_esp32_s3_touch_lcd_185.menu.USBMode.hwcdc=Hardware CDC and JTAG
waveshare_esp32_s3_touch_lcd_185.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_touch_lcd_185.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_touch_lcd_185.menu.USBMode.default.build.usb_mode=0

waveshare_esp32_s3_touch_lcd_185.menu.CDCOnBoot.default=Disabled
waveshare_esp32_s3_touch_lcd_185.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_touch_lcd_185.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_touch_lcd_185.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

