espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_lcd_185.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_lcd_185.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_lcd_185.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_lcd_185.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_lcd_185.menu.EraseFlash.all.upload.erase_cmd=-e

waveshare_esp32_s3_touch_lcd_185.menu.ZigbeeMode.default=Disabled
waveshare_esp32_s3_touch_lcd_185.menu.ZigbeeMode.default.build.zigbee_mode=
waveshare_esp32_s3_touch_lcd_185.menu.ZigbeeMode.default.build.zigbee_libs=
waveshare_esp32_s3_touch_lcd_185.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
waveshare_esp32_s3_touch_lcd_185.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
waveshare_esp32_s3_touch_lcd_185.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

cezerio_dev_esp32c6.name=cezerio dev ESP32C6

cezerio_dev_esp32c6.bootloader.tool=esptool_py
cezerio_dev_esp32c6.bootloader.tool.default=esptool_py

cezerio_dev_esp32c6.upload.tool=esptool_py
cezerio_dev_esp32c6.upload.tool.default=esptool_py
cezerio_dev_esp32c6.upload.tool.network=esp_ota

cezerio_dev_esp32c6.upload.maximum_size=1310720
cezerio_dev_esp32c6.upload.maximum_data_size=327680
cezerio_dev_esp32c6.upload.flags=
cezerio_dev_esp32c6.upload.extra_flags=
cezerio_dev_esp32c6.upload.use_1200bps_touch=false
cezerio_dev_esp32c6.upload.wait_for_upload_port=false

cezerio_dev_esp32c6.serial.disableDTR=false
cezerio_dev_esp32c6.serial.disableRTS=false

cezerio_dev_esp32c6.build.tarch=riscv32
cezerio_dev_esp32c6.build.target=esp
cezerio_dev_esp32c6.build.mcu=esp32c6
cezerio_dev_esp32c6.build.core=esp32
cezerio_dev_esp32c6.build.variant=cezerio_dev_esp32c6
cezerio_dev_esp32c6.build.board=CEZERIO_DEV_ESP32C6
cezerio_dev_esp32c6.build.bootloader_addr=0x0

cezerio_dev_esp32c6.build.cdc_on_boot=0
cezerio_dev_esp32c6.build.f_cpu=160000000L
cezerio_dev_esp32c6.build.flash_size=4MB
cezerio_dev_esp32c6.build.flash_freq=80m
cezerio_dev_esp32c6.build.flash_mode=qio
cezerio_dev_esp32c6.build.boot=qio
cezerio_dev_esp32c6.build.partitions=default
cezerio_dev_esp32c6.build.defines=

## IDE 2.0 Seems to not update the value
cezerio_dev_esp32c6.menu.JTAGAdapter.default=Disabled
cezerio_dev_esp32c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
cezerio_dev_esp32c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
cezerio_dev_esp32c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
cezerio_dev_esp32c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
cezerio_dev_esp32c6.menu.JTAGAdapter.external=FTDI Adapter
cezerio_dev_esp32c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
cezerio_dev_esp32c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
cezerio_dev_esp32c6.menu.JTAGAdapter.bridge=ESP USB Bridge
cezerio_dev_esp32c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
cezerio_dev_esp32c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

cezerio_dev_esp32c6.menu.CDCOnBoot.default=Enabled
cezerio_dev_esp32c6.menu.CDCOnBoot.default.build.cdc_on_boot=1
cezerio_dev_esp32c6.menu.CDCOnBoot.cdc=Disabled
cezerio_dev_esp32c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

cezerio_dev_esp32c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
cezerio_dev_esp32c6.menu.PartitionScheme.default.build.partitions=default
cezerio_dev_esp32c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
cezerio_dev_esp32c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
cezerio_dev_esp32c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
cezerio_dev_esp32c6.menu.PartitionScheme.minimal.build.partitions=minimal
cezerio_dev_esp32c6.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
cezerio_dev_esp32c6.menu.PartitionScheme.no_fs.build.partitions=no_fs
cezerio_dev_esp32c6.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
cezerio_dev_esp32c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
cezerio_dev_esp32c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
cezerio_dev_esp32c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
cezerio_dev_esp32c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
cezerio_dev_esp32c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
cezerio_dev_esp32c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
cezerio_dev_esp32c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
cezerio_dev_esp32c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
cezerio_dev_esp32c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
cezerio_dev_esp32c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
cezerio_dev_esp32c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
cezerio_dev_esp32c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
cezerio_dev_esp32c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
cezerio_dev_esp32c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
cezerio_dev_esp32c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
cezerio_dev_esp32c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
cezerio_dev_esp32c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
cezerio_dev_esp32c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
cezerio_dev_esp32c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
cezerio_dev_esp32c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
cezerio_dev_esp32c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
cezerio_dev_esp32c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
cezerio_dev_esp32c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
cezerio_dev_esp32c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
cezerio_dev_esp32c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
cezerio_dev_esp32c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
cezerio_dev_esp32c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
cezerio_dev_esp32c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
cezerio_dev_esp32c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
cezerio_dev_esp32c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
cezerio_dev_esp32c6.menu.PartitionScheme.custom=Custom
cezerio_dev_esp32c6.menu.PartitionScheme.custom.build.partitions=
cezerio_dev_esp32c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

cezerio_dev_esp32c6.menu.CPUFreq.160=160MHz (WiFi)
cezerio_dev_esp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
cezerio_dev_esp32c6.menu.CPUFreq.120=120MHz (WiFi)
cezerio_dev_esp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
cezerio_dev_esp32c6.menu.CPUFreq.80=80MHz (WiFi)
cezerio_dev_esp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
cezerio_dev_esp32c6.menu.CPUFreq.40=40MHz
cezerio_dev_esp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
cezerio_dev_esp32c6.menu.CPUFreq.20=20MHz
cezerio_dev_esp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
cezerio_dev_esp32c6.menu.CPUFreq.10=10MHz
cezerio_dev_esp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

cezerio_dev_esp32c6.menu.FlashMode.qio=QIO
cezerio_dev_esp32c6.menu.FlashMode.qio.build.flash_mode=dio
cezerio_dev_esp32c6.menu.FlashMode.qio.build.boot=qio
cezerio_dev_esp32c6.menu.FlashMode.dio=DIO
cezerio_dev_esp32c6.menu.FlashMode.dio.build.flash_mode=dio
cezerio_dev_esp32c6.menu.FlashMode.dio.build.boot=dio

cezerio_dev_esp32c6.menu.FlashFreq.80=80MHz
cezerio_dev_esp32c6.menu.FlashFreq.80.build.flash_freq=80m
cezerio_dev_esp32c6.menu.FlashFreq.40=40MHz
cezerio_dev_esp32c6.menu.FlashFreq.40.build.flash_freq=40m

cezerio_dev_esp32c6.menu.FlashSize.4M=4MB (32Mb)
cezerio_dev_esp32c6.menu.FlashSize.4M.build.flash_size=4MB

cezerio_dev_esp32c6.menu.UploadSpeed.921600=921600
cezerio_dev_esp32c6.menu.UploadSpeed.921600.upload.speed=921600
cezerio_dev_esp32c6.menu.UploadSpeed.115200=115200
cezerio_dev_esp32c6.menu.UploadSpeed.115200.upload.speed=115200
cezerio_dev_esp32c6.menu.UploadSpeed.256000.windows=256000
cezerio_dev_esp32c6.menu.UploadSpeed.256000.upload.speed=256000
cezerio_dev_esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
cezerio_dev_esp32c6.menu.UploadSpeed.230400=230400
cezerio_dev_esp32c6.menu.UploadSpeed.230400.upload.speed=230400
cezerio_dev_esp32c6.menu.UploadSpeed.460800.linux=460800
cezerio_dev_esp32c6.menu.UploadSpeed.460800.macosx=460800
cezerio_dev_esp32c6.menu.UploadSpeed.460800.upload.speed=460800
cezerio_dev_esp32c6.menu.UploadSpeed.512000.windows=512000
cezerio_dev_esp32c6.menu.UploadSpeed.512000.upload.speed=512000

