espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_lcd_146.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_touch_lcd_146.menu.MSCOnBoot.default.build.msc_on_boot=0
waveshare_esp32_s3_touch_lcd_146.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_lcd_146.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_touch_lcd_146.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_touch_lcd_146.menu.DFUOnBoot.default.build.dfu_on_boot=0
waveshare_esp32_s3_touch_lcd_146.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_lcd_146.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

waveshare_esp32_s3_touch_lcd_146.menu.UploadMode.default=UART0 / Hardware CDC
waveshare_esp32_s3_touch_lcd_146.menu.UploadMode.default.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_lcd_146.menu.UploadMode.default.upload.wait_for_upload_port=false
waveshare_esp32_s3_touch_lcd_146.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
waveshare_esp32_s3_touch_lcd_146.menu.UploadMode.cdc.upload.use_1200bps_touch=true
waveshare_esp32_s3_touch_lcd_146.menu.UploadMode.cdc.upload.wait_for_upload_port=true

waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.fatflash.build.partitions=ffat
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.default.build.partitions=default
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker=RainMaker 4MB
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.huge_app.build.partitions=huge_app
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.minimal.build.partitions=minimal
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.no_fs.build.partitions=no_fs
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.no_ota.build.partitions=no_ota
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.custom=Custom
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.custom.build.partitions=
waveshare_esp32_s3_touch_lcd_146.menu.PartitionScheme.custom.upload.maximum_size=16777216

waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.240=240MHz (WiFi)
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.40=40MHz
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.20=20MHz
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.10=10MHz
waveshare_esp32_s3_touch_lcd_146.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_touch_lcd_146.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_lcd_146.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_lcd_146.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_lcd_146.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_lcd_146.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_lcd_146.menu.EraseFlash.all.upload.erase_cmd=-e

