espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_touch_lcd_185_box.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.none=None
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.error=Error
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.info=Info
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_touch_lcd_185_box.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_touch_lcd_185_box.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_lcd_185_box.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_lcd_185_box.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_lcd_185_box.menu.EraseFlash.all.upload.erase_cmd=-e

waveshare_esp32_s3_touch_lcd_185_box.menu.ZigbeeMode.default=Disabled
waveshare_esp32_s3_touch_lcd_185_box.menu.ZigbeeMode.default.build.zigbee_mode=
waveshare_esp32_s3_touch_lcd_185_box.menu.ZigbeeMode.default.build.zigbee_libs=
waveshare_esp32_s3_touch_lcd_185_box.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
waveshare_esp32_s3_touch_lcd_185_box.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
waveshare_esp32_s3_touch_lcd_185_box.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

waveshare_esp32_s3_lcd_147.name=Waveshare ESP32-S3-LCD-1.47
waveshare_esp32_s3_lcd_147.vid.0=0x303a
waveshare_esp32_s3_lcd_147.pid.0=0x8242
waveshare_esp32_s3_lcd_147.upload_port.0.vid=0x303a
waveshare_esp32_s3_lcd_147.upload_port.0.pid=0x8242

waveshare_esp32_s3_lcd_147.bootloader.tool=esptool_py
waveshare_esp32_s3_lcd_147.bootloader.tool.default=esptool_py

waveshare_esp32_s3_lcd_147.upload.tool=esptool_py
waveshare_esp32_s3_lcd_147.upload.tool.default=esptool_py
waveshare_esp32_s3_lcd_147.upload.tool.network=esp_ota

waveshare_esp32_s3_lcd_147.upload.maximum_size=1310720
waveshare_esp32_s3_lcd_147.upload.maximum_data_size=327680
waveshare_esp32_s3_lcd_147.upload.flags=
waveshare_esp32_s3_lcd_147.upload.extra_flags=
waveshare_esp32_s3_lcd_147.upload.use_1200bps_touch=false
waveshare_esp32_s3_lcd_147.upload.wait_for_upload_port=false

waveshare_esp32_s3_lcd_147.serial.disableDTR=false
waveshare_esp32_s3_lcd_147.serial.disableRTS=false

waveshare_esp32_s3_lcd_147.build.tarch=xtensa
waveshare_esp32_s3_lcd_147.build.bootloader_addr=0x0
waveshare_esp32_s3_lcd_147.build.target=esp32s3
waveshare_esp32_s3_lcd_147.build.mcu=esp32s3
waveshare_esp32_s3_lcd_147.build.core=esp32
waveshare_esp32_s3_lcd_147.build.variant=waveshare_esp32_s3_lcd_147
waveshare_esp32_s3_lcd_147.build.board=WAVESHARE_ESP32_S3_LCD_147

waveshare_esp32_s3_lcd_147.build.usb_mode=1
waveshare_esp32_s3_lcd_147.build.cdc_on_boot=0
waveshare_esp32_s3_lcd_147.build.msc_on_boot=0
waveshare_esp32_s3_lcd_147.build.dfu_on_boot=0
waveshare_esp32_s3_lcd_147.build.f_cpu=240000000L
waveshare_esp32_s3_lcd_147.build.flash_size=16MB
waveshare_esp32_s3_lcd_147.build.flash_freq=80m
waveshare_esp32_s3_lcd_147.build.flash_mode=qio
waveshare_esp32_s3_lcd_147.build.boot=qio
waveshare_esp32_s3_lcd_147.build.boot_freq=80m
waveshare_esp32_s3_lcd_147.build.partitions=default
waveshare_esp32_s3_lcd_147.build.defines=
waveshare_esp32_s3_lcd_147.build.loop_core=
waveshare_esp32_s3_lcd_147.build.event_core=
waveshare_esp32_s3_lcd_147.build.psram_type=opi
waveshare_esp32_s3_lcd_147.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.default=Disabled
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.default.build.copy_jtag_files=0
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.builtin=Integrated USB JTAG
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.external=FTDI Adapter
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.external.build.copy_jtag_files=1
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.bridge=ESP USB Bridge
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
waveshare_esp32_s3_lcd_147.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

waveshare_esp32_s3_lcd_147.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_lcd_147.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_lcd_147.menu.PSRAM.enabled.build.psram_type=opi
waveshare_esp32_s3_lcd_147.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_lcd_147.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_lcd_147.menu.PSRAM.disabled.build.psram_type=qspi

waveshare_esp32_s3_lcd_147.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_lcd_147.menu.FlashMode.qio120.build.flash_freq=80m
waveshare_esp32_s3_lcd_147.menu.FlashMode.dio=DIO 80MHz
waveshare_esp32_s3_lcd_147.menu.FlashMode.dio.build.flash_mode=dio
waveshare_esp32_s3_lcd_147.menu.FlashMode.dio.build.boot=dio
waveshare_esp32_s3_lcd_147.menu.FlashMode.dio.build.boot_freq=80m
waveshare_esp32_s3_lcd_147.menu.FlashMode.dio.build.flash_freq=80m
waveshare_esp32_s3_lcd_147.menu.FlashMode.opi=OPI 80MHz
waveshare_esp32_s3_lcd_147.menu.FlashMode.opi.build.flash_mode=dout
waveshare_esp32_s3_lcd_147.menu.FlashMode.opi.build.boot=opi
waveshare_esp32_s3_lcd_147.menu.FlashMode.opi.build.boot_freq=80m
waveshare_esp32_s3_lcd_147.menu.FlashMode.opi.build.flash_freq=80m

