espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_touch_lcd_28.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_touch_lcd_28.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_touch_lcd_28.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_touch_lcd_28.menu.EraseFlash.all.upload.erase_cmd=-e

waveshare_esp32_s3_touch_lcd_28.menu.ZigbeeMode.default=Disabled
waveshare_esp32_s3_touch_lcd_28.menu.ZigbeeMode.default.build.zigbee_mode=
waveshare_esp32_s3_touch_lcd_28.menu.ZigbeeMode.default.build.zigbee_libs=
waveshare_esp32_s3_touch_lcd_28.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
waveshare_esp32_s3_touch_lcd_28.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
waveshare_esp32_s3_touch_lcd_28.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

waveshare_esp32_s3_relay_6ch.name=Waveshare ESP32-S3-Relay-6CH
waveshare_esp32_s3_relay_6ch.vid.0=0x303a
waveshare_esp32_s3_relay_6ch.pid.0=0x8242
waveshare_esp32_s3_relay_6ch.upload_port.0.vid=0x303a
waveshare_esp32_s3_relay_6ch.upload_port.0.pid=0x8242

waveshare_esp32_s3_relay_6ch.bootloader.tool=esptool_py
waveshare_esp32_s3_relay_6ch.bootloader.tool.default=esptool_py

waveshare_esp32_s3_relay_6ch.upload.tool=esptool_py
waveshare_esp32_s3_relay_6ch.upload.tool.default=esptool_py
waveshare_esp32_s3_relay_6ch.upload.tool.network=esp_ota

waveshare_esp32_s3_relay_6ch.upload.maximum_size=1310720
waveshare_esp32_s3_relay_6ch.upload.maximum_data_size=327680
waveshare_esp32_s3_relay_6ch.upload.flags=
waveshare_esp32_s3_relay_6ch.upload.extra_flags=
waveshare_esp32_s3_relay_6ch.upload.use_1200bps_touch=false
waveshare_esp32_s3_relay_6ch.upload.wait_for_upload_port=false

waveshare_esp32_s3_relay_6ch.serial.disableDTR=false
waveshare_esp32_s3_relay_6ch.serial.disableRTS=false

waveshare_esp32_s3_relay_6ch.build.tarch=xtensa
waveshare_esp32_s3_relay_6ch.build.bootloader_addr=0x0
waveshare_esp32_s3_relay_6ch.build.target=esp32s3
waveshare_esp32_s3_relay_6ch.build.mcu=esp32s3
waveshare_esp32_s3_relay_6ch.build.core=esp32
waveshare_esp32_s3_relay_6ch.build.variant=waveshare_esp32_s3_relay_6ch
waveshare_esp32_s3_relay_6ch.build.board=WAVESHARE_ESP32_S3_RELAY_6CH

waveshare_esp32_s3_relay_6ch.build.usb_mode=1
waveshare_esp32_s3_relay_6ch.build.cdc_on_boot=0
waveshare_esp32_s3_relay_6ch.build.msc_on_boot=0
waveshare_esp32_s3_relay_6ch.build.dfu_on_boot=0
waveshare_esp32_s3_relay_6ch.build.f_cpu=240000000L
waveshare_esp32_s3_relay_6ch.build.flash_size=8MB
waveshare_esp32_s3_relay_6ch.build.flash_freq=80m
waveshare_esp32_s3_relay_6ch.build.flash_mode=qio
waveshare_esp32_s3_relay_6ch.build.boot=qio
waveshare_esp32_s3_relay_6ch.build.boot_freq=80m
waveshare_esp32_s3_relay_6ch.build.partitions=default
waveshare_esp32_s3_relay_6ch.build.defines=
waveshare_esp32_s3_relay_6ch.build.loop_core=
waveshare_esp32_s3_relay_6ch.build.event_core=
waveshare_esp32_s3_relay_6ch.build.psram_type=
waveshare_esp32_s3_relay_6ch.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.default=Disabled
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.default.build.copy_jtag_files=0
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.builtin=Integrated USB JTAG
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.external=FTDI Adapter
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.external.build.copy_jtag_files=1
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.bridge=ESP USB Bridge
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
waveshare_esp32_s3_relay_6ch.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

waveshare_esp32_s3_relay_6ch.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_relay_6ch.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_relay_6ch.menu.PSRAM.disabled.build.psram_type=qspi

waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.qio120.build.flash_freq=80m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.dio=DIO 80MHz
waveshare_esp32_s3_relay_6ch.menu.FlashMode.dio.build.flash_mode=dio
waveshare_esp32_s3_relay_6ch.menu.FlashMode.dio.build.boot=dio
waveshare_esp32_s3_relay_6ch.menu.FlashMode.dio.build.boot_freq=80m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.dio.build.flash_freq=80m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.opi=OPI 80MHz
waveshare_esp32_s3_relay_6ch.menu.FlashMode.opi.build.flash_mode=dout
waveshare_esp32_s3_relay_6ch.menu.FlashMode.opi.build.boot=opi
waveshare_esp32_s3_relay_6ch.menu.FlashMode.opi.build.boot_freq=80m
waveshare_esp32_s3_relay_6ch.menu.FlashMode.opi.build.flash_freq=80m

waveshare_esp32_s3_relay_6ch.menu.FlashSize.8M=8MB (64Mb)
waveshare_esp32_s3_relay_6ch.menu.FlashSize.8M.build.flash_size=8MB
waveshare_esp32_s3_relay_6ch.menu.FlashSize.8M.build.partitions=default_8MB
waveshare_esp32_s3_relay_6ch.menu.FlashSize.16M=16MB (128Mb)
waveshare_esp32_s3_relay_6ch.menu.FlashSize.16M.build.flash_size=16MB

waveshare_esp32_s3_relay_6ch.menu.LoopCore.1=Core 1
waveshare_esp32_s3_relay_6ch.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_relay_6ch.menu.LoopCore.0=Core 0
waveshare_esp32_s3_relay_6ch.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_relay_6ch.menu.EventsCore.1=Core 1
waveshare_esp32_s3_relay_6ch.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_relay_6ch.menu.EventsCore.0=Core 0
waveshare_esp32_s3_relay_6ch.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

