espressif/arduino-esp32/boards.txt
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.none=None
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.error=Error
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.info=Info
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_relay_6ch.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_relay_6ch.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_relay_6ch.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_relay_6ch.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_relay_6ch.menu.EraseFlash.all.upload.erase_cmd=-e

waveshare_esp32_s3_relay_6ch.menu.ZigbeeMode.default=Disabled
waveshare_esp32_s3_relay_6ch.menu.ZigbeeMode.default.build.zigbee_mode=
waveshare_esp32_s3_relay_6ch.menu.ZigbeeMode.default.build.zigbee_libs=
waveshare_esp32_s3_relay_6ch.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
waveshare_esp32_s3_relay_6ch.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
waveshare_esp32_s3_relay_6ch.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

waveshare_esp32_s3_touch_amoled_164.name=Waveshare ESP32-S3-Touch-AMOLED-1.64
waveshare_esp32_s3_touch_amoled_164.vid.0=0x303a
waveshare_esp32_s3_touch_amoled_164.pid.0=0x8249
waveshare_esp32_s3_touch_amoled_164.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_amoled_164.upload_port.0.pid=0x8249

waveshare_esp32_s3_touch_amoled_164.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_amoled_164.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_amoled_164.upload.tool=esptool_py
waveshare_esp32_s3_touch_amoled_164.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_amoled_164.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_amoled_164.upload.maximum_size=1310720

waveshare_esp32_s3_touch_amoled_164.upload.maximum_data_size=327680
waveshare_esp32_s3_touch_amoled_164.upload.flags=
waveshare_esp32_s3_touch_amoled_164.upload.extra_flags=
waveshare_esp32_s3_touch_amoled_164.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_164.upload.wait_for_upload_port=false

waveshare_esp32_s3_touch_amoled_164.serial.disableDTR=false
waveshare_esp32_s3_touch_amoled_164.serial.disableRTS=false

waveshare_esp32_s3_touch_amoled_164.build.tarch=xtensa
waveshare_esp32_s3_touch_amoled_164.build.bootloader_addr=0x0
waveshare_esp32_s3_touch_amoled_164.build.target=esp32s3
waveshare_esp32_s3_touch_amoled_164.build.mcu=esp32s3
waveshare_esp32_s3_touch_amoled_164.build.core=esp32
waveshare_esp32_s3_touch_amoled_164.build.variant=waveshare_esp32_s3_touch_amoled_164
waveshare_esp32_s3_touch_amoled_164.build.board=WAVESHARE_ESP32_S3_TOUCH_AMOLED_164

waveshare_esp32_s3_touch_amoled_164.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_164.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_164.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_164.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_164.build.f_cpu=240000000L
waveshare_esp32_s3_touch_amoled_164.build.flash_size=16MB

waveshare_esp32_s3_touch_amoled_164.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_164.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_164.build.boot=qio
waveshare_esp32_s3_touch_amoled_164.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_164.build.partitions=default
waveshare_esp32_s3_touch_amoled_164.build.defines=
waveshare_esp32_s3_touch_amoled_164.build.loop_core=
waveshare_esp32_s3_touch_amoled_164.build.event_core=
waveshare_esp32_s3_touch_amoled_164.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_164.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_touch_amoled_164.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_touch_amoled_164.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_touch_amoled_164.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_164.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_touch_amoled_164.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_touch_amoled_164.menu.PSRAM.enabled.build.psram_type=opi

waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_touch_amoled_164.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_touch_amoled_164.menu.LoopCore.1=Core 1
waveshare_esp32_s3_touch_amoled_164.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_164.menu.LoopCore.0=Core 0
waveshare_esp32_s3_touch_amoled_164.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_touch_amoled_164.menu.EventsCore.1=Core 1
waveshare_esp32_s3_touch_amoled_164.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_164.menu.EventsCore.0=Core 0
waveshare_esp32_s3_touch_amoled_164.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

waveshare_esp32_s3_touch_amoled_164.menu.USBMode.hwcdc=Hardware CDC and JTAG
waveshare_esp32_s3_touch_amoled_164.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_164.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_touch_amoled_164.menu.USBMode.default.build.usb_mode=0

waveshare_esp32_s3_touch_amoled_164.menu.CDCOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_164.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_164.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_touch_amoled_164.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_s3_touch_amoled_164.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_164.menu.MSCOnBoot.default.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_164.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_amoled_164.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_touch_amoled_164.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_164.menu.DFUOnBoot.default.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_164.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_amoled_164.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

waveshare_esp32_s3_touch_amoled_164.menu.UploadMode.default=UART0 / Hardware CDC
waveshare_esp32_s3_touch_amoled_164.menu.UploadMode.default.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_164.menu.UploadMode.default.upload.wait_for_upload_port=false
waveshare_esp32_s3_touch_amoled_164.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
waveshare_esp32_s3_touch_amoled_164.menu.UploadMode.cdc.upload.use_1200bps_touch=true
waveshare_esp32_s3_touch_amoled_164.menu.UploadMode.cdc.upload.wait_for_upload_port=true

