espressif/arduino-esp32/boards.txt
##############################################################

waveshare_esp32_s3_touch_amoled_143.name=Waveshare ESP32-S3-Touch-AMOLED-1.43
waveshare_esp32_s3_touch_amoled_143.vid.0=0x303a
waveshare_esp32_s3_touch_amoled_143.pid.0=0x824a
waveshare_esp32_s3_touch_amoled_143.upload_port.0.vid=0x303a
waveshare_esp32_s3_touch_amoled_143.upload_port.0.pid=0x824a

waveshare_esp32_s3_touch_amoled_143.bootloader.tool=esptool_py
waveshare_esp32_s3_touch_amoled_143.bootloader.tool.default=esptool_py

waveshare_esp32_s3_touch_amoled_143.upload.tool=esptool_py
waveshare_esp32_s3_touch_amoled_143.upload.tool.default=esptool_py
waveshare_esp32_s3_touch_amoled_143.upload.tool.network=esp_ota

waveshare_esp32_s3_touch_amoled_143.upload.maximum_size=1310720

waveshare_esp32_s3_touch_amoled_143.upload.maximum_data_size=327680
waveshare_esp32_s3_touch_amoled_143.upload.flags=
waveshare_esp32_s3_touch_amoled_143.upload.extra_flags=
waveshare_esp32_s3_touch_amoled_143.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_143.upload.wait_for_upload_port=false

waveshare_esp32_s3_touch_amoled_143.serial.disableDTR=false
waveshare_esp32_s3_touch_amoled_143.serial.disableRTS=false

waveshare_esp32_s3_touch_amoled_143.build.tarch=xtensa
waveshare_esp32_s3_touch_amoled_143.build.bootloader_addr=0x0
waveshare_esp32_s3_touch_amoled_143.build.target=esp32s3
waveshare_esp32_s3_touch_amoled_143.build.mcu=esp32s3
waveshare_esp32_s3_touch_amoled_143.build.core=esp32
waveshare_esp32_s3_touch_amoled_143.build.variant=waveshare_esp32_s3_touch_amoled_143
waveshare_esp32_s3_touch_amoled_143.build.board=WAVESHARE_ESP32_S3_TOUCH_AMOLED_143

waveshare_esp32_s3_touch_amoled_143.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_143.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_143.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_143.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_143.build.f_cpu=240000000L
waveshare_esp32_s3_touch_amoled_143.build.flash_size=16MB

waveshare_esp32_s3_touch_amoled_143.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_143.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_143.build.boot=qio
waveshare_esp32_s3_touch_amoled_143.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_143.build.partitions=default
waveshare_esp32_s3_touch_amoled_143.build.defines=
waveshare_esp32_s3_touch_amoled_143.build.loop_core=
waveshare_esp32_s3_touch_amoled_143.build.event_core=
waveshare_esp32_s3_touch_amoled_143.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_143.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_touch_amoled_143.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_touch_amoled_143.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_touch_amoled_143.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_touch_amoled_143.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_touch_amoled_143.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_touch_amoled_143.menu.PSRAM.enabled.build.psram_type=opi

waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_touch_amoled_143.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_touch_amoled_143.menu.LoopCore.1=Core 1
waveshare_esp32_s3_touch_amoled_143.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_143.menu.LoopCore.0=Core 0
waveshare_esp32_s3_touch_amoled_143.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_touch_amoled_143.menu.EventsCore.1=Core 1
waveshare_esp32_s3_touch_amoled_143.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_touch_amoled_143.menu.EventsCore.0=Core 0
waveshare_esp32_s3_touch_amoled_143.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

waveshare_esp32_s3_touch_amoled_143.menu.USBMode.hwcdc=Hardware CDC and JTAG
waveshare_esp32_s3_touch_amoled_143.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_touch_amoled_143.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_touch_amoled_143.menu.USBMode.default.build.usb_mode=0

waveshare_esp32_s3_touch_amoled_143.menu.CDCOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_143.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_touch_amoled_143.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_touch_amoled_143.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_s3_touch_amoled_143.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_143.menu.MSCOnBoot.default.build.msc_on_boot=0
waveshare_esp32_s3_touch_amoled_143.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_amoled_143.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_touch_amoled_143.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_touch_amoled_143.menu.DFUOnBoot.default.build.dfu_on_boot=0
waveshare_esp32_s3_touch_amoled_143.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
waveshare_esp32_s3_touch_amoled_143.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

waveshare_esp32_s3_touch_amoled_143.menu.UploadMode.default=UART0 / Hardware CDC
waveshare_esp32_s3_touch_amoled_143.menu.UploadMode.default.upload.use_1200bps_touch=false
waveshare_esp32_s3_touch_amoled_143.menu.UploadMode.default.upload.wait_for_upload_port=false
waveshare_esp32_s3_touch_amoled_143.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
waveshare_esp32_s3_touch_amoled_143.menu.UploadMode.cdc.upload.use_1200bps_touch=true
waveshare_esp32_s3_touch_amoled_143.menu.UploadMode.cdc.upload.wait_for_upload_port=true

waveshare_esp32_s3_touch_amoled_143.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
waveshare_esp32_s3_touch_amoled_143.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
waveshare_esp32_s3_touch_amoled_143.menu.PartitionScheme.default.build.partitions=default
waveshare_esp32_s3_touch_amoled_143.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)

