espressif/arduino-esp32/boards.txt
##############################################################


Pcbcupid_GLYPH_C3.name=Pcbcupid GLYPH C3
Pcbcupid_GLYPH_C3.vid.0=0x2886
Pcbcupid_GLYPH_C3.pid.0=0x0046

Pcbcupid_GLYPH_C3.bootloader.tool=esptool_py
Pcbcupid_GLYPH_C3.bootloader.tool.default=esptool_py

Pcbcupid_GLYPH_C3.upload.tool=esptool_py
Pcbcupid_GLYPH_C3.upload.tool.default=esptool_py
Pcbcupid_GLYPH_C3.upload.tool.network=esp_ota

Pcbcupid_GLYPH_C3.upload.maximum_size=1310720
Pcbcupid_GLYPH_C3.upload.maximum_data_size=327680
Pcbcupid_GLYPH_C3.upload.flags=
Pcbcupid_GLYPH_C3.upload.extra_flags=
Pcbcupid_GLYPH_C3.upload.use_1200bps_touch=false
Pcbcupid_GLYPH_C3.upload.wait_for_upload_port=false

Pcbcupid_GLYPH_C3.serial.disableDTR=false
Pcbcupid_GLYPH_C3.serial.disableRTS=false

Pcbcupid_GLYPH_C3.build.tarch=riscv32
Pcbcupid_GLYPH_C3.build.target=esp
Pcbcupid_GLYPH_C3.build.mcu=esp32c3
Pcbcupid_GLYPH_C3.build.core=esp32
Pcbcupid_GLYPH_C3.build.variant=Pcbcupid_GLYPH_C3
Pcbcupid_GLYPH_C3.build.board=PCBCUPID_GLYPHC3
Pcbcupid_GLYPH_C3.build.bootloader_addr=0x0

Pcbcupid_GLYPH_C3.build.cdc_on_boot=1
Pcbcupid_GLYPH_C3.build.f_cpu=160000000L
Pcbcupid_GLYPH_C3.build.flash_size=4MB
Pcbcupid_GLYPH_C3.build.flash_freq=80m
Pcbcupid_GLYPH_C3.build.flash_mode=qio
Pcbcupid_GLYPH_C3.build.boot=qio
Pcbcupid_GLYPH_C3.build.partitions=default
Pcbcupid_GLYPH_C3.build.defines=

Pcbcupid_GLYPH_C3.menu.CDCOnBoot.default=Enabled
Pcbcupid_GLYPH_C3.menu.CDCOnBoot.default.build.cdc_on_boot=1
Pcbcupid_GLYPH_C3.menu.CDCOnBoot.cdc=Disabled
Pcbcupid_GLYPH_C3.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

Pcbcupid_GLYPH_C3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.default.build.partitions=default
Pcbcupid_GLYPH_C3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Pcbcupid_GLYPH_C3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.minimal.build.partitions=minimal
Pcbcupid_GLYPH_C3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.no_ota.build.partitions=no_ota
Pcbcupid_GLYPH_C3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Pcbcupid_GLYPH_C3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Pcbcupid_GLYPH_C3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.huge_app.build.partitions=huge_app
Pcbcupid_GLYPH_C3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Pcbcupid_GLYPH_C3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Pcbcupid_GLYPH_C3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Pcbcupid_GLYPH_C3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Pcbcupid_GLYPH_C3.menu.PartitionScheme.rainmaker=RainMaker 4MB
Pcbcupid_GLYPH_C3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
Pcbcupid_GLYPH_C3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
Pcbcupid_GLYPH_C3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
Pcbcupid_GLYPH_C3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
Pcbcupid_GLYPH_C3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656

Pcbcupid_GLYPH_C3.menu.CPUFreq.160=160MHz (WiFi)
Pcbcupid_GLYPH_C3.menu.CPUFreq.160.build.f_cpu=160000000L
Pcbcupid_GLYPH_C3.menu.CPUFreq.80=80MHz (WiFi)
Pcbcupid_GLYPH_C3.menu.CPUFreq.80.build.f_cpu=80000000L
Pcbcupid_GLYPH_C3.menu.CPUFreq.40=40MHz
Pcbcupid_GLYPH_C3.menu.CPUFreq.40.build.f_cpu=40000000L
Pcbcupid_GLYPH_C3.menu.CPUFreq.20=20MHz
Pcbcupid_GLYPH_C3.menu.CPUFreq.20.build.f_cpu=20000000L
Pcbcupid_GLYPH_C3.menu.CPUFreq.10=10MHz
Pcbcupid_GLYPH_C3.menu.CPUFreq.10.build.f_cpu=10000000L

Pcbcupid_GLYPH_C3.menu.FlashMode.qio=QIO
Pcbcupid_GLYPH_C3.menu.FlashMode.qio.build.flash_mode=dio
Pcbcupid_GLYPH_C3.menu.FlashMode.qio.build.boot=qio
Pcbcupid_GLYPH_C3.menu.FlashMode.dio=DIO
Pcbcupid_GLYPH_C3.menu.FlashMode.dio.build.flash_mode=dio
Pcbcupid_GLYPH_C3.menu.FlashMode.dio.build.boot=dio

Pcbcupid_GLYPH_C3.menu.FlashFreq.80=80MHz
Pcbcupid_GLYPH_C3.menu.FlashFreq.80.build.flash_freq=80m
Pcbcupid_GLYPH_C3.menu.FlashFreq.40=40MHz
Pcbcupid_GLYPH_C3.menu.FlashFreq.40.build.flash_freq=40m

Pcbcupid_GLYPH_C3.menu.FlashSize.4M=4MB (32Mb)
Pcbcupid_GLYPH_C3.menu.FlashSize.4M.build.flash_size=4MB

Pcbcupid_GLYPH_C3.menu.UploadSpeed.921600=921600
Pcbcupid_GLYPH_C3.menu.UploadSpeed.921600.upload.speed=921600
Pcbcupid_GLYPH_C3.menu.UploadSpeed.115200=115200
Pcbcupid_GLYPH_C3.menu.UploadSpeed.115200.upload.speed=115200
Pcbcupid_GLYPH_C3.menu.UploadSpeed.256000.windows=256000
Pcbcupid_GLYPH_C3.menu.UploadSpeed.256000.upload.speed=256000
Pcbcupid_GLYPH_C3.menu.UploadSpeed.230400.windows.upload.speed=256000
Pcbcupid_GLYPH_C3.menu.UploadSpeed.230400=230400
Pcbcupid_GLYPH_C3.menu.UploadSpeed.230400.upload.speed=230400
Pcbcupid_GLYPH_C3.menu.UploadSpeed.460800.linux=460800
Pcbcupid_GLYPH_C3.menu.UploadSpeed.460800.macosx=460800
Pcbcupid_GLYPH_C3.menu.UploadSpeed.460800.upload.speed=460800
Pcbcupid_GLYPH_C3.menu.UploadSpeed.512000.windows=512000
Pcbcupid_GLYPH_C3.menu.UploadSpeed.512000.upload.speed=512000

Pcbcupid_GLYPH_C3.menu.DebugLevel.none=None
Pcbcupid_GLYPH_C3.menu.DebugLevel.none.build.code_debug=0
Pcbcupid_GLYPH_C3.menu.DebugLevel.error=Error
Pcbcupid_GLYPH_C3.menu.DebugLevel.error.build.code_debug=1
Pcbcupid_GLYPH_C3.menu.DebugLevel.warn=Warn
Pcbcupid_GLYPH_C3.menu.DebugLevel.warn.build.code_debug=2
Pcbcupid_GLYPH_C3.menu.DebugLevel.info=Info
Pcbcupid_GLYPH_C3.menu.DebugLevel.info.build.code_debug=3
Pcbcupid_GLYPH_C3.menu.DebugLevel.debug=Debug
Pcbcupid_GLYPH_C3.menu.DebugLevel.debug.build.code_debug=4
Pcbcupid_GLYPH_C3.menu.DebugLevel.verbose=Verbose
Pcbcupid_GLYPH_C3.menu.DebugLevel.verbose.build.code_debug=5

Pcbcupid_GLYPH_C3.menu.EraseFlash.none=Disabled
Pcbcupid_GLYPH_C3.menu.EraseFlash.none.upload.erase_cmd=
Pcbcupid_GLYPH_C3.menu.EraseFlash.all=Enabled
Pcbcupid_GLYPH_C3.menu.EraseFlash.all.upload.erase_cmd=-e

