espressif/arduino-esp32/boards.txt
##############################################################


Pcbcupid_GLYPH_H2.name=Pcbcupid GLYPH H2

Pcbcupid_GLYPH_H2.bootloader.tool=esptool_py
Pcbcupid_GLYPH_H2.bootloader.tool.default=esptool_py

Pcbcupid_GLYPH_H2.upload.tool=esptool_py
Pcbcupid_GLYPH_H2.upload.tool.default=esptool_py
Pcbcupid_GLYPH_H2.upload.tool.network=esp_ota

Pcbcupid_GLYPH_H2.upload.maximum_size=1310720
Pcbcupid_GLYPH_H2.upload.maximum_data_size=327680
Pcbcupid_GLYPH_H2.upload.flags=
Pcbcupid_GLYPH_H2.upload.extra_flags=
Pcbcupid_GLYPH_H2.upload.use_1200bps_touch=false
Pcbcupid_GLYPH_H2.upload.wait_for_upload_port=false

Pcbcupid_GLYPH_H2.serial.disableDTR=false
Pcbcupid_GLYPH_H2.serial.disableRTS=false

Pcbcupid_GLYPH_H2.build.tarch=riscv32
Pcbcupid_GLYPH_H2.build.target=esp
Pcbcupid_GLYPH_H2.build.mcu=esp32h2
Pcbcupid_GLYPH_H2.build.core=esp32
Pcbcupid_GLYPH_H2.build.variant=Pcbcupid_GLYPH_H2
Pcbcupid_GLYPH_H2.build.board=PCBCUPID_GLYPHH2
Pcbcupid_GLYPH_H2.build.bootloader_addr=0x0

Pcbcupid_GLYPH_H2.build.cdc_on_boot=1
Pcbcupid_GLYPH_H2.build.f_cpu=96000000L
Pcbcupid_GLYPH_H2.build.flash_size=4MB
Pcbcupid_GLYPH_H2.build.flash_freq=64m
Pcbcupid_GLYPH_H2.build.img_freq=48m
Pcbcupid_GLYPH_H2.build.flash_mode=qio
Pcbcupid_GLYPH_H2.build.boot=qio
Pcbcupid_GLYPH_H2.build.partitions=default
Pcbcupid_GLYPH_H2.build.defines=

## IDE 2.0 Seems to not update the value
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.default=Disabled
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.default.build.copy_jtag_files=0
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.builtin=Integrated USB JTAG
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.builtin.build.openocdscript=esp32h2-builtin.cfg
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.external=FTDI Adapter
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.external.build.openocdscript=esp32h2-ftdi.cfg
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.external.build.copy_jtag_files=1
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.bridge=ESP USB Bridge
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.bridge.build.openocdscript=esp32h2-bridge.cfg
Pcbcupid_GLYPH_H2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

Pcbcupid_GLYPH_H2.menu.CDCOnBoot.default=Enabled
Pcbcupid_GLYPH_H2.menu.CDCOnBoot.default.build.cdc_on_boot=1
Pcbcupid_GLYPH_H2.menu.CDCOnBoot.cdc=Disabled
Pcbcupid_GLYPH_H2.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

Pcbcupid_GLYPH_H2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.default.build.partitions=default
Pcbcupid_GLYPH_H2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Pcbcupid_GLYPH_H2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.minimal.build.partitions=minimal
Pcbcupid_GLYPH_H2.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.no_fs.build.partitions=no_fs
Pcbcupid_GLYPH_H2.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
Pcbcupid_GLYPH_H2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.no_ota.build.partitions=no_ota
Pcbcupid_GLYPH_H2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Pcbcupid_GLYPH_H2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Pcbcupid_GLYPH_H2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.huge_app.build.partitions=huge_app
Pcbcupid_GLYPH_H2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Pcbcupid_GLYPH_H2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Pcbcupid_GLYPH_H2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Pcbcupid_GLYPH_H2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Pcbcupid_GLYPH_H2.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
Pcbcupid_GLYPH_H2.menu.PartitionScheme.zigbee.build.partitions=zigbee
Pcbcupid_GLYPH_H2.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
Pcbcupid_GLYPH_H2.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
Pcbcupid_GLYPH_H2.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
Pcbcupid_GLYPH_H2.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
Pcbcupid_GLYPH_H2.menu.PartitionScheme.custom=Custom
Pcbcupid_GLYPH_H2.menu.PartitionScheme.custom.build.partitions=
Pcbcupid_GLYPH_H2.menu.PartitionScheme.custom.upload.maximum_size=16777216

Pcbcupid_GLYPH_H2.menu.FlashMode.qio=QIO
Pcbcupid_GLYPH_H2.menu.FlashMode.qio.build.flash_mode=dio
Pcbcupid_GLYPH_H2.menu.FlashMode.qio.build.boot=qio
Pcbcupid_GLYPH_H2.menu.FlashMode.dio=DIO
Pcbcupid_GLYPH_H2.menu.FlashMode.dio.build.flash_mode=dio
Pcbcupid_GLYPH_H2.menu.FlashMode.dio.build.boot=dio

Pcbcupid_GLYPH_H2.menu.FlashFreq.64=64MHz
Pcbcupid_GLYPH_H2.menu.FlashFreq.64.build.flash_freq=64m
Pcbcupid_GLYPH_H2.menu.FlashFreq.64.build.img_freq=48m
#Pcbcupid_GLYPH_H2.menu.FlashFreq.32=32MHz
#Pcbcupid_GLYPH_H2.menu.FlashFreq.32.build.flash_freq=32m
#Pcbcupid_GLYPH_H2.menu.FlashFreq.32.build.img_freq=24m
Pcbcupid_GLYPH_H2.menu.FlashFreq.16=16MHz
Pcbcupid_GLYPH_H2.menu.FlashFreq.16.build.flash_freq=16m
Pcbcupid_GLYPH_H2.menu.FlashFreq.16.build.img_freq=12m

Pcbcupid_GLYPH_H2.menu.FlashSize.2M=2MB (16Mb)
Pcbcupid_GLYPH_H2.menu.FlashSize.2M.build.flash_size=2MB
Pcbcupid_GLYPH_H2.menu.FlashSize.4M=4MB (32Mb)
Pcbcupid_GLYPH_H2.menu.FlashSize.4M.build.flash_size=4MB

Pcbcupid_GLYPH_H2.menu.UploadSpeed.921600=921600
Pcbcupid_GLYPH_H2.menu.UploadSpeed.921600.upload.speed=921600
Pcbcupid_GLYPH_H2.menu.UploadSpeed.115200=115200
Pcbcupid_GLYPH_H2.menu.UploadSpeed.115200.upload.speed=115200
Pcbcupid_GLYPH_H2.menu.UploadSpeed.256000.windows=256000
Pcbcupid_GLYPH_H2.menu.UploadSpeed.256000.upload.speed=256000
Pcbcupid_GLYPH_H2.menu.UploadSpeed.230400.windows.upload.speed=256000
Pcbcupid_GLYPH_H2.menu.UploadSpeed.230400=230400
Pcbcupid_GLYPH_H2.menu.UploadSpeed.230400.upload.speed=230400
Pcbcupid_GLYPH_H2.menu.UploadSpeed.460800.linux=460800
Pcbcupid_GLYPH_H2.menu.UploadSpeed.460800.macosx=460800
Pcbcupid_GLYPH_H2.menu.UploadSpeed.460800.upload.speed=460800
Pcbcupid_GLYPH_H2.menu.UploadSpeed.512000.windows=512000
Pcbcupid_GLYPH_H2.menu.UploadSpeed.512000.upload.speed=512000

Pcbcupid_GLYPH_H2.menu.DebugLevel.none=None
Pcbcupid_GLYPH_H2.menu.DebugLevel.none.build.code_debug=0
Pcbcupid_GLYPH_H2.menu.DebugLevel.error=Error
Pcbcupid_GLYPH_H2.menu.DebugLevel.error.build.code_debug=1
Pcbcupid_GLYPH_H2.menu.DebugLevel.warn=Warn
Pcbcupid_GLYPH_H2.menu.DebugLevel.warn.build.code_debug=2
Pcbcupid_GLYPH_H2.menu.DebugLevel.info=Info
Pcbcupid_GLYPH_H2.menu.DebugLevel.info.build.code_debug=3
Pcbcupid_GLYPH_H2.menu.DebugLevel.debug=Debug
Pcbcupid_GLYPH_H2.menu.DebugLevel.debug.build.code_debug=4
Pcbcupid_GLYPH_H2.menu.DebugLevel.verbose=Verbose
Pcbcupid_GLYPH_H2.menu.DebugLevel.verbose.build.code_debug=5

