espressif/arduino-esp32/boards.txt
Pcbcupid_GLYPH_H2.menu.EraseFlash.none=Disabled
Pcbcupid_GLYPH_H2.menu.EraseFlash.none.upload.erase_cmd=
Pcbcupid_GLYPH_H2.menu.EraseFlash.all=Enabled
Pcbcupid_GLYPH_H2.menu.EraseFlash.all.upload.erase_cmd=-e

Pcbcupid_GLYPH_H2.menu.ZigbeeMode.default=Disabled
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.default.build.zigbee_mode=
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.default.build.zigbee_libs=
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.ed=Zigbee ED (end device)
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
Pcbcupid_GLYPH_H2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################

Pcbcupid_GLYPH_C6.name=Pcbcupid GLYPH C6

Pcbcupid_GLYPH_C6.bootloader.tool=esptool_py
Pcbcupid_GLYPH_C6.bootloader.tool.default=esptool_py

Pcbcupid_GLYPH_C6.upload.tool=esptool_py
Pcbcupid_GLYPH_C6.upload.tool.default=esptool_py
Pcbcupid_GLYPH_C6.upload.tool.network=esp_ota

Pcbcupid_GLYPH_C6.upload.maximum_size=1310720
Pcbcupid_GLYPH_C6.upload.maximum_data_size=327680
Pcbcupid_GLYPH_C6.upload.flags=
Pcbcupid_GLYPH_C6.upload.extra_flags=
Pcbcupid_GLYPH_C6.upload.use_1200bps_touch=false
Pcbcupid_GLYPH_C6.upload.wait_for_upload_port=false

Pcbcupid_GLYPH_C6.serial.disableDTR=false
Pcbcupid_GLYPH_C6.serial.disableRTS=false

Pcbcupid_GLYPH_C6.build.tarch=riscv32
Pcbcupid_GLYPH_C6.build.target=esp
Pcbcupid_GLYPH_C6.build.mcu=esp32c6
Pcbcupid_GLYPH_C6.build.core=esp32
Pcbcupid_GLYPH_C6.build.variant=Pcbcupid_GLYPH_C6
Pcbcupid_GLYPH_C6.build.board=PCBCUPID_GLYPHC6
Pcbcupid_GLYPH_C6.build.bootloader_addr=0x0

Pcbcupid_GLYPH_C6.build.cdc_on_boot=1
Pcbcupid_GLYPH_C6.build.f_cpu=160000000L
Pcbcupid_GLYPH_C6.build.flash_size=4MB
Pcbcupid_GLYPH_C6.build.flash_freq=80m
Pcbcupid_GLYPH_C6.build.flash_mode=qio
Pcbcupid_GLYPH_C6.build.boot=qio
Pcbcupid_GLYPH_C6.build.partitions=default
Pcbcupid_GLYPH_C6.build.defines=

## IDE 2.0 Seems to not update the value
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.default=Disabled
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.default.build.copy_jtag_files=0
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.builtin=Integrated USB JTAG
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.external=FTDI Adapter
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.external.build.copy_jtag_files=1
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.bridge=ESP USB Bridge
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
Pcbcupid_GLYPH_C6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

Pcbcupid_GLYPH_C6.menu.CDCOnBoot.cdc=Enabled
Pcbcupid_GLYPH_C6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
Pcbcupid_GLYPH_C6.menu.CDCOnBoot.default=Disabled
Pcbcupid_GLYPH_C6.menu.CDCOnBoot.default.build.cdc_on_boot=0

Pcbcupid_GLYPH_C6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.default.build.partitions=default
Pcbcupid_GLYPH_C6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Pcbcupid_GLYPH_C6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.no_ota.build.partitions=no_ota
Pcbcupid_GLYPH_C6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Pcbcupid_GLYPH_C6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Pcbcupid_GLYPH_C6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Pcbcupid_GLYPH_C6.menu.PartitionScheme.huge_app.build.partitions=huge_app
Pcbcupid_GLYPH_C6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Pcbcupid_GLYPH_C6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
Pcbcupid_GLYPH_C6.menu.PartitionScheme.zigbee.build.partitions=zigbee
Pcbcupid_GLYPH_C6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
Pcbcupid_GLYPH_C6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
Pcbcupid_GLYPH_C6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
Pcbcupid_GLYPH_C6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720

Pcbcupid_GLYPH_C6.menu.CPUFreq.160=160MHz (WiFi)
Pcbcupid_GLYPH_C6.menu.CPUFreq.160.build.f_cpu=160000000L
Pcbcupid_GLYPH_C6.menu.CPUFreq.80=80MHz (WiFi)
Pcbcupid_GLYPH_C6.menu.CPUFreq.80.build.f_cpu=80000000L
Pcbcupid_GLYPH_C6.menu.CPUFreq.40=40MHz
Pcbcupid_GLYPH_C6.menu.CPUFreq.40.build.f_cpu=40000000L
Pcbcupid_GLYPH_C6.menu.CPUFreq.20=20MHz
Pcbcupid_GLYPH_C6.menu.CPUFreq.20.build.f_cpu=20000000L
Pcbcupid_GLYPH_C6.menu.CPUFreq.10=10MHz
Pcbcupid_GLYPH_C6.menu.CPUFreq.10.build.f_cpu=10000000L

Pcbcupid_GLYPH_C6.menu.FlashMode.qio=QIO
Pcbcupid_GLYPH_C6.menu.FlashMode.qio.build.flash_mode=dio
Pcbcupid_GLYPH_C6.menu.FlashMode.qio.build.boot=qio
Pcbcupid_GLYPH_C6.menu.FlashMode.dio=DIO
Pcbcupid_GLYPH_C6.menu.FlashMode.dio.build.flash_mode=dio
Pcbcupid_GLYPH_C6.menu.FlashMode.dio.build.boot=dio

Pcbcupid_GLYPH_C6.menu.FlashFreq.80=80MHz
Pcbcupid_GLYPH_C6.menu.FlashFreq.80.build.flash_freq=80m
Pcbcupid_GLYPH_C6.menu.FlashFreq.40=40MHz
Pcbcupid_GLYPH_C6.menu.FlashFreq.40.build.flash_freq=40m

