espressif/arduino-esp32/boards.txt
Pcbcupid_GLYPH_C6.menu.FlashSize.4M=4MB (32Mb)
Pcbcupid_GLYPH_C6.menu.FlashSize.4M.build.flash_size=4MB

Pcbcupid_GLYPH_C6.menu.UploadSpeed.921600=921600
Pcbcupid_GLYPH_C6.menu.UploadSpeed.921600.upload.speed=921600
Pcbcupid_GLYPH_C6.menu.UploadSpeed.115200=115200
Pcbcupid_GLYPH_C6.menu.UploadSpeed.115200.upload.speed=115200
Pcbcupid_GLYPH_C6.menu.UploadSpeed.256000.windows=256000
Pcbcupid_GLYPH_C6.menu.UploadSpeed.256000.upload.speed=256000
Pcbcupid_GLYPH_C6.menu.UploadSpeed.230400.windows.upload.speed=256000
Pcbcupid_GLYPH_C6.menu.UploadSpeed.230400=230400
Pcbcupid_GLYPH_C6.menu.UploadSpeed.230400.upload.speed=230400
Pcbcupid_GLYPH_C6.menu.UploadSpeed.460800.linux=460800
Pcbcupid_GLYPH_C6.menu.UploadSpeed.460800.macosx=460800
Pcbcupid_GLYPH_C6.menu.UploadSpeed.460800.upload.speed=460800
Pcbcupid_GLYPH_C6.menu.UploadSpeed.512000.windows=512000
Pcbcupid_GLYPH_C6.menu.UploadSpeed.512000.upload.speed=512000

Pcbcupid_GLYPH_C6.menu.DebugLevel.none=None
Pcbcupid_GLYPH_C6.menu.DebugLevel.none.build.code_debug=0
Pcbcupid_GLYPH_C6.menu.DebugLevel.error=Error
Pcbcupid_GLYPH_C6.menu.DebugLevel.error.build.code_debug=1
Pcbcupid_GLYPH_C6.menu.DebugLevel.warn=Warn
Pcbcupid_GLYPH_C6.menu.DebugLevel.warn.build.code_debug=2
Pcbcupid_GLYPH_C6.menu.DebugLevel.info=Info
Pcbcupid_GLYPH_C6.menu.DebugLevel.info.build.code_debug=3
Pcbcupid_GLYPH_C6.menu.DebugLevel.debug=Debug
Pcbcupid_GLYPH_C6.menu.DebugLevel.debug.build.code_debug=4
Pcbcupid_GLYPH_C6.menu.DebugLevel.verbose=Verbose
Pcbcupid_GLYPH_C6.menu.DebugLevel.verbose.build.code_debug=5

Pcbcupid_GLYPH_C6.menu.EraseFlash.none=Disabled
Pcbcupid_GLYPH_C6.menu.EraseFlash.none.upload.erase_cmd=
Pcbcupid_GLYPH_C6.menu.EraseFlash.all=Enabled
Pcbcupid_GLYPH_C6.menu.EraseFlash.all.upload.erase_cmd=-e

Pcbcupid_GLYPH_C6.menu.ZigbeeMode.default=Disabled
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.default.build.zigbee_mode=
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.default.build.zigbee_libs=
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.ed=Zigbee ED (end device)
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
Pcbcupid_GLYPH_C6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

##############################################################

yb_esp32s3_amp_v2.name=YelloByte YB-ESP32-S3-AMP (Rev.2)

yb_esp32s3_amp_v2.bootloader.tool=esptool_py
yb_esp32s3_amp_v2.bootloader.tool.default=esptool_py

yb_esp32s3_amp_v2.upload.tool=esptool_py
yb_esp32s3_amp_v2.upload.tool.default=esptool_py
yb_esp32s3_amp_v2.upload.tool.network=esp_ota

yb_esp32s3_amp_v2.upload.maximum_size=1310720
yb_esp32s3_amp_v2.upload.maximum_data_size=327680
yb_esp32s3_amp_v2.upload.flags=
yb_esp32s3_amp_v2.upload.extra_flags=
yb_esp32s3_amp_v2.upload.use_1200bps_touch=false
yb_esp32s3_amp_v2.upload.wait_for_upload_port=false

yb_esp32s3_amp_v2.serial.disableDTR=false
yb_esp32s3_amp_v2.serial.disableRTS=false

yb_esp32s3_amp_v2.build.tarch=xtensa
yb_esp32s3_amp_v2.build.bootloader_addr=0x0
yb_esp32s3_amp_v2.build.target=esp32s3
yb_esp32s3_amp_v2.build.mcu=esp32s3
yb_esp32s3_amp_v2.build.core=esp32
yb_esp32s3_amp_v2.build.variant=yb_esp32s3_amp_v2
yb_esp32s3_amp_v2.build.board=YB_ESP32S3_AMP_V2

yb_esp32s3_amp_v2.build.usb_mode=1
yb_esp32s3_amp_v2.build.cdc_on_boot=0
yb_esp32s3_amp_v2.build.msc_on_boot=0
yb_esp32s3_amp_v2.build.dfu_on_boot=0
yb_esp32s3_amp_v2.build.f_cpu=240000000L
yb_esp32s3_amp_v2.build.flash_size=8MB
yb_esp32s3_amp_v2.build.flash_freq=80m
yb_esp32s3_amp_v2.build.flash_mode=dio
yb_esp32s3_amp_v2.build.boot=qio
yb_esp32s3_amp_v2.build.partitions=default
yb_esp32s3_amp_v2.build.defines=
yb_esp32s3_amp_v2.build.loop_core=
yb_esp32s3_amp_v2.build.event_core=
yb_esp32s3_amp_v2.build.flash_type=qio
yb_esp32s3_amp_v2.build.psram_type=qspi
yb_esp32s3_amp_v2.build.memory_type={build.flash_type}_{build.psram_type}

yb_esp32s3_amp_v2.menu.JTAGAdapter.default=Disabled
yb_esp32s3_amp_v2.menu.JTAGAdapter.default.build.copy_jtag_files=0
yb_esp32s3_amp_v2.menu.JTAGAdapter.external=FTDI Adapter
yb_esp32s3_amp_v2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
yb_esp32s3_amp_v2.menu.JTAGAdapter.external.build.copy_jtag_files=1
yb_esp32s3_amp_v2.menu.JTAGAdapter.bridge=ESP USB Bridge
yb_esp32s3_amp_v2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
yb_esp32s3_amp_v2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

yb_esp32s3_amp_v2.menu.LoopCore.1=Core 1
yb_esp32s3_amp_v2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
yb_esp32s3_amp_v2.menu.LoopCore.0=Core 0
yb_esp32s3_amp_v2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

yb_esp32s3_amp_v2.menu.EventsCore.1=Core 1
yb_esp32s3_amp_v2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
yb_esp32s3_amp_v2.menu.EventsCore.0=Core 0
yb_esp32s3_amp_v2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

yb_esp32s3_amp_v2.menu.USBMode.hwcdc=Hardware CDC and JTAG
yb_esp32s3_amp_v2.menu.USBMode.hwcdc.build.usb_mode=1
yb_esp32s3_amp_v2.menu.USBMode.default=USB-OTG (TinyUSB)
yb_esp32s3_amp_v2.menu.USBMode.default.build.usb_mode=0

yb_esp32s3_amp_v2.menu.CDCOnBoot.default=Disabled
yb_esp32s3_amp_v2.menu.CDCOnBoot.default.build.cdc_on_boot=0
yb_esp32s3_amp_v2.menu.CDCOnBoot.cdc=Enabled
yb_esp32s3_amp_v2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

yb_esp32s3_amp_v2.menu.MSCOnBoot.default=Disabled
yb_esp32s3_amp_v2.menu.MSCOnBoot.default.build.msc_on_boot=0
yb_esp32s3_amp_v2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
yb_esp32s3_amp_v2.menu.MSCOnBoot.msc.build.msc_on_boot=1

yb_esp32s3_amp_v2.menu.DFUOnBoot.default=Disabled
yb_esp32s3_amp_v2.menu.DFUOnBoot.default.build.dfu_on_boot=0
yb_esp32s3_amp_v2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
yb_esp32s3_amp_v2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

