espressif/arduino-esp32/boards.txt
yb_esp32s3_amp_v3.menu.FlashMode.qio=QIO 80MHz
yb_esp32s3_amp_v3.menu.FlashMode.qio.build.flash_mode=dio
yb_esp32s3_amp_v3.menu.FlashMode.qio.build.boot=qio
yb_esp32s3_amp_v3.menu.FlashMode.qio.build.boot_freq=80m
yb_esp32s3_amp_v3.menu.FlashMode.qio.build.flash_freq=80m
yb_esp32s3_amp_v3.menu.FlashMode.qio120=QIO 120MHz
yb_esp32s3_amp_v3.menu.FlashMode.qio120.build.flash_mode=dio
yb_esp32s3_amp_v3.menu.FlashMode.qio120.build.boot=qio
yb_esp32s3_amp_v3.menu.FlashMode.qio120.build.boot_freq=120m
yb_esp32s3_amp_v3.menu.FlashMode.qio120.build.flash_freq=80m
yb_esp32s3_amp_v3.menu.FlashMode.dio=DIO 80MHz
yb_esp32s3_amp_v3.menu.FlashMode.dio.build.flash_mode=dio
yb_esp32s3_amp_v3.menu.FlashMode.dio.build.boot=dio
yb_esp32s3_amp_v3.menu.FlashMode.dio.build.boot_freq=80m
yb_esp32s3_amp_v3.menu.FlashMode.dio.build.flash_freq=80m
yb_esp32s3_amp_v3.menu.FlashMode.opi=OPI 80MHz
yb_esp32s3_amp_v3.menu.FlashMode.opi.build.flash_mode=dout
yb_esp32s3_amp_v3.menu.FlashMode.opi.build.boot=opi
yb_esp32s3_amp_v3.menu.FlashMode.opi.build.boot_freq=80m
yb_esp32s3_amp_v3.menu.FlashMode.opi.build.flash_freq=80m

yb_esp32s3_amp_v3.menu.FlashSize.4M=4MB (32Mb)
yb_esp32s3_amp_v3.menu.FlashSize.4M.build.flash_size=4MB
yb_esp32s3_amp_v3.menu.FlashSize.8M=8MB (64Mb)
yb_esp32s3_amp_v3.menu.FlashSize.8M.build.flash_size=8MB
yb_esp32s3_amp_v3.menu.FlashSize.16M=16MB (128Mb)
yb_esp32s3_amp_v3.menu.FlashSize.16M.build.flash_size=16MB

yb_esp32s3_amp_v3.menu.UploadSpeed.921600=921600
yb_esp32s3_amp_v3.menu.UploadSpeed.921600.upload.speed=921600
yb_esp32s3_amp_v3.menu.UploadSpeed.115200=115200
yb_esp32s3_amp_v3.menu.UploadSpeed.115200.upload.speed=115200
yb_esp32s3_amp_v3.menu.UploadSpeed.256000.windows=256000
yb_esp32s3_amp_v3.menu.UploadSpeed.256000.upload.speed=256000
yb_esp32s3_amp_v3.menu.UploadSpeed.230400.windows.upload.speed=256000
yb_esp32s3_amp_v3.menu.UploadSpeed.230400=230400
yb_esp32s3_amp_v3.menu.UploadSpeed.230400.upload.speed=230400
yb_esp32s3_amp_v3.menu.UploadSpeed.460800.linux=460800
yb_esp32s3_amp_v3.menu.UploadSpeed.460800.macosx=460800
yb_esp32s3_amp_v3.menu.UploadSpeed.460800.upload.speed=460800
yb_esp32s3_amp_v3.menu.UploadSpeed.512000.windows=512000
yb_esp32s3_amp_v3.menu.UploadSpeed.512000.upload.speed=512000

yb_esp32s3_amp_v3.menu.DebugLevel.none=None
yb_esp32s3_amp_v3.menu.DebugLevel.none.build.code_debug=0
yb_esp32s3_amp_v3.menu.DebugLevel.error=Error
yb_esp32s3_amp_v3.menu.DebugLevel.error.build.code_debug=1
yb_esp32s3_amp_v3.menu.DebugLevel.warn=Warn
yb_esp32s3_amp_v3.menu.DebugLevel.warn.build.code_debug=2
yb_esp32s3_amp_v3.menu.DebugLevel.info=Info
yb_esp32s3_amp_v3.menu.DebugLevel.info.build.code_debug=3
yb_esp32s3_amp_v3.menu.DebugLevel.debug=Debug
yb_esp32s3_amp_v3.menu.DebugLevel.debug.build.code_debug=4
yb_esp32s3_amp_v3.menu.DebugLevel.verbose=Verbose
yb_esp32s3_amp_v3.menu.DebugLevel.verbose.build.code_debug=5

yb_esp32s3_amp_v3.menu.EraseFlash.none=Disabled
yb_esp32s3_amp_v3.menu.EraseFlash.none.upload.erase_cmd=
yb_esp32s3_amp_v3.menu.EraseFlash.all=Enabled
yb_esp32s3_amp_v3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

yb_esp32s3_eth.name=YelloByte YB-ESP32-S3-ETH

yb_esp32s3_eth.bootloader.tool=esptool_py
yb_esp32s3_eth.bootloader.tool.default=esptool_py

yb_esp32s3_eth.upload.tool=esptool_py
yb_esp32s3_eth.upload.tool.default=esptool_py
yb_esp32s3_eth.upload.tool.network=esp_ota

yb_esp32s3_eth.upload.maximum_size=1310720
yb_esp32s3_eth.upload.maximum_data_size=327680
yb_esp32s3_eth.upload.flags=
yb_esp32s3_eth.upload.extra_flags=
yb_esp32s3_eth.upload.use_1200bps_touch=false
yb_esp32s3_eth.upload.wait_for_upload_port=false

yb_esp32s3_eth.serial.disableDTR=false
yb_esp32s3_eth.serial.disableRTS=false

yb_esp32s3_eth.build.tarch=xtensa
yb_esp32s3_eth.build.bootloader_addr=0x0
yb_esp32s3_eth.build.target=esp32s3
yb_esp32s3_eth.build.mcu=esp32s3
yb_esp32s3_eth.build.core=esp32
yb_esp32s3_eth.build.variant=yb_esp32s3_eth
yb_esp32s3_eth.build.board=YB_ESP32S3_ETH

yb_esp32s3_eth.build.usb_mode=1
yb_esp32s3_eth.build.cdc_on_boot=0
yb_esp32s3_eth.build.msc_on_boot=0
yb_esp32s3_eth.build.dfu_on_boot=0
yb_esp32s3_eth.build.f_cpu=240000000L
yb_esp32s3_eth.build.flash_size=4MB
yb_esp32s3_eth.build.flash_freq=80m
yb_esp32s3_eth.build.flash_mode=dio
yb_esp32s3_eth.build.boot=qio
yb_esp32s3_eth.build.boot_freq=80m
yb_esp32s3_eth.build.partitions=default
yb_esp32s3_eth.build.defines=
yb_esp32s3_eth.build.loop_core=
yb_esp32s3_eth.build.event_core=
yb_esp32s3_eth.build.psram_type=qspi
yb_esp32s3_eth.build.memory_type={build.boot}_{build.psram_type}

yb_esp32s3_eth.menu.JTAGAdapter.default=Disabled
yb_esp32s3_eth.menu.JTAGAdapter.default.build.copy_jtag_files=0
yb_esp32s3_eth.menu.JTAGAdapter.builtin=Integrated USB JTAG
yb_esp32s3_eth.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
yb_esp32s3_eth.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
yb_esp32s3_eth.menu.JTAGAdapter.external=FTDI Adapter
yb_esp32s3_eth.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
yb_esp32s3_eth.menu.JTAGAdapter.external.build.copy_jtag_files=1
yb_esp32s3_eth.menu.JTAGAdapter.bridge=ESP USB Bridge
yb_esp32s3_eth.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
yb_esp32s3_eth.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

yb_esp32s3_eth.menu.LoopCore.1=Core 1
yb_esp32s3_eth.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
yb_esp32s3_eth.menu.LoopCore.0=Core 0
yb_esp32s3_eth.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

yb_esp32s3_eth.menu.EventsCore.1=Core 1
yb_esp32s3_eth.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
yb_esp32s3_eth.menu.EventsCore.0=Core 0
yb_esp32s3_eth.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

yb_esp32s3_eth.menu.USBMode.hwcdc=Hardware CDC and JTAG
yb_esp32s3_eth.menu.USBMode.hwcdc.build.usb_mode=1
yb_esp32s3_eth.menu.USBMode.default=USB-OTG (TinyUSB)
yb_esp32s3_eth.menu.USBMode.default.build.usb_mode=0

yb_esp32s3_eth.menu.CDCOnBoot.default=Disabled
yb_esp32s3_eth.menu.CDCOnBoot.default.build.cdc_on_boot=0
yb_esp32s3_eth.menu.CDCOnBoot.cdc=Enabled
yb_esp32s3_eth.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

yb_esp32s3_eth.menu.MSCOnBoot.default=Disabled
yb_esp32s3_eth.menu.MSCOnBoot.default.build.msc_on_boot=0
yb_esp32s3_eth.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
yb_esp32s3_eth.menu.MSCOnBoot.msc.build.msc_on_boot=1

yb_esp32s3_eth.menu.DFUOnBoot.default=Disabled
yb_esp32s3_eth.menu.DFUOnBoot.default.build.dfu_on_boot=0
yb_esp32s3_eth.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
yb_esp32s3_eth.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

yb_esp32s3_eth.menu.UploadMode.default=UART0 / Hardware CDC
yb_esp32s3_eth.menu.UploadMode.default.upload.use_1200bps_touch=false
yb_esp32s3_eth.menu.UploadMode.default.upload.wait_for_upload_port=false
yb_esp32s3_eth.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
yb_esp32s3_eth.menu.UploadMode.cdc.upload.use_1200bps_touch=true
yb_esp32s3_eth.menu.UploadMode.cdc.upload.wait_for_upload_port=true

