espressif/arduino-esp32/boards.txt
##############################################################

yb_esp32s3_drv.name=YelloByte YB-ESP32-S3-DRV

yb_esp32s3_drv.bootloader.tool=esptool_py
yb_esp32s3_drv.bootloader.tool.default=esptool_py

yb_esp32s3_drv.upload.tool=esptool_py
yb_esp32s3_drv.upload.tool.default=esptool_py
yb_esp32s3_drv.upload.tool.network=esp_ota

yb_esp32s3_drv.upload.maximum_size=1310720
yb_esp32s3_drv.upload.maximum_data_size=327680
yb_esp32s3_drv.upload.flags=
yb_esp32s3_drv.upload.extra_flags=
yb_esp32s3_drv.upload.use_1200bps_touch=false
yb_esp32s3_drv.upload.wait_for_upload_port=false

yb_esp32s3_drv.serial.disableDTR=false
yb_esp32s3_drv.serial.disableRTS=false

yb_esp32s3_drv.build.tarch=xtensa
yb_esp32s3_drv.build.bootloader_addr=0x0
yb_esp32s3_drv.build.target=esp32s3
yb_esp32s3_drv.build.mcu=esp32s3
yb_esp32s3_drv.build.core=esp32
yb_esp32s3_drv.build.variant=yb_esp32s3_drv
yb_esp32s3_drv.build.board=YB_ESP32S3_DRV

yb_esp32s3_drv.build.usb_mode=1
yb_esp32s3_drv.build.cdc_on_boot=1
yb_esp32s3_drv.build.msc_on_boot=0
yb_esp32s3_drv.build.dfu_on_boot=0
yb_esp32s3_drv.build.f_cpu=240000000L
yb_esp32s3_drv.build.flash_size=8MB
yb_esp32s3_drv.build.flash_freq=80m
yb_esp32s3_drv.build.flash_mode=dio
yb_esp32s3_drv.build.boot=qio
yb_esp32s3_drv.build.partitions=default
yb_esp32s3_drv.build.defines=
yb_esp32s3_drv.build.loop_core=
yb_esp32s3_drv.build.event_core=
yb_esp32s3_drv.build.flash_type=qio
yb_esp32s3_drv.build.psram_type=qspi
yb_esp32s3_drv.build.memory_type={build.flash_type}_{build.psram_type}

yb_esp32s3_drv.menu.JTAGAdapter.default=Disabled
yb_esp32s3_drv.menu.JTAGAdapter.default.build.copy_jtag_files=0
yb_esp32s3_drv.menu.JTAGAdapter.builtin=Integrated USB JTAG
yb_esp32s3_drv.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
yb_esp32s3_drv.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
yb_esp32s3_drv.menu.JTAGAdapter.external=FTDI Adapter
yb_esp32s3_drv.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
yb_esp32s3_drv.menu.JTAGAdapter.external.build.copy_jtag_files=1
yb_esp32s3_drv.menu.JTAGAdapter.bridge=ESP USB Bridge
yb_esp32s3_drv.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
yb_esp32s3_drv.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

yb_esp32s3_drv.menu.LoopCore.1=Core 1
yb_esp32s3_drv.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
yb_esp32s3_drv.menu.LoopCore.0=Core 0
yb_esp32s3_drv.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

yb_esp32s3_drv.menu.EventsCore.1=Core 1
yb_esp32s3_drv.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
yb_esp32s3_drv.menu.EventsCore.0=Core 0
yb_esp32s3_drv.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

yb_esp32s3_drv.menu.USBMode.hwcdc=Hardware CDC and JTAG
yb_esp32s3_drv.menu.USBMode.hwcdc.build.usb_mode=1
yb_esp32s3_drv.menu.USBMode.default=USB-OTG (TinyUSB)
yb_esp32s3_drv.menu.USBMode.default.build.usb_mode=0

yb_esp32s3_drv.menu.CDCOnBoot.cdc=Enabled
yb_esp32s3_drv.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
yb_esp32s3_drv.menu.CDCOnBoot.default=Disabled
yb_esp32s3_drv.menu.CDCOnBoot.default.build.cdc_on_boot=0

yb_esp32s3_drv.menu.MSCOnBoot.default=Disabled
yb_esp32s3_drv.menu.MSCOnBoot.default.build.msc_on_boot=0
yb_esp32s3_drv.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
yb_esp32s3_drv.menu.MSCOnBoot.msc.build.msc_on_boot=1

yb_esp32s3_drv.menu.DFUOnBoot.default=Disabled
yb_esp32s3_drv.menu.DFUOnBoot.default.build.dfu_on_boot=0
yb_esp32s3_drv.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
yb_esp32s3_drv.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

yb_esp32s3_drv.menu.UploadMode.default=UART0 / Hardware CDC
yb_esp32s3_drv.menu.UploadMode.default.upload.use_1200bps_touch=false
yb_esp32s3_drv.menu.UploadMode.default.upload.wait_for_upload_port=false
yb_esp32s3_drv.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
yb_esp32s3_drv.menu.UploadMode.cdc.upload.use_1200bps_touch=true
yb_esp32s3_drv.menu.UploadMode.cdc.upload.wait_for_upload_port=true

yb_esp32s3_drv.menu.PSRAM.enabled=QSPI PSRAM
yb_esp32s3_drv.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
yb_esp32s3_drv.menu.PSRAM.enabled.build.psram_type=qspi
yb_esp32s3_drv.menu.PSRAM.disabled=Disabled
yb_esp32s3_drv.menu.PSRAM.disabled.build.defines=
yb_esp32s3_drv.menu.PSRAM.disabled.build.psram_type=qspi
yb_esp32s3_drv.menu.PSRAM.opi=OPI PSRAM
yb_esp32s3_drv.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
yb_esp32s3_drv.menu.PSRAM.opi.build.psram_type=opi

yb_esp32s3_drv.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.default.build.partitions=default
yb_esp32s3_drv.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
yb_esp32s3_drv.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
yb_esp32s3_drv.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
yb_esp32s3_drv.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
yb_esp32s3_drv.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.minimal.build.partitions=minimal
yb_esp32s3_drv.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.no_ota.build.partitions=no_ota
yb_esp32s3_drv.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
yb_esp32s3_drv.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
yb_esp32s3_drv.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
yb_esp32s3_drv.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
yb_esp32s3_drv.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
yb_esp32s3_drv.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
yb_esp32s3_drv.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
yb_esp32s3_drv.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
yb_esp32s3_drv.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
yb_esp32s3_drv.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.huge_app.build.partitions=huge_app
yb_esp32s3_drv.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
yb_esp32s3_drv.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
yb_esp32s3_drv.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
yb_esp32s3_drv.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
yb_esp32s3_drv.menu.PartitionScheme.max_app_8MB=Maximum APP (7.9MB APP No OTA/No FS)
yb_esp32s3_drv.menu.PartitionScheme.max_app_8MB.build.partitions=max_app_8MB
yb_esp32s3_drv.menu.PartitionScheme.max_app_8MB.upload.maximum_size=8257536

yb_esp32s3_drv.menu.CPUFreq.240=240MHz (WiFi)
yb_esp32s3_drv.menu.CPUFreq.240.build.f_cpu=240000000L
yb_esp32s3_drv.menu.CPUFreq.160=160MHz (WiFi)
yb_esp32s3_drv.menu.CPUFreq.160.build.f_cpu=160000000L
yb_esp32s3_drv.menu.CPUFreq.80=80MHz (WiFi)
yb_esp32s3_drv.menu.CPUFreq.80.build.f_cpu=80000000L
yb_esp32s3_drv.menu.CPUFreq.40=40MHz
yb_esp32s3_drv.menu.CPUFreq.40.build.f_cpu=40000000L
yb_esp32s3_drv.menu.CPUFreq.20=20MHz
yb_esp32s3_drv.menu.CPUFreq.20.build.f_cpu=20000000L
yb_esp32s3_drv.menu.CPUFreq.10=10MHz
yb_esp32s3_drv.menu.CPUFreq.10.build.f_cpu=10000000L

yb_esp32s3_drv.menu.FlashMode.qio=QIO 80MHz
yb_esp32s3_drv.menu.FlashMode.qio.build.flash_mode=dio
yb_esp32s3_drv.menu.FlashMode.qio.build.boot=qio
yb_esp32s3_drv.menu.FlashMode.qio.build.boot_freq=80m
yb_esp32s3_drv.menu.FlashMode.qio.build.flash_freq=80m
yb_esp32s3_drv.menu.FlashMode.qio120=QIO 120MHz
yb_esp32s3_drv.menu.FlashMode.qio120.build.flash_mode=dio
yb_esp32s3_drv.menu.FlashMode.qio120.build.boot=qio
yb_esp32s3_drv.menu.FlashMode.qio120.build.boot_freq=120m
yb_esp32s3_drv.menu.FlashMode.qio120.build.flash_freq=80m
yb_esp32s3_drv.menu.FlashMode.dio=DIO 80MHz
yb_esp32s3_drv.menu.FlashMode.dio.build.flash_mode=dio
yb_esp32s3_drv.menu.FlashMode.dio.build.boot=dio
yb_esp32s3_drv.menu.FlashMode.dio.build.boot_freq=80m
yb_esp32s3_drv.menu.FlashMode.dio.build.flash_freq=80m
yb_esp32s3_drv.menu.FlashMode.opi=OPI 80MHz
yb_esp32s3_drv.menu.FlashMode.opi.build.flash_mode=dout
yb_esp32s3_drv.menu.FlashMode.opi.build.boot=opi
yb_esp32s3_drv.menu.FlashMode.opi.build.boot_freq=80m
yb_esp32s3_drv.menu.FlashMode.opi.build.flash_freq=80m

yb_esp32s3_drv.menu.FlashSize.4M=4MB (32Mb)
yb_esp32s3_drv.menu.FlashSize.4M.build.flash_size=4MB
yb_esp32s3_drv.menu.FlashSize.8M=8MB (64Mb)
yb_esp32s3_drv.menu.FlashSize.8M.build.flash_size=8MB
yb_esp32s3_drv.menu.FlashSize.16M=16MB (128Mb)
yb_esp32s3_drv.menu.FlashSize.16M.build.flash_size=16MB

yb_esp32s3_drv.menu.UploadSpeed.921600=921600
yb_esp32s3_drv.menu.UploadSpeed.921600.upload.speed=921600
yb_esp32s3_drv.menu.UploadSpeed.115200=115200
yb_esp32s3_drv.menu.UploadSpeed.115200.upload.speed=115200
yb_esp32s3_drv.menu.UploadSpeed.256000.windows=256000
yb_esp32s3_drv.menu.UploadSpeed.256000.upload.speed=256000
yb_esp32s3_drv.menu.UploadSpeed.230400.windows.upload.speed=256000
yb_esp32s3_drv.menu.UploadSpeed.230400=230400
yb_esp32s3_drv.menu.UploadSpeed.230400.upload.speed=230400
yb_esp32s3_drv.menu.UploadSpeed.460800.linux=460800
yb_esp32s3_drv.menu.UploadSpeed.460800.macosx=460800
yb_esp32s3_drv.menu.UploadSpeed.460800.upload.speed=460800
yb_esp32s3_drv.menu.UploadSpeed.512000.windows=512000
yb_esp32s3_drv.menu.UploadSpeed.512000.upload.speed=512000

