espressif/arduino-esp32/boards.txt
##############################################################
# Huidu HD-WF4 - esp32-s3 HUB75 driver board
# https://www.hdwell.com/Product/index46.html

huidu_hd_wf4.name=Huidu HD-WF4

huidu_hd_wf4.bootloader.tool=esptool_py
huidu_hd_wf4.bootloader.tool.default=esptool_py

huidu_hd_wf4.upload.tool=esptool_py
huidu_hd_wf4.upload.tool.default=esptool_py
huidu_hd_wf4.upload.tool.network=esp_ota

huidu_hd_wf4.upload.maximum_size=1310720
huidu_hd_wf4.upload.maximum_data_size=327680
huidu_hd_wf4.upload.flags=
huidu_hd_wf4.upload.extra_flags=
huidu_hd_wf4.upload.use_1200bps_touch=true
huidu_hd_wf4.upload.wait_for_upload_port=true

huidu_hd_wf4.serial.disableDTR=false
huidu_hd_wf4.serial.disableRTS=false

huidu_hd_wf4.build.tarch=xtensa
huidu_hd_wf4.build.bootloader_addr=0x0
huidu_hd_wf4.build.target=esp32s3
huidu_hd_wf4.build.mcu=esp32s3
huidu_hd_wf4.build.core=esp32
huidu_hd_wf4.build.variant=huidu_hd_wf4
huidu_hd_wf4.build.board=HUIDU_HD_WF4

huidu_hd_wf4.build.usb_mode=0
huidu_hd_wf4.build.cdc_on_boot=1
huidu_hd_wf4.build.msc_on_boot=0
huidu_hd_wf4.build.dfu_on_boot=0
huidu_hd_wf4.build.f_cpu=240000000L
huidu_hd_wf4.build.flash_size=8MB
huidu_hd_wf4.build.flash_freq=80m
huidu_hd_wf4.build.flash_mode=qio
huidu_hd_wf4.build.boot=qio
huidu_hd_wf4.build.partitions=default
huidu_hd_wf4.build.defines=
huidu_hd_wf4.build.loop_core=
huidu_hd_wf4.build.event_core=
huidu_hd_wf4.build.flash_type=qio
huidu_hd_wf4.build.psram_type=qspi
huidu_hd_wf4.build.memory_type={build.flash_type}_{build.psram_type}

huidu_hd_wf4.menu.FlashSize.8M=8MB (64Mb)
huidu_hd_wf4.menu.FlashSize.8M.build.flash_size=8MB

huidu_hd_wf4.menu.LoopCore.1=Core 1
huidu_hd_wf4.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
huidu_hd_wf4.menu.LoopCore.0=Core 0
huidu_hd_wf4.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

huidu_hd_wf4.menu.EventsCore.1=Core 1
huidu_hd_wf4.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
huidu_hd_wf4.menu.EventsCore.0=Core 0
huidu_hd_wf4.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

huidu_hd_wf4.menu.USBMode.hwcdc=Hardware CDC and JTAG
huidu_hd_wf4.menu.USBMode.hwcdc.build.usb_mode=1
huidu_hd_wf4.menu.USBMode.default=USB-OTG (TinyUSB)
huidu_hd_wf4.menu.USBMode.default.build.usb_mode=0

huidu_hd_wf4.menu.CDCOnBoot.default=Enabled
huidu_hd_wf4.menu.CDCOnBoot.default.build.cdc_on_boot=1
huidu_hd_wf4.menu.CDCOnBoot.cdc=Disabled
huidu_hd_wf4.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

huidu_hd_wf4.menu.MSCOnBoot.default=Disabled
huidu_hd_wf4.menu.MSCOnBoot.default.build.msc_on_boot=0
huidu_hd_wf4.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
huidu_hd_wf4.menu.MSCOnBoot.msc.build.msc_on_boot=1

huidu_hd_wf4.menu.DFUOnBoot.default=Disabled
huidu_hd_wf4.menu.DFUOnBoot.default.build.dfu_on_boot=0
huidu_hd_wf4.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
huidu_hd_wf4.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

huidu_hd_wf4.menu.UploadMode.default=UART0 / Hardware CDC
huidu_hd_wf4.menu.UploadMode.default.upload.use_1200bps_touch=false
huidu_hd_wf4.menu.UploadMode.default.upload.wait_for_upload_port=false
huidu_hd_wf4.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
huidu_hd_wf4.menu.UploadMode.cdc.upload.use_1200bps_touch=true
huidu_hd_wf4.menu.UploadMode.cdc.upload.wait_for_upload_port=true

huidu_hd_wf4.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
huidu_hd_wf4.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
huidu_hd_wf4.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
huidu_hd_wf4.menu.PartitionScheme.large_spiffs_8MB=Large SPIFFS (1.3MB APP/5.5MiB SPIFFS)
huidu_hd_wf4.menu.PartitionScheme.large_spiffs_8MB.build.partitions=large_spiffs_8MB
huidu_hd_wf4.menu.PartitionScheme.large_spiffs_8MB.upload.maximum_size=1310720
huidu_hd_wf4.menu.PartitionScheme.default_ffat_8MB=8MiB fatfs (3MB APP/1.5MB FATFS)
huidu_hd_wf4.menu.PartitionScheme.default_ffat_8MB.build.partitions=default_ffat_8MB
huidu_hd_wf4.menu.PartitionScheme.default_ffat_8MB.upload.maximum_size=3342336

huidu_hd_wf4.menu.CPUFreq.240=240MHz (WiFi)
huidu_hd_wf4.menu.CPUFreq.240.build.f_cpu=240000000L
huidu_hd_wf4.menu.CPUFreq.160=160MHz (WiFi)
huidu_hd_wf4.menu.CPUFreq.160.build.f_cpu=160000000L
huidu_hd_wf4.menu.CPUFreq.80=80MHz (WiFi)
huidu_hd_wf4.menu.CPUFreq.80.build.f_cpu=80000000L
huidu_hd_wf4.menu.CPUFreq.40=40MHz
huidu_hd_wf4.menu.CPUFreq.40.build.f_cpu=40000000L

huidu_hd_wf4.menu.FlashMode.dio=DIO 80MHz
huidu_hd_wf4.menu.FlashMode.dio.build.flash_mode=dio
huidu_hd_wf4.menu.FlashMode.dio.build.boot=dio
huidu_hd_wf4.menu.FlashMode.dio.build.boot_freq=80m
huidu_hd_wf4.menu.FlashMode.dio.build.flash_freq=80m

huidu_hd_wf4.menu.UploadSpeed.921600=921600
huidu_hd_wf4.menu.UploadSpeed.921600.upload.speed=921600
huidu_hd_wf4.menu.UploadSpeed.115200=115200
huidu_hd_wf4.menu.UploadSpeed.115200.upload.speed=115200
huidu_hd_wf4.menu.UploadSpeed.460800.linux=460800
huidu_hd_wf4.menu.UploadSpeed.460800.macosx=460800
huidu_hd_wf4.menu.UploadSpeed.460800.upload.speed=460800

huidu_hd_wf4.menu.DebugLevel.none=None
huidu_hd_wf4.menu.DebugLevel.none.build.code_debug=0
huidu_hd_wf4.menu.DebugLevel.error=Error
huidu_hd_wf4.menu.DebugLevel.error.build.code_debug=1
huidu_hd_wf4.menu.DebugLevel.warn=Warn
huidu_hd_wf4.menu.DebugLevel.warn.build.code_debug=2
huidu_hd_wf4.menu.DebugLevel.info=Info
huidu_hd_wf4.menu.DebugLevel.info.build.code_debug=3
huidu_hd_wf4.menu.DebugLevel.debug=Debug
huidu_hd_wf4.menu.DebugLevel.debug.build.code_debug=4
huidu_hd_wf4.menu.DebugLevel.verbose=Verbose
huidu_hd_wf4.menu.DebugLevel.verbose.build.code_debug=5

huidu_hd_wf4.menu.EraseFlash.none=Disabled
huidu_hd_wf4.menu.EraseFlash.none.upload.erase_cmd=
huidu_hd_wf4.menu.EraseFlash.all=Enabled
huidu_hd_wf4.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

# CYOBot (CYOBrain V2 ESP32S3) Board
cyobot_v2_esp32s3.name=CYOBOT V2 ESP32S3

cyobot_v2_esp32s3.bootloader.tool=esptool_py
cyobot_v2_esp32s3.bootloader.tool.default=esptool_py

cyobot_v2_esp32s3.upload.tool=esptool_py
cyobot_v2_esp32s3.upload.tool.default=esptool_py
cyobot_v2_esp32s3.upload.tool.network=esp_ota

cyobot_v2_esp32s3.upload.maximum_size=1310720
cyobot_v2_esp32s3.upload.maximum_data_size=327680
cyobot_v2_esp32s3.upload.flags=
cyobot_v2_esp32s3.upload.extra_flags=
cyobot_v2_esp32s3.upload.use_1200bps_touch=false
cyobot_v2_esp32s3.upload.wait_for_upload_port=false

cyobot_v2_esp32s3.serial.disableDTR=false
cyobot_v2_esp32s3.serial.disableRTS=false

cyobot_v2_esp32s3.build.tarch=xtensa
cyobot_v2_esp32s3.build.bootloader_addr=0x0
cyobot_v2_esp32s3.build.target=esp32s3
cyobot_v2_esp32s3.build.mcu=esp32s3
cyobot_v2_esp32s3.build.core=esp32
cyobot_v2_esp32s3.build.variant=cyobot_v2_esp32s3
cyobot_v2_esp32s3.build.board=CYOBOT_V2_ESP32S3

cyobot_v2_esp32s3.build.usb_mode=1
cyobot_v2_esp32s3.build.cdc_on_boot=0
cyobot_v2_esp32s3.build.msc_on_boot=0
cyobot_v2_esp32s3.build.dfu_on_boot=0
cyobot_v2_esp32s3.build.f_cpu=240000000L
cyobot_v2_esp32s3.build.flash_size=4MB
cyobot_v2_esp32s3.build.flash_freq=80m
cyobot_v2_esp32s3.build.flash_mode=dio
cyobot_v2_esp32s3.build.boot=qio
cyobot_v2_esp32s3.build.boot_freq=80m
cyobot_v2_esp32s3.build.partitions=default
cyobot_v2_esp32s3.build.defines=
cyobot_v2_esp32s3.build.loop_core=
cyobot_v2_esp32s3.build.event_core=
cyobot_v2_esp32s3.build.psram_type=qspi
cyobot_v2_esp32s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
cyobot_v2_esp32s3.menu.JTAGAdapter.default=Disabled
cyobot_v2_esp32s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
cyobot_v2_esp32s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
cyobot_v2_esp32s3.menu.JTAGAdapter.builtin.build.openocdscript=cyobot_v2_esp32s3-builtin.cfg
cyobot_v2_esp32s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
cyobot_v2_esp32s3.menu.JTAGAdapter.external=FTDI Adapter
cyobot_v2_esp32s3.menu.JTAGAdapter.external.build.openocdscript=cyobot_v2_esp32s3-ftdi.cfg
cyobot_v2_esp32s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
cyobot_v2_esp32s3.menu.JTAGAdapter.bridge=ESP USB Bridge
cyobot_v2_esp32s3.menu.JTAGAdapter.bridge.build.openocdscript=cyobot_v2_esp32s3-bridge.cfg
cyobot_v2_esp32s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

cyobot_v2_esp32s3.menu.PSRAM.disabled=Disabled
cyobot_v2_esp32s3.menu.PSRAM.disabled.build.defines=
cyobot_v2_esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
cyobot_v2_esp32s3.menu.PSRAM.enabled=QSPI PSRAM
cyobot_v2_esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
cyobot_v2_esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
cyobot_v2_esp32s3.menu.PSRAM.opi=OPI PSRAM
cyobot_v2_esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
cyobot_v2_esp32s3.menu.PSRAM.opi.build.psram_type=opi

cyobot_v2_esp32s3.menu.FlashMode.qio=QIO 80MHz
cyobot_v2_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
cyobot_v2_esp32s3.menu.FlashMode.qio.build.boot=qio
cyobot_v2_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
cyobot_v2_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
cyobot_v2_esp32s3.menu.FlashMode.qio120=QIO 120MHz
cyobot_v2_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
cyobot_v2_esp32s3.menu.FlashMode.qio120.build.boot=qio
cyobot_v2_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
cyobot_v2_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
cyobot_v2_esp32s3.menu.FlashMode.dio=DIO 80MHz
cyobot_v2_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
cyobot_v2_esp32s3.menu.FlashMode.dio.build.boot=dio
cyobot_v2_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
cyobot_v2_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
cyobot_v2_esp32s3.menu.FlashMode.opi=OPI 80MHz
cyobot_v2_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
cyobot_v2_esp32s3.menu.FlashMode.opi.build.boot=opi
cyobot_v2_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
cyobot_v2_esp32s3.menu.FlashMode.opi.build.flash_freq=80m

cyobot_v2_esp32s3.menu.FlashSize.4M=4MB (32Mb)
cyobot_v2_esp32s3.menu.FlashSize.4M.build.flash_size=4MB
cyobot_v2_esp32s3.menu.FlashSize.8M=8MB (64Mb)
cyobot_v2_esp32s3.menu.FlashSize.8M.build.flash_size=8MB
cyobot_v2_esp32s3.menu.FlashSize.16M=16MB (128Mb)
cyobot_v2_esp32s3.menu.FlashSize.16M.build.flash_size=16MB
cyobot_v2_esp32s3.menu.FlashSize.32M=32MB (256Mb)
cyobot_v2_esp32s3.menu.FlashSize.32M.build.flash_size=32MB

cyobot_v2_esp32s3.menu.LoopCore.1=Core 1
cyobot_v2_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
cyobot_v2_esp32s3.menu.LoopCore.0=Core 0
cyobot_v2_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

cyobot_v2_esp32s3.menu.EventsCore.1=Core 1
cyobot_v2_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
cyobot_v2_esp32s3.menu.EventsCore.0=Core 0
cyobot_v2_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

cyobot_v2_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
cyobot_v2_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1
cyobot_v2_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
cyobot_v2_esp32s3.menu.USBMode.default.build.usb_mode=0

cyobot_v2_esp32s3.menu.CDCOnBoot.default=Disabled
cyobot_v2_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
cyobot_v2_esp32s3.menu.CDCOnBoot.cdc=Enabled
cyobot_v2_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

cyobot_v2_esp32s3.menu.MSCOnBoot.default=Disabled
cyobot_v2_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
cyobot_v2_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
cyobot_v2_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

