espressif/arduino-esp32/boards.txt
cyobot_v2_esp32s3.menu.DFUOnBoot.default=Disabled
cyobot_v2_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
cyobot_v2_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
cyobot_v2_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

cyobot_v2_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
cyobot_v2_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
cyobot_v2_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
cyobot_v2_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
cyobot_v2_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
cyobot_v2_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

cyobot_v2_esp32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.default.build.partitions=default
cyobot_v2_esp32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
cyobot_v2_esp32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
cyobot_v2_esp32s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
cyobot_v2_esp32s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
cyobot_v2_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
cyobot_v2_esp32s3.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
cyobot_v2_esp32s3.menu.PartitionScheme.no_fs.build.partitions=no_fs
cyobot_v2_esp32s3.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
cyobot_v2_esp32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
cyobot_v2_esp32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
cyobot_v2_esp32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
cyobot_v2_esp32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
cyobot_v2_esp32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
cyobot_v2_esp32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
cyobot_v2_esp32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
cyobot_v2_esp32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
cyobot_v2_esp32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
cyobot_v2_esp32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
cyobot_v2_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
cyobot_v2_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
cyobot_v2_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
cyobot_v2_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
cyobot_v2_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
cyobot_v2_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
cyobot_v2_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
cyobot_v2_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
cyobot_v2_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
cyobot_v2_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
cyobot_v2_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker=RainMaker 4MB
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
cyobot_v2_esp32s3.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
cyobot_v2_esp32s3.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
cyobot_v2_esp32s3.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
cyobot_v2_esp32s3.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
cyobot_v2_esp32s3.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
cyobot_v2_esp32s3.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
cyobot_v2_esp32s3.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
cyobot_v2_esp32s3.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
cyobot_v2_esp32s3.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
cyobot_v2_esp32s3.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
cyobot_v2_esp32s3.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
cyobot_v2_esp32s3.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
cyobot_v2_esp32s3.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
cyobot_v2_esp32s3.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
cyobot_v2_esp32s3.menu.PartitionScheme.custom=Custom
cyobot_v2_esp32s3.menu.PartitionScheme.custom.build.partitions=
cyobot_v2_esp32s3.menu.PartitionScheme.custom.upload.maximum_size=16777216

cyobot_v2_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
cyobot_v2_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
cyobot_v2_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
cyobot_v2_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
cyobot_v2_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
cyobot_v2_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
cyobot_v2_esp32s3.menu.CPUFreq.40=40MHz
cyobot_v2_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
cyobot_v2_esp32s3.menu.CPUFreq.20=20MHz
cyobot_v2_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
cyobot_v2_esp32s3.menu.CPUFreq.10=10MHz
cyobot_v2_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

cyobot_v2_esp32s3.menu.UploadSpeed.921600=921600
cyobot_v2_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
cyobot_v2_esp32s3.menu.UploadSpeed.115200=115200
cyobot_v2_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
cyobot_v2_esp32s3.menu.UploadSpeed.256000.windows=256000
cyobot_v2_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
cyobot_v2_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
cyobot_v2_esp32s3.menu.UploadSpeed.230400=230400
cyobot_v2_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
cyobot_v2_esp32s3.menu.UploadSpeed.460800.linux=460800
cyobot_v2_esp32s3.menu.UploadSpeed.460800.macosx=460800
cyobot_v2_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
cyobot_v2_esp32s3.menu.UploadSpeed.512000.windows=512000
cyobot_v2_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

cyobot_v2_esp32s3.menu.DebugLevel.none=None
cyobot_v2_esp32s3.menu.DebugLevel.none.build.code_debug=0
cyobot_v2_esp32s3.menu.DebugLevel.error=Error
cyobot_v2_esp32s3.menu.DebugLevel.error.build.code_debug=1
cyobot_v2_esp32s3.menu.DebugLevel.warn=Warn
cyobot_v2_esp32s3.menu.DebugLevel.warn.build.code_debug=2
cyobot_v2_esp32s3.menu.DebugLevel.info=Info
cyobot_v2_esp32s3.menu.DebugLevel.info.build.code_debug=3
cyobot_v2_esp32s3.menu.DebugLevel.debug=Debug
cyobot_v2_esp32s3.menu.DebugLevel.debug.build.code_debug=4
cyobot_v2_esp32s3.menu.DebugLevel.verbose=Verbose
cyobot_v2_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

cyobot_v2_esp32s3.menu.EraseFlash.none=Disabled
cyobot_v2_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
cyobot_v2_esp32s3.menu.EraseFlash.all=Enabled
cyobot_v2_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

cyobot_v2_esp32s3.menu.ZigbeeMode.default=Disabled
cyobot_v2_esp32s3.menu.ZigbeeMode.default.build.zigbee_mode=
cyobot_v2_esp32s3.menu.ZigbeeMode.default.build.zigbee_libs=
cyobot_v2_esp32s3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
cyobot_v2_esp32s3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
cyobot_v2_esp32s3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################
